A-especificacao.org
#+setupfile: static/setupfile.org
#+html_link_up: index.html
#+TITLE: Apêndice A: Especificação do Majestic Lisp
#+AUTHOR: Lucas S. Vieira
#+EMAIL: lucasvieira@protonmail.com
#+STARTUP: content latexpreview
#+options: toc:t

Este apêndice inclui  a especificação da linguagem  Majestic Lisp. Ele
poderá  ser utilizado  para  consultas mais  profundas relacionadas  à
implementação e execução de elementos da linguagem.

- Data de criação: <2020-07-19 dom>
- Última atualização: <2021-05-17 seg 23:41>

