A-especificacao.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-24 seg 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apêndice A: Especificação do Majestic Lisp</title>
<meta name="author" content="Lucas S. Vieira Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Apêndice A: Especificação do Majestic Lisp</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf545baa">1. Introdução</a>
<ul>
<li><a href="#orgeda13c5">1.1. Como ler este documento</a></li>
</ul>
</li>
<li><a href="#orga33e660">2. Dados</a>
<ul>
<li><a href="#orga8bf4e4">2.1. Símbolos</a></li>
<li><a href="#orgec271e6">2.2. Células <i>cons</i></a></li>
<li><a href="#org7900322">2.3. Caracteres</a></li>
<li><a href="#orgfc078c3">2.4. Streams</a></li>
<li><a href="#org0aca157">2.5. Números</a>
<ul>
<li><a href="#orgc3a1107">2.5.1. Inteiros</a></li>
<li><a href="#org8bca179">2.5.2. Frações</a></li>
<li><a href="#org79020de">2.5.3. Pontos flutuantes</a></li>
<li><a href="#org0d094f6">2.5.4. Complexos</a></li>
<li><a href="#org2cd2e1d">2.5.5. Coerções entre subtipos numéricos</a></li>
</ul>
</li>
<li><a href="#org7292e14">2.6. Dados atômicos e objetos</a></li>
</ul>
</li>
<li><a href="#org28b0d79">3. Listas</a>
<ul>
<li><a href="#org423d3a0">3.1. <span class="todo TODO">TODO</span> Listas pontuadas</a></li>
<li><a href="#orge1c225a">3.2. Listas adequadas</a></li>
<li><a href="#org82eb180">3.3. Notação abreviada de listas</a></li>
<li><a href="#org7e7cb8e">3.4. <span class="todo TODO">TODO</span> Listas associativas</a></li>
</ul>
</li>
<li><a href="#org46afd29">4. <span class="todo TODO">TODO</span> Vetores</a>
<ul>
<li><a href="#org12c929e">4.1. Notação de vetores</a></li>
<li><a href="#orgc6f2300">4.2. Tipo de um vetor</a>
<ul>
<li><a href="#orgbcf942a">4.2.1. Vetor de números inteiros</a></li>
<li><a href="#orge663bdf">4.2.2. Vetor de pontos flutuantes</a></li>
<li><a href="#org34b8a18">4.2.3. Vetor de caracteres</a></li>
<li><a href="#org1cf6abd">4.2.4. Vetor de qualquer tipo (Any)</a></li>
</ul>
</li>
<li><a href="#orgcaf69e7">4.3. <span class="todo TODO">TODO</span> Coerção entre tipos de vetores</a></li>
<li><a href="#org41b05fe">4.4. Strings</a>
<ul>
<li><a href="#org8e99eb3">4.4.1. Notação abreviada de strings</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2a7cf6c">5. Valores-verdade</a></li>
<li><a href="#org6e8d6e0">6. Funções</a>
<ul>
<li><a href="#org2b67136">6.1. Representação de clausuras</a></li>
<li><a href="#org88f1a0b">6.2. Representação alternativa de clausuras</a></li>
</ul>
</li>
<li><a href="#orge7599b4">7. Macros</a>
<ul>
<li><a href="#org6175448">7.1. Representação</a></li>
<li><a href="#org11630b4">7.2. Representação alternativa</a></li>
</ul>
</li>
<li><a href="#org3d174e9">8. Interpretação</a>
<ul>
<li><a href="#orge2a4111">8.1. Resultados de uma interpretação</a></li>
<li><a href="#org934385e">8.2. Chamadas de funções</a></li>
<li><a href="#org3199dfb">8.3. Formas especiais</a></li>
<li><a href="#org8f08237">8.4. <span class="todo TODO">TODO</span> Escopo</a></li>
</ul>
</li>
<li><a href="#orgde6bcf8">9. Ligações e Contextos</a>
<ul>
<li><a href="#orga4c904a">9.1. Ligações globais</a></li>
<li><a href="#org84f3467">9.2. Ligações léxicas ou estáticas</a></li>
<li><a href="#org448edc4">9.3. Ligações dinâmicas</a></li>
<li><a href="#orga5ff9f8">9.4. Mutabilidade</a></li>
</ul>
</li>
<li><a href="#org6064364">10. Erros</a></li>
<li><a href="#org8ba35d6">11. Axiomas</a>
<ul>
<li><a href="#org7398c10">11.1. Variáveis e constantes</a>
<ul>
<li><a href="#orgaa45278">11.1.1. Símbolos auto-interpretáveis</a></li>
<li><a href="#org53ad12f">11.1.2. Caracteres</a></li>
<li><a href="#orgdce789d">11.1.3. Números</a></li>
<li><a href="#org0f91f7c">11.1.4. Constantes globais</a></li>
</ul>
</li>
<li><a href="#org52409f7">11.2. Quote</a></li>
<li><a href="#orgf04cd8e">11.3. Funções Primitivas</a>
<ul>
<li><a href="#orgc8de040">11.3.1. Convenções</a></li>
<li><a href="#org4ae11eb">11.3.2. <code>(symbolp x)</code></a></li>
<li><a href="#org7b53e1e">11.3.3. <code>(eq x y)</code></a></li>
<li><a href="#org60e8471">11.3.4. <code>(nilp x)</code></a></li>
<li><a href="#org1cd6160">11.3.5. <code>(consp x)</code></a></li>
<li><a href="#org872a8b7">11.3.6. <code>(atomp x)</code></a></li>
<li><a href="#orgfd7d30f">11.3.7. <code>(charp x)</code></a></li>
<li><a href="#org58911f1">11.3.8. <code>(char= x y)</code></a></li>
<li><a href="#org9578239">11.3.9. <code>(streamp x)</code></a></li>
<li><a href="#org44a74d1">11.3.10. <code>(numberp x)</code></a></li>
<li><a href="#orgca253f5">11.3.11. <code>(vectorp x)</code></a></li>
<li><a href="#org1e83056">11.3.12. <code>(id x y)</code></a></li>
<li><a href="#org9c0522d">11.3.13. <code>(proper-list-p x)</code></a></li>
<li><a href="#org6de9649">11.3.14. <code>(stringp x)</code></a></li>
<li><a href="#orgc6bf322">11.3.15. <code>(literalp x)</code></a></li>
<li><a href="#org82f6c4e">11.3.16. <code>(primitivep x)</code></a></li>
<li><a href="#orgc1beee0">11.3.17. <code>(closurep x)</code></a></li>
<li><a href="#org93c8e44">11.3.18. <code>(functionp x)</code></a></li>
<li><a href="#org668ddeb">11.3.19. <code>(macrop x)</code></a></li>
<li><a href="#orgf69c3a8">11.3.20. <code>(errorp x)</code></a></li>
<li><a href="#org032b9a0">11.3.21. <code>(cons x y)</code></a></li>
<li><a href="#org6c04c37">11.3.22. <code>(car x)</code></a></li>
<li><a href="#org5a0b28f">11.3.23. <code>(cdr x)</code></a></li>
<li><a href="#orgc24a07a">11.3.24. <code>(copy x)</code></a></li>
<li><a href="#orgb565c52">11.3.25. <code>(length x)</code></a></li>
<li><a href="#orga57edce">11.3.26. <code>(depth x)</code></a></li>
<li><a href="#org965085e">11.3.27. <code>(type x)</code></a></li>
<li><a href="#org30cbb4e">11.3.28. <code>(intern x)</code></a></li>
<li><a href="#orgfb4b9e2">11.3.29. <code>(name x)</code></a></li>
<li><a href="#org1b38ffe">11.3.30. <code>(get-environment type)</code></a></li>
<li><a href="#org5f859ae">11.3.31. <code>(coin)</code></a></li>
<li><a href="#org08da3d4">11.3.32. <code>(sys com . args)</code></a></li>
<li><a href="#org3e975ff">11.3.33. <code>(format fmt . rest)</code></a></li>
<li><a href="#orgfa75b1c">11.3.34. <code>(err fmt . rest)</code></a></li>
<li><a href="#org430f544">11.3.35. <code>(warn fmt . rest)</code></a></li>
<li><a href="#org5b5ea5c">11.3.36. <code>(list . rest)</code></a></li>
<li><a href="#org925d662">11.3.37. <code>(append . rest)</code></a></li>
<li><a href="#orga04122d">11.3.38. <code>(last x)</code></a></li>
<li><a href="#orgb89e7b5">11.3.39. <code>(reverse x)</code></a></li>
<li><a href="#orge43f4bf">11.3.40. <code>(nthcdr n lst)</code></a></li>
<li><a href="#orgaa09a6f">11.3.41. <code>(nth n lst)</code></a></li>
<li><a href="#orga0dc269">11.3.42. <code>(macroexpand-1 x)</code></a></li>
<li><a href="#orgb215998">11.3.43. <code>(not x)</code></a></li>
<li><a href="#orgf2c7c6f">11.3.44. <code>(gensym)</code></a></li>
<li><a href="#org2c9db82">11.3.45. <code>(terpri)</code></a></li>
<li><a href="#orgcc46024">11.3.46. <code>(display x)</code></a></li>
<li><a href="#org7d9f96a">11.3.47. <span class="todo TODO">TODO</span> <code>(pretty-display x)</code></a></li>
<li><a href="#orgdb64f9b">11.3.48. <code>(print fmt . rest)</code></a></li>
<li><a href="#org0d0ce2f">11.3.49. <code>(load path)</code></a></li>
<li><a href="#orgfb71f3e">11.3.50. <code>(equal x y)</code></a></li>
</ul>
</li>
<li><a href="#orgcf94c15">11.4. Funções para vetores</a>
<ul>
<li><a href="#org5edfd85">11.4.1. <code>(vector . rest)</code></a></li>
<li><a href="#org54f5896">11.4.2. <code>(vec-type vec)</code></a></li>
<li><a href="#org0905ffa">11.4.3. <code>(vec-coerce type vec)</code></a></li>
<li><a href="#org06a8caf">11.4.4. <code>(vec-push x vec)</code></a></li>
<li><a href="#orgd0c7eec">11.4.5. <code>(vec-set pos x vec)</code></a></li>
<li><a href="#org45ac863">11.4.6. <code>(vec-pop vec)</code></a></li>
<li><a href="#orgd682da6">11.4.7. <code>(vec-deq vec)</code></a></li>
<li><a href="#orgafbc6dd">11.4.8. <code>(vec-length vec)</code></a></li>
<li><a href="#orgb7aa2db">11.4.9. <code>(vec-at pos vec)</code></a></li>
<li><a href="#org6ea599a">11.4.10. <code>(vec-remove pos vec)</code></a></li>
<li><a href="#orgce92312">11.4.11. <code>(vec-insert pos x vec)</code></a></li>
<li><a href="#org502ddc2">11.4.12. <code>(vector= va vb)</code></a></li>
</ul>
</li>
<li><a href="#org4f7b926">11.5. Funções numéricas</a>
<ul>
<li><a href="#org3fe7e73">11.5.1. Coerção e extração de elementos</a></li>
<li><a href="#org18da30a">11.5.2. Operações aritméticas</a></li>
<li><a href="#org6699b74">11.5.3. Miscelânea</a></li>
</ul>
</li>
<li><a href="#orgca17dce">11.6. <span class="todo TODO">TODO</span> Operações de comparação</a>
<ul>
<li><a href="#org07f161d">11.6.1. <code>(= x y . rest)</code></a></li>
<li><a href="#orgf67bf6c">11.6.2. <code>(float= x y)</code></a></li>
<li><a href="#orgff8cf3d">11.6.3. <code>(&gt; x y . rest)</code></a></li>
<li><a href="#org859b05a">11.6.4. <code>(&lt; x y . rest)</code></a></li>
<li><a href="#orgcc26525">11.6.5. <code>(&gt;= x y . rest)</code></a></li>
<li><a href="#orge7b18b3">11.6.6. <code>(&lt;= x y . rest)</code></a></li>
</ul>
</li>
<li><a href="#org1900003">11.7. <span class="todo TODO">TODO</span> Funções de streams</a>
<ul>
<li><a href="#org49006eb">11.7.1. Abertura, fechamento e status de streams</a></li>
<li><a href="#org5f74711">11.7.2. <span class="todo TODO">TODO</span> Leitura e escrita em streams</a></li>
</ul>
</li>
<li><a href="#orge549ebd">11.8. <span class="todo TODO">TODO</span> Formas Especiais</a>
<ul>
<li><a href="#orgbf4e46d">11.8.1. <code>(quote x)</code></a></li>
<li><a href="#org535dfd5">11.8.2. <code>(def sym val)</code></a></li>
<li><a href="#orgef8f555">11.8.3. <code>(set sym val)</code></a></li>
<li><a href="#org9312d62">11.8.4. <code>(set-car x val)</code></a></li>
<li><a href="#orgfc7b2ac">11.8.5. <code>(set-cdr x val)</code></a></li>
<li><a href="#org32a89e2">11.8.6. <code>(if pred conseq altern)</code></a></li>
<li><a href="#org4c27129">11.8.7. <code>(fn lambda-list . body)</code></a></li>
<li><a href="#org98fe1ff">11.8.8. <code>(mac lambda-list . body)</code></a></li>
<li><a href="#org84551ca">11.8.9. <code>(quasiquote x)</code>, <code>(unquote x)</code>, <code>(unquote-splice x)</code></a></li>
<li><a href="#org726a052">11.8.10. <code>(do . rest)</code></a></li>
<li><a href="#org08f2467">11.8.11. <span class="todo TODO">TODO</span> <code>(apply fun args)</code></a></li>
<li><a href="#org60aa373">11.8.12. <code>(while pred . body)</code></a></li>
<li><a href="#orgc06bf0f">11.8.13. <code>(and . rest)</code></a></li>
<li><a href="#org3664058">11.8.14. <code>(or . rest)</code></a></li>
<li><a href="#org72c097c">11.8.15. <code>(letrec bindings . body)</code></a></li>
<li><a href="#org0190fba">11.8.16. <code>(unwind-protect expr cleanup)</code></a></li>
</ul>
</li>
<li><a href="#orgb5f4b07">11.9. Macros do leitor de expressões</a>
<ul>
<li><a href="#org30f5a4a">11.9.1. Quote (<code>'</code>)</a></li>
<li><a href="#org3a26282">11.9.2. Quasiquote (<code>`</code>)</a></li>
<li><a href="#orgc8e55aa">11.9.3. Unquote (<code>,</code>)</a></li>
<li><a href="#org98bb2e3">11.9.4. Unquote-Splice (<code>,@</code>)</a></li>
<li><a href="#orgc471081">11.9.5. Sintaxe de vetores (<code>[ ]</code>)</a></li>
</ul>
</li>
<li><a href="#org52f4cd2">11.10. Macros</a>
<ul>
<li><a href="#org7233547">11.10.1. <code>(cond . clauses)</code></a></li>
<li><a href="#org599a342">11.10.2. <code>(defn name lambda-list . body)</code></a></li>
<li><a href="#orgc6d426c">11.10.3. <code>(defmac name lambda-list . body)</code></a></li>
<li><a href="#orgfefcf05">11.10.4. <code>(let bindings . body)</code></a></li>
<li><a href="#orgbe7d3d7">11.10.5. <code>(let* bindings . body)</code></a></li>
<li><a href="#org17ee99e">11.10.6. <code>(letfn bindings . body)</code></a></li>
<li><a href="#org838ea11">11.10.7. <code>(letfn* bindings . body)</code></a></li>
<li><a href="#orgda5580b">11.10.8. <code>(when pred . body)</code></a></li>
<li><a href="#org1a0e476">11.10.9. <code>(unless pred . body)</code></a></li>
<li><a href="#org670696f">11.10.10. <code>(until pred . body)</code></a></li>
<li><a href="#orgdeb3349">11.10.11. <code>(repeat n . body)</code></a></li>
<li><a href="#orgd94da1b">11.10.12. <code>(with-open-stream (sym dir file) . body)</code></a></li>
<li><a href="#org34d9724">11.10.13. <span class="todo TODO">TODO</span> Variações de <code>car</code> e <code>cdr</code></a></li>
</ul>
</li>
<li><a href="#orgf055758">11.11. <span class="todo TODO">TODO</span> Miscelânea</a>
<ul>
<li><a href="#orga8c1eee">11.11.1. <code>(map f (x . xs))</code></a></li>
<li><a href="#org234110e">11.11.2. <code>(mapc f (x . xs))</code></a></li>
<li><a href="#orgfedb551">11.11.3. <code>(assp proc (x . xs))</code></a></li>
<li><a href="#org1cfcc3d">11.11.4. <code>(assoc sym alist)</code></a></li>
<li><a href="#orgeeb099a">11.11.5. <code>(member elt lst)</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga8fef64">12. <span class="todo TODO">TODO</span> Aplicação</a>
<ul>
<li><a href="#org2c88f13">12.1. Aplicação de clausuras</a></li>
<li><a href="#orgcfb87d1">12.2. Aplicação de primitivas</a></li>
<li><a href="#orga8ca59a">12.3. Aplicação de macros</a></li>
</ul>
</li>
<li><a href="#org12ee3f1">13. <span class="todo TODO">TODO</span> Interpretação</a></li>
</ul>
</div>
</div>
<p>
Este apêndice inclui  a especificação da linguagem  Majestic Lisp. Ele
poderá  ser utilizado  para  consultas mais  profundas relacionadas  à
implementação e execução de elementos da linguagem.
</p>

<ul class="org-ul">
<li>Data de criação: <span class="timestamp-wrapper"><span class="timestamp">&lt;2020-07-19 dom&gt;</span></span></li>
<li>Última atualização: <span class="timestamp-wrapper"><span class="timestamp">&lt;2021-05-17 seg 23:41&gt;</span></span></li>
</ul>
