A-especificacao.org
* Introdução

Majestic  Lisp é  uma linguagem  de  programação, um  dialeto de  Lisp
construido   principalmente  para   propósitos  educacionais.   Ela  é
inspirada em  dialetos Lisp  como Bel, Common  Lisp e  Clojure. Também
recebe alguma  inspiração de outras  linguagens, como APL.  Majestic é
escrita como um /programa instruído/[fn:1],  em forma de livro, de forma
a possibilitar que leitores pudessem reimplementá-la e também aprender
a respeito da implementação de linguagens Lisp.

Os objetivos de Majestic Lisp são:

- Prover  uma  linguagem  que  poderia  ter  propósitos  educacionais,
  através de uma implementação didática.
- Delegar performance em  favor de corretude, uma  vez que performance
  não é um tópico central, ainda que desejada em alguns pontos.
- Prover  um dialeto  simples  de  uma linguagem  Lisp,  de forma  que
  programadores Lisp veteranos possam se sentir em casa ao usá-lo.
- Mostrar que projetar e implementar  sua própria linguagem Lisp não é
  uma tarefa intangível.
- Prover uma linguagem  suficientemente simples para que,  mesmo que o
  programador não possa  executar seu interpretador, ele  ou ela possa
  ainda prever o resultado de uma interpretação algebricamente.

A especificação de Majestic Lisp  é vagamente baseada na especificação
de Bel, tomando  para si alguns fragmentos da  estrutura dessa segunda
linguagem, em doses  moderadas. O motivo para tal  está na recuperação
de um  modelo de interpretação primariamente  baseado no processamento
de  listas, e  utilizando  predominantemente  listas para  representar
alguns dos objetos complexos da linguagem.

Adicionalmente,  pertinência de  conceitos durante  a implementação  é
considerada  e, por  este motivo,  tem-se elementos  atômicos que  não
sejam representados como  listas, mas sim a partir  de dados atômicos,
como é o caso dos números.

Esta  especificação não  determina  um modelo  de memória  específico,
sendo  portanto  função do  programador  determinar  a pertinência  de
ideias  na  implementação  da   linguagem,  desde  que  mantenham  sua
corretude na execução.

As seções a seguir procuram descrever Majestic Lisp em profundidade, e
podem ser modificadas no curso de desenvolvimento da linguagem.

** Como ler este documento

Ao   longo  deste   documento,   toda  e   qualquer  demonstração   de
interpretação  de  um bloco  será  feita  através  de duas  linhas  de
exemplo:  na primeira,  prefixa-se o  bloco a  ser interpretado  com o
caractere ~>~.  Logo abaixo  da linha  final do bloco  em questão  a ser
interpretado, mostra-se o resultado esperado. Por exemplo:

#+begin_example
> (+ 2 3)
5
#+end_example

Adicionalmente,  quando a  execução de  uma certa  expressão pressupõe
saída de texto  para o console, tal saída será  inserida entre o valor
de  retorno e  a  entrada do  usuário,  e prefixada  em  linhas com  o
caractere ~;~, seguido de um espaço por linha de saída:

#+begin_example
> (display "Hello world")
; Hello world
nil
#+end_example

O  exemplo acima  demonstra uma  situação onde  a execução  do comando
imprime ~Hello world~ na tela, sem  uma quebra de linha ao final. Quando
ocorrer quebra  de linha,  esta será  indicada por  uma nova  linha de
saída, sendo todavia vazia:

#+begin_example
> (print "Hello world")
; Hello world
;
nil
#+end_example

* Dados

Majestic  Lisp inicia  sua  construção  a partir  de  seus dados,  que
dividem-se em  cinco tipos fundamentais: /símbolos/,  /conses/ (ou /células
cons/), /caracteres/, /streams/ e /números/.

** Símbolos

Símbolos são  como palavras. Cada  símbolo representa um  elemento que
atua como rótulo, e que tem valor por si mesmo:

#+begin_example
foo
bar
baz
#+end_example

Os nomes de  símbolos são sensíveis a maiúsculas  e minúsculas. Assim,
~foo~ e ~Foo~ são símbolos distintos.

Alguns símbolos são auto-interpretáveis, sendo portanto classificáveis
como /rótulos para si mesmos/:

#+begin_example
t
nil
&
apply
#+end_example

** Células /cons/

Células  /cons/ são  pares  de quaisquer  duas  coisas, representando  a
forma  mais  primitiva de  composição  de  elementos. Elas  podem  ser
textualmente representadas dessa forma:

#+begin_example
(foo . bar)
#+end_example

Este é  um /cons/ de  dois símbolos, ~foo~  e ~bar~. Por  razões históricas,
podemos chamar a primeira metade do /cons/ de /car/, e a segunda metade de
/cdr/.

As duas  metades dos pares  podem ser  quaisquer coisas, o  que também
inclui outras células /cons/:

#+begin_example
(foo . (bar . baz))
#+end_example

Este é um /cons/ entre o símbolo ~foo~ e o /cons/ ~(bar . baz)~.

** Caracteres

Um   caractere  é   representado   sempre  tendo   os  caracteres   de
/jogo-da-velha/  e  /backslash/   como  prefixos.  Assim,  a   letra  ~a~  é
representada na forma:

#+begin_example
#\a
#+end_example

Caracteres que não  sejam letras podem possuir nomes  mais longos. Por
exemplo, o caractere de alerta (/bell/) pode ser representado como

#+begin_example
#\bel
#+end_example

Outros exemplos de caracteres com formas longas são:

#+begin_example
#\tab
#\space
#\newline
#+end_example

