A-especificacao.html

<div id="outline-container-orgf545baa" class="outline-2">
<h2 id="orgf545baa"><span class="section-number-2">1.</span> Introdução</h2>
<div class="outline-text-2" id="text-1">
<p>
Majestic  Lisp é  uma linguagem  de  programação, um  dialeto de  Lisp
construido   principalmente  para   propósitos  educacionais.   Ela  é
inspirada em  dialetos Lisp  como Bel, Common  Lisp e  Clojure. Também
recebe alguma  inspiração de outras  linguagens, como APL.  Majestic é
escrita como um <i>programa instruído</i><sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>,  em forma de livro, de forma
a possibilitar que leitores pudessem reimplementá-la e também aprender
a respeito da implementação de linguagens Lisp.
</p>

<p>
Os objetivos de Majestic Lisp são:
</p>

<ul class="org-ul">
<li>Prover  uma  linguagem  que  poderia  ter  propósitos  educacionais,
através de uma implementação didática.</li>
<li>Delegar performance em  favor de corretude, uma  vez que performance
não é um tópico central, ainda que desejada em alguns pontos.</li>
<li>Prover  um dialeto  simples  de  uma linguagem  Lisp,  de forma  que
programadores Lisp veteranos possam se sentir em casa ao usá-lo.</li>
<li>Mostrar que projetar e implementar  sua própria linguagem Lisp não é
uma tarefa intangível.</li>
<li>Prover uma linguagem  suficientemente simples para que,  mesmo que o
programador não possa  executar seu interpretador, ele  ou ela possa
ainda prever o resultado de uma interpretação algebricamente.</li>
</ul>

<p>
A especificação de Majestic Lisp  é vagamente baseada na especificação
de Bel, tomando  para si alguns fragmentos da  estrutura dessa segunda
linguagem, em doses  moderadas. O motivo para tal  está na recuperação
de um  modelo de interpretação primariamente  baseado no processamento
de  listas, e  utilizando  predominantemente  listas para  representar
alguns dos objetos complexos da linguagem.
</p>

<p>
Adicionalmente,  pertinência de  conceitos durante  a implementação  é
considerada  e, por  este motivo,  tem-se elementos  atômicos que  não
sejam representados como  listas, mas sim a partir  de dados atômicos,
como é o caso dos números.
</p>

<p>
Esta  especificação não  determina  um modelo  de memória  específico,
sendo  portanto  função do  programador  determinar  a pertinência  de
ideias  na  implementação  da   linguagem,  desde  que  mantenham  sua
corretude na execução.
</p>

<p>
As seções a seguir procuram descrever Majestic Lisp em profundidade, e
podem ser modificadas no curso de desenvolvimento da linguagem.
</p>
</div>

<div id="outline-container-orgeda13c5" class="outline-3">
<h3 id="orgeda13c5"><span class="section-number-3">1.1.</span> Como ler este documento</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Ao   longo  deste   documento,   toda  e   qualquer  demonstração   de
interpretação  de  um bloco  será  feita  através  de duas  linhas  de
exemplo:  na primeira,  prefixa-se o  bloco a  ser interpretado  com o
caractere <code>&gt;</code>.  Logo abaixo  da linha  final do bloco  em questão  a ser
interpretado, mostra-se o resultado esperado. Por exemplo:
</p>

<pre class="example" id="org020b74c">
&gt; (+ 2 3)
5
</pre>

<p>
Adicionalmente,  quando a  execução de  uma certa  expressão pressupõe
saída de texto  para o console, tal saída será  inserida entre o valor
de  retorno e  a  entrada do  usuário,  e prefixada  em  linhas com  o
caractere <code>;</code>, seguido de um espaço por linha de saída:
</p>

<pre class="example" id="org7b7824e">
&gt; (display "Hello world")
; Hello world
nil
</pre>

<p>
O  exemplo acima  demonstra uma  situação onde  a execução  do comando
imprime <code>Hello world</code> na tela, sem  uma quebra de linha ao final. Quando
ocorrer quebra  de linha,  esta será  indicada por  uma nova  linha de
saída, sendo todavia vazia:
</p>

<pre class="example" id="orgc22c376">
&gt; (print "Hello world")
; Hello world
;
nil
</pre>
</div>
</div>
</div>

<div id="outline-container-orga33e660" class="outline-2">
<h2 id="orga33e660"><span class="section-number-2">2.</span> Dados</h2>
<div class="outline-text-2" id="text-2">
<p>
Majestic  Lisp inicia  sua  construção  a partir  de  seus dados,  que
dividem-se em  cinco tipos fundamentais: <i>símbolos</i>,  <i>conses</i> (ou <i>células
cons</i>), <i>caracteres</i>, <i>streams</i> e <i>números</i>.
</p>
</div>

<div id="outline-container-orga8bf4e4" class="outline-3">
<h3 id="orga8bf4e4"><span class="section-number-3">2.1.</span> Símbolos</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Símbolos são  como palavras. Cada  símbolo representa um  elemento que
atua como rótulo, e que tem valor por si mesmo:
</p>

<pre class="example" id="org3273433">
foo
bar
baz
</pre>

<p>
Os nomes de  símbolos são sensíveis a maiúsculas  e minúsculas. Assim,
<code>foo</code> e <code>Foo</code> são símbolos distintos.
</p>

<p>
Alguns símbolos são auto-interpretáveis, sendo portanto classificáveis
como <i>rótulos para si mesmos</i>:
</p>

<pre class="example" id="org383c8ed">
t
nil
&amp;
apply
</pre>
</div>
</div>

<div id="outline-container-orgec271e6" class="outline-3">
<h3 id="orgec271e6"><span class="section-number-3">2.2.</span> Células <i>cons</i></h3>
<div class="outline-text-3" id="text-2-2">
<p>
Células  <i>cons</i> são  pares  de quaisquer  duas  coisas, representando  a
forma  mais  primitiva de  composição  de  elementos. Elas  podem  ser
textualmente representadas dessa forma:
</p>

<pre class="example" id="orgfe8cb0a">
(foo . bar)
</pre>

<p>
Este é  um <i>cons</i> de  dois símbolos, <code>foo</code>  e <code>bar</code>. Por  razões históricas,
podemos chamar a primeira metade do <i>cons</i> de <i>car</i>, e a segunda metade de
<i>cdr</i>.
</p>

<p>
As duas  metades dos pares  podem ser  quaisquer coisas, o  que também
inclui outras células <i>cons</i>:
</p>

<pre class="example" id="orgdf24230">
(foo . (bar . baz))
</pre>

<p>
Este é um <i>cons</i> entre o símbolo <code>foo</code> e o <i>cons</i> <code>(bar . baz)</code>.
</p>
</div>
</div>

<div id="outline-container-org7900322" class="outline-3">
<h3 id="org7900322"><span class="section-number-3">2.3.</span> Caracteres</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Um   caractere  é   representado   sempre  tendo   os  caracteres   de
<i>jogo-da-velha</i>  e  <i>backslash</i>   como  prefixos.  Assim,  a   letra  <code>a</code>  é
representada na forma:
</p>

<pre class="example" id="orgaf2a905">
#\a
</pre>

<p>
Caracteres que não  sejam letras podem possuir nomes  mais longos. Por
exemplo, o caractere de alerta (<i>bell</i>) pode ser representado como
</p>

<pre class="example" id="orga8f1d27">
#\bel
</pre>

<p>
Outros exemplos de caracteres com formas longas são:
</p>

<pre class="example" id="orgd754e4e">
#\tab
#\space
#\newline
</pre>
</div>
</div>
