A-especificacao.org
** Streams

# TODO: Citar Ballesteros, pp. 55-56

/Streams/ são elementos primitivos  utilizados para interação envolvendo
entrada/saída na linguagem Majestic Lisp. De certa forma, /streams/ agem
como           descritores          de           arquivo          (ver
[[citet:silberschatz2015][p. 445]]), no  âmbito do interpretador,
podendo  ser representados  como um  valor inteiro  que identifica  um
arquivo aberto pelo sistema.

Sua  função  é  prover  uma   abstração  básica  para  manipulação  de
informações  armazenadas em  memória  persistente, de  forma que  tais
informações  não precisem  estar todo  o tempo  na memória  volátil da
máquina.

As  idiossincrasias   de  abertura  desse  arquivo   (como  o  formato
identificador do caminho  para tal e outros  atributos) dizem respeito
ao sistema em execução, sendo  imperativo que possam ser representados
textualmente.  Por  exemplo,  em  um  sistema  Unix-like  onde  faz-se
interface com um /sistema de arquivos/,  pode-se abrir um /stream/ para um
arquivo  cujo  caminho   seja  ~/home/user/arquivo.txt~;  portanto,  tal
caminho será a representação textual  para um arquivo a ser processado
durante a criação, uso e fechamento de um objeto do tipo /stream/.

Não  há forma  textual  para  representação de  um  /stream/. Assim,  se
Majestic precisa exibir  um /stream/, será impresso na  tela algum texto
que causaria um erro, caso esse mesmo texto fosse interpretado.

/Streams/  podem estar  /abertos/ ou  /fechados/. Um  /stream/ aberto  permite
operações de escrita ou recuperação  de informações; um /stream/ fechado
não permite tal escrita ou recuperação.

/Streams/ também podem ser de entrada  (~in~) ou saída (~out~). Um /stream/ de
entrada permite que  dados sejam recuperados dele; um  /stream/ de saída
permite que  dados sejam escritos  nele, sendo então inseridos  em sua
devida abstração de destino. Não  é possível recuperar elementos de um
/stream/  de saída,  bem como  não é  possível inserir  elementos em  um
/stream/ de entrada.

/Streams/ não podem ser de /saída/ e /entrada/ ao mesmo tempo. Ademais, dois
ou mais  /streams/ não podem  modificar o  mesmo objeto no  sistema (por
exemplo, em  sistemas Unix,  não se  pode abrir  dois /streams/  para um
mesmo arquivo, independentemente da direção de tais /streams/).

Um /stream/ possui também uma espécie  de cursor interno. Para um /stream/
de saída,  este cursor  estará sempre  ao final  do mesmo,  onde novos
dados  serão  inseridos;  para  um  /stream/  de  entrada,  este  cursor
inicia-se no  início do /stream/, e  move-se ao longo do  mesmo à medida
que  informações forem  sendo lidas  do  mesmo, até  que alcancem  seu
final.

Por padrão, os três primeiros /streams/ (idealmente de valores ~0~, ~1~ e ~2~,
por exemplo)  são reservados, respectivamente, aos  /streams/ especiais
~*stdin*~ (entrada  padrão), ~*stdout*~  (saída padrão) e  ~*stderr*~ (saída
para erros). Assume-se  que tais /streams/ existem durante  todo o tempo
de vida da execução do interpretador.

** Números

Números  são tratados  como apenas  um tipo  em Majestic.  Todavia, os
mesmos desdobram-se  em quatro subtipos informais  de números, podendo
então serem  interpretados como  números /inteiros/,  /pontos flutuantes/,
/frações/ e /complexos/.

A  forma  como  estes  números   são  armazenados  na  memória  não  é
extremamente  relevante,  ficando a  cargo  do  programador caso  seja
necessário garantir  alguma performance.

Números são  primariamente elementos atômicos e,  ainda que constituam
sua própria  classe de  elementos, assemelham-se ao  que compreendemos
como  símbolos auto-interpretáveis;  a representação  simbólica de  um
número é,  portanto, sempre  igual a si  mesma, com  algumas ressalvas
quando for necessária a simplificação de tal número.

*** Inteiros

Números inteiros são números escritos  como algarismos, podendo ou não
ser prefixados por um sinal negativo:

#+begin_example
1
0
-1
50
295
#+end_example

Números   inteiros  estão   relacionados  ao   conceito  homônimo   da
matemática, que determina o conjunto $\mathbb{Z}$.

*** Frações

Números fracionários são um  tipo semi-recursivo, representados sempre
através  de   números  /inteiros/  nos  seus   respectivos  numerador  e
denominador. Podem  ser escritos  com um  /slash/ entre  seus elementos,
que funciona como um separador:

#+begin_example
2/3
3/4
5/8
99/100
5/2
-10/3
#+end_example

Estes  números correspondem  ao  conceito matemático  do conjunto  dos
números /racionais/, podendo este ser representado como

\begin{equation*}
        \mathbb{Q} = \left\{\frac{p}{q}\, \mid \, p \in \mathbb{Z}, q \in \mathbb{Z}^{*} \right\}
\end{equation*}

Esta definição sugere, portanto, que quaisquer frações expressadas com
denominador nulo constituirão erro de sintaxe.

O uso de outros subtipos  (pontos flutuantes, outras frações e números
complexos) como respectivos numeradores  e denominadores de uma fração
é sintaticamente incorreto.

As  frações  devem   sempre  ser  interpretadas  em   sua  forma  mais
simplificada  possível,   inclusive  sofrendo  coerções   para  outros
subtipos numéricos, caso seja necessário,  desde que não haja perda na
precisão da informação.

Por exemplo,  uma fração como  ~2/4~, durante  o processo de  leitura, é
simplificada para ~1/2~.

Igualmente, uma fração como ~5/1~ é diretamente convertida para o número
inteiro ~5~, sendo portanto pertencente  ao subtipo numérico dos números
inteiros; isto ocorrerá  sempre que o denominador da  fração for igual
ao número ~1~.

A   fração   pode  ser   precedida   pelo   sinal  /negativo/   em   seu
numerador. Caso o sinal negativo  seja expressado no denominador, este
sinal será repassado  ao numerador; caso numerado  e denominador sejam
expressados com  sinal negativo,  então ambos numerador  e denominador
tornar-se-ão positivos. Assim, ~4/-9~ torna-se ~-4/9~, e ~-4/-9~ torna-se ~4/9~.

*** Pontos flutuantes

Pontos flutuantes *emulam parcialmente* o conceito matemático de números
reais  (conjunto $\mathbb{R}$),  e são  sempre escritos  utilizando uma
notação com  *exatamente um  ponto* em algum  lugar do  número. Ademais,
também podem ser prefixados por um sinal negativo:

#+begin_example
2.
.5
20.2
-16.3
-.9
-7.
#+end_example

Os números acima  correspondem exatamente aos valores  ~2.0~, ~0.5~, ~20.2~,
~-16.3~,  ~-0.9~ e  ~-7.0~. Para  facilitar a  implementação, estes  números
podem ser  escritos pelo interpretador  sempre em sua  forma completa,
onde os zeros poderiam ser ignorados.

