A-especificacao.html

<div id="outline-container-orgfc078c3" class="outline-3">
<h3 id="orgfc078c3"><span class="section-number-3">2.4.</span> Streams</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<i>Streams</i> são elementos primitivos  utilizados para interação envolvendo
entrada/saída na linguagem Majestic Lisp. De certa forma, <i>streams</i> agem
como           descritores          de           arquivo          (ver
<a href="silberschatz2015">p. 445</a>), no  âmbito do interpretador,
podendo  ser representados  como um  valor inteiro  que identifica  um
arquivo aberto pelo sistema.
</p>

<p>
Sua  função  é  prover  uma   abstração  básica  para  manipulação  de
informações  armazenadas em  memória  persistente, de  forma que  tais
informações  não precisem  estar todo  o tempo  na memória  volátil da
máquina.
</p>

<p>
As  idiossincrasias   de  abertura  desse  arquivo   (como  o  formato
identificador do caminho  para tal e outros  atributos) dizem respeito
ao sistema em execução, sendo  imperativo que possam ser representados
textualmente.  Por  exemplo,  em  um  sistema  Unix-like  onde  faz-se
interface com um <i>sistema de arquivos</i>,  pode-se abrir um <i>stream</i> para um
arquivo  cujo  caminho   seja  <code>/home/user/arquivo.txt</code>;  portanto,  tal
caminho será a representação textual  para um arquivo a ser processado
durante a criação, uso e fechamento de um objeto do tipo <i>stream</i>.
</p>

<p>
Não  há forma  textual  para  representação de  um  <i>stream</i>. Assim,  se
Majestic precisa exibir  um <i>stream</i>, será impresso na  tela algum texto
que causaria um erro, caso esse mesmo texto fosse interpretado.
</p>

<p>
<i>Streams</i>  podem estar  <i>abertos</i> ou  <i>fechados</i>. Um  <i>stream</i> aberto  permite
operações de escrita ou recuperação  de informações; um <i>stream</i> fechado
não permite tal escrita ou recuperação.
</p>

<p>
<i>Streams</i> também podem ser de entrada  (<code>in</code>) ou saída (<code>out</code>). Um <i>stream</i> de
entrada permite que  dados sejam recuperados dele; um  <i>stream</i> de saída
permite que  dados sejam escritos  nele, sendo então inseridos  em sua
devida abstração de destino. Não  é possível recuperar elementos de um
<i>stream</i>  de saída,  bem como  não é  possível inserir  elementos em  um
<i>stream</i> de entrada.
</p>

<p>
<i>Streams</i> não podem ser de <i>saída</i> e <i>entrada</i> ao mesmo tempo. Ademais, dois
ou mais  <i>streams</i> não podem  modificar o  mesmo objeto no  sistema (por
exemplo, em  sistemas Unix,  não se  pode abrir  dois <i>streams</i>  para um
mesmo arquivo, independentemente da direção de tais <i>streams</i>).
</p>

<p>
Um <i>stream</i> possui também uma espécie  de cursor interno. Para um <i>stream</i>
de saída,  este cursor  estará sempre  ao final  do mesmo,  onde novos
dados  serão  inseridos;  para  um  <i>stream</i>  de  entrada,  este  cursor
inicia-se no  início do <i>stream</i>, e  move-se ao longo do  mesmo à medida
que  informações forem  sendo lidas  do  mesmo, até  que alcancem  seu
final.
</p>

<p>
Por padrão, os três primeiros <i>streams</i> (idealmente de valores <code>0</code>, <code>1</code> e <code>2</code>,
por exemplo)  são reservados, respectivamente, aos  <i>streams</i> especiais
<code>*stdin*</code> (entrada  padrão), <code>*stdout*</code>  (saída padrão) e  <code>*stderr*</code> (saída
para erros). Assume-se  que tais <i>streams</i> existem durante  todo o tempo
de vida da execução do interpretador.
</p>
</div>
</div>

<div id="outline-container-org0aca157" class="outline-3">
<h3 id="org0aca157"><span class="section-number-3">2.5.</span> Números</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Números  são tratados  como apenas  um tipo  em Majestic.  Todavia, os
mesmos desdobram-se  em quatro subtipos informais  de números, podendo
então serem  interpretados como  números <i>inteiros</i>,  <i>pontos flutuantes</i>,
<i>frações</i> e <i>complexos</i>.
</p>

<p>
A  forma  como  estes  números   são  armazenados  na  memória  não  é
extremamente  relevante,  ficando a  cargo  do  programador caso  seja
necessário garantir  alguma performance.
</p>

<p>
Números são  primariamente elementos atômicos e,  ainda que constituam
sua própria  classe de  elementos, assemelham-se ao  que compreendemos
como  símbolos auto-interpretáveis;  a representação  simbólica de  um
número é,  portanto, sempre  igual a si  mesma, com  algumas ressalvas
quando for necessária a simplificação de tal número.
</p>
</div>

<div id="outline-container-orgc3a1107" class="outline-4">
<h4 id="orgc3a1107"><span class="section-number-4">2.5.1.</span> Inteiros</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Números inteiros são números escritos  como algarismos, podendo ou não
ser prefixados por um sinal negativo:
</p>

<pre class="example" id="org08c51a3">
1
0
-1
50
295
</pre>

<p>
Números   inteiros  estão   relacionados  ao   conceito  homônimo   da
matemática, que determina o conjunto \(\mathbb{Z}\).
</p>
</div>
</div>

<div id="outline-container-org8bca179" class="outline-4">
<h4 id="org8bca179"><span class="section-number-4">2.5.2.</span> Frações</h4>
<div class="outline-text-4" id="text-2-5-2">
<p>
Números fracionários são um  tipo semi-recursivo, representados sempre
através  de   números  <i>inteiros</i>  nos  seus   respectivos  numerador  e
denominador. Podem  ser escritos  com um  <i>slash</i> entre  seus elementos,
que funciona como um separador:
</p>

<pre class="example" id="org1b50b19">
2/3
3/4
5/8
99/100
5/2
-10/3
</pre>

<p>
Estes  números correspondem  ao  conceito matemático  do conjunto  dos
números <i>racionais</i>, podendo este ser representado como
</p>

\begin{equation*}
        \mathbb{Q} = \left\{\frac{p}{q}\, \mid \, p \in \mathbb{Z}, q \in \mathbb{Z}^{*} \right\}
\end{equation*}

<p>
Esta definição sugere, portanto, que quaisquer frações expressadas com
denominador nulo constituirão erro de sintaxe.
</p>

<p>
O uso de outros subtipos  (pontos flutuantes, outras frações e números
complexos) como respectivos numeradores  e denominadores de uma fração
é sintaticamente incorreto.
</p>

<p>
As  frações  devem   sempre  ser  interpretadas  em   sua  forma  mais
simplificada  possível,   inclusive  sofrendo  coerções   para  outros
subtipos numéricos, caso seja necessário,  desde que não haja perda na
precisão da informação.
</p>

<p>
Por exemplo,  uma fração como  <code>2/4</code>, durante  o processo de  leitura, é
simplificada para <code>1/2</code>.
</p>

<p>
Igualmente, uma fração como <code>5/1</code> é diretamente convertida para o número
inteiro <code>5</code>, sendo portanto pertencente  ao subtipo numérico dos números
inteiros; isto ocorrerá  sempre que o denominador da  fração for igual
ao número <code>1</code>.
</p>

<p>
A   fração   pode  ser   precedida   pelo   sinal  <i>negativo</i>   em   seu
numerador. Caso o sinal negativo  seja expressado no denominador, este
sinal será repassado  ao numerador; caso numerado  e denominador sejam
expressados com  sinal negativo,  então ambos numerador  e denominador
tornar-se-ão positivos. Assim, <code>4/-9</code> torna-se <code>-4/9</code>, e <code>-4/-9</code> torna-se <code>4/9</code>.
</p>
</div>
</div>

<div id="outline-container-org79020de" class="outline-4">
<h4 id="org79020de"><span class="section-number-4">2.5.3.</span> Pontos flutuantes</h4>
<div class="outline-text-4" id="text-2-5-3">
<p>
Pontos flutuantes <b>emulam parcialmente</b> o conceito matemático de números
reais  (conjunto \(\mathbb{R}\)),  e são  sempre escritos  utilizando uma
notação com  <b>exatamente um  ponto</b> em algum  lugar do  número. Ademais,
também podem ser prefixados por um sinal negativo:
</p>

<pre class="example" id="org277eb89">
2.
.5
20.2
-16.3
-.9
-7.
</pre>

<p>
Os números acima  correspondem exatamente aos valores  <code>2.0</code>, <code>0.5</code>, <code>20.2</code>,
<code>-16.3</code>,  <code>-0.9</code> e  <code>-7.0</code>. Para  facilitar a  implementação, estes  números
podem ser  escritos pelo interpretador  sempre em sua  forma completa,
onde os zeros poderiam ser ignorados.
</p>
</div>
</div>
