A-especificacao.org
*** Complexos

Números  complexos   são  outro  tipo  semi-recursivo,   e  devem  ser
compreendidos  como dois  números, que  serão coeficientes  das partes
real e imaginária do número, respectivamente.

As  partes real  e imaginária  são descritas  através da  expressão de
algum dos outros subtipos (inteiro,  ponto flutuante ou fração), sendo
separadas ao meio pela letra ~j~ ou ~J~, dessa forma:

#+begin_example
0J5
3j1
2/3j.5
-2J-1
35.J-2/9
#+end_example

Matematicamente,  os números  acima podem  ser expressados  como $5i$,
$3+i$,  $\frac{2}{3}+0.5i$, $-2-i$  e $35.0-\frac{2}{9}i$,  sendo este
último número também dotado da informação de que sua parte /real/ é
composta por um /ponto flutuante/, e não por um número /inteiro/.

*** Coerções entre subtipos numéricos

Os subtipos antes mencionados pertencem  à mesma classe dos números e,
portanto, é inevitável que operações se realizem entre eles.

Todavia, essas  operações geralmente demandem que  números de subtipos
diferentes  sejam transformados  em  números do  mesmo subtipo.  Nesse
caso, o  subtipo a  prevalecer precisa  ser aquele  onde haja  a menor
perda de informação quanto for possível.

A  tabela a  seguir  apresenta comparações  entre um  Subtipo  1 e  um
Subtipo  2,  quando ambos  são  diferentes.  Para cada  comparação,  a
terceira coluna apresenta o subtipo  mais rico em informação, ou seja,
quando ambas  as variáveis forem  convertidas para este  subtipo "mais
rico", não ocorrerá perda de informação de maneira prática.

|-----------+-----------+-------------------|
| Subtipo 1 | Subtipo 2 | Subtipo mais rico |
|-----------+-----------+-------------------|
| ~integer~   | ~float~     | ~float~             |
|           | ~fraction~  | ~fraction~          |
|           | ~complex~   | ~complex~           |
|-----------+-----------+-------------------|
| ~float~     | ~integer~   | ~float~             |
|           | ~fraction~  | ~fraction~          |
|           | ~complex~   | ~complex~           |
|-----------+-----------+-------------------|
| ~fraction~  | ~integer~   | ~fraction~          |
|           | ~float~     | ~fraction~          |
|           | ~complex~   | ~complex~           |
|-----------+-----------+-------------------|
| ~complex~   | ~integer~   | ~complex~           |
|           | ~float~     | ~complex~           |
|           | ~fraction~  | ~complex~           |
|-----------+-----------+-------------------|

A  tabela pode  ser abstraída  para  uma segunda  tabela de  propósito
geral, onde  possamos estipular um  subtipo $x$ que  possa representar
qualquer subtipo não anteriormente listado.

|-----------+-----------+-------------------|
| Subtipo 1 | Subtipo 2 | Subtipo mais rico |
|-----------+-----------+-------------------|
| ~integer~   | $x$       | $x$               |
|-----------+-----------+-------------------|
| ~float~     | ~integer~   | ~float~             |
|           | ~fraction~  | ~fraction~          |
|           | $x$       | $x$               |
|-----------+-----------+-------------------|
| ~fraction~  | ~complex~   | ~complex~           |
|           | $x$       | ~fraction~          |
|-----------+-----------+-------------------|
| ~complex~   | $x$       | ~complex~           |
|-----------+-----------+-------------------|

Algumas conclusões podem ser tiradas dessa segunda tabela:

- ~integer~ é o subtipo mais fraco em termos de informação carregada;
- ~float~ é  um subtipo  mais forte  que ~integer~,  porém mais  fraco que
  ~fraction~: como  implementações de  pontos flutuantes  geralmente são
  limitadas,  estes tendem  a  serem mais  inexatos  que ~fraction~,  em
  implementações reais;
- ~fraction~ é o subtipo mais forte depois de ~complex~;
- ~complex~ é o subtipo mais forte de todos os anteriores.

Todavia, o caso de ~complex~ merece  uma melhor análise, já que trata-se
de um  subtipo que depende  de outros  subtipos diferentes de  si. Por
isso, quando  ~complex~ possui  parte imaginária  /nula/, ele  torna-se um
número *com o mesmo subtipo de sua parte real*.

Com relação  ao subtipo ~fraction~,  é trivial imaginar que  frações com
denominador   ~1~   possam    ser   automaticamente   transformadas   em
~integer~.  Todavia,  por  facilidade  de  manipulação,  ~fraction~'s  não
precisam  ser transformados  em  em  ~integer~'s automaticamente.  Sendo
assim, ~2/1~ e ~2~ serão dois  números de Majestic Lisp com representações
e subtipos diferentes, mas que representam o mesmo valor.

**** *Da nulidade numérica.*
:PROPERTIES:
:UNNUMBERED: t
:END:

Devido à natureza das informações contidas em ~complex~, por ser um tipo
primariamente recursivo,  sua conversão para  um valor /real/  (quando o
valor /imaginário/ é nulo) envolve um  teste de nulidade com a sua parte
imaginária.

Tal  teste é  efetuado  utilizando-se a  função  ~zerop~. Todavia,  como
comparações  envolvendo  igualdade em  números  de  subtipo ~float~  nem
sempre  resultam  em  uma  comparação  correta,  Majestic  Lisp  torna
impossível  saber  da  nulidade  de  um  número  ~float~  através  dessa
função[fn:2].  Assim, um número ~complex~ cuja parte imaginária seja
igual a  ~0.0~, por  exemplo, não  será transformado  no subtipo  de sua
parte real.

**** *Das coerções em divisões inteiras.*
:PROPERTIES:
:UNNUMBERED: t
:END:

Nos  casos de  algumas  operações elementares,  é pertinente  garantir
certos subtipos  numéricos específicos  no retorno de  operações. 

Para uma  *operação de divisão*  entre dois números de  subtipo ~integer~,
retorna-se um número de subtipo  ~fraction~ quando o divisor não
for divisível pelo  dividendo.  Essa decisão deriva da ideia  de que é
necessário minimizar a perda de informação em uma operação.

** Dados atômicos e objetos

Quaisquer  tipos de  dados que  não  sejam células  /cons/ são  chamados
/átomos/. Portanto, /símbolos/, /caracteres/, /streams/ e /números/ são /átomos/.

Instâncias dos cinco tipos fundamentais são chamadas /objetos/.

