A-especificacao.html

<div id="outline-container-org0d094f6" class="outline-4">
<h4 id="org0d094f6"><span class="section-number-4">2.5.4.</span> Complexos</h4>
<div class="outline-text-4" id="text-2-5-4">
<p>
Números  complexos   são  outro  tipo  semi-recursivo,   e  devem  ser
compreendidos  como dois  números, que  serão coeficientes  das partes
real e imaginária do número, respectivamente.
</p>

<p>
As  partes real  e imaginária  são descritas  através da  expressão de
algum dos outros subtipos (inteiro,  ponto flutuante ou fração), sendo
separadas ao meio pela letra <code>j</code> ou <code>J</code>, dessa forma:
</p>

<pre class="example" id="orgfc6bdf7">
0J5
3j1
2/3j.5
-2J-1
35.J-2/9
</pre>

<p>
Matematicamente,  os números  acima podem  ser expressados  como \(5i\),
\(3+i\),  \(\frac{2}{3}+0.5i\), \(-2-i\)  e \(35.0-\frac{2}{9}i\),  sendo este
último número também dotado da informação de que sua parte <i>real</i> é
composta por um <i>ponto flutuante</i>, e não por um número <i>inteiro</i>.
</p>
</div>
</div>

<div id="outline-container-org2cd2e1d" class="outline-4">
<h4 id="org2cd2e1d"><span class="section-number-4">2.5.5.</span> Coerções entre subtipos numéricos</h4>
<div class="outline-text-4" id="text-2-5-5">
<p>
Os subtipos antes mencionados pertencem  à mesma classe dos números e,
portanto, é inevitável que operações se realizem entre eles.
</p>

<p>
Todavia, essas  operações geralmente demandem que  números de subtipos
diferentes  sejam transformados  em  números do  mesmo subtipo.  Nesse
caso, o  subtipo a  prevalecer precisa  ser aquele  onde haja  a menor
perda de informação quanto for possível.
</p>

<p>
A  tabela a  seguir  apresenta comparações  entre um  Subtipo  1 e  um
Subtipo  2,  quando ambos  são  diferentes.  Para cada  comparação,  a
terceira coluna apresenta o subtipo  mais rico em informação, ou seja,
quando ambas  as variáveis forem  convertidas para este  subtipo "mais
rico", não ocorrerá perda de informação de maneira prática.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Subtipo 1</th>
<th scope="col" class="org-left">Subtipo 2</th>
<th scope="col" class="org-left">Subtipo mais rico</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>integer</code></td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>float</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>fraction</code></td>
<td class="org-left"><code>fraction</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>complex</code></td>
<td class="org-left"><code>complex</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>integer</code></td>
<td class="org-left"><code>float</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>fraction</code></td>
<td class="org-left"><code>fraction</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>complex</code></td>
<td class="org-left"><code>complex</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>fraction</code></td>
<td class="org-left"><code>integer</code></td>
<td class="org-left"><code>fraction</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>fraction</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>complex</code></td>
<td class="org-left"><code>complex</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>complex</code></td>
<td class="org-left"><code>integer</code></td>
<td class="org-left"><code>complex</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>complex</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>fraction</code></td>
<td class="org-left"><code>complex</code></td>
</tr>
</tbody>
</table>

<p>
A  tabela pode  ser abstraída  para  uma segunda  tabela de  propósito
geral, onde  possamos estipular um  subtipo \(x\) que  possa representar
qualquer subtipo não anteriormente listado.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Subtipo 1</th>
<th scope="col" class="org-left">Subtipo 2</th>
<th scope="col" class="org-left">Subtipo mais rico</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>integer</code></td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>float</code></td>
<td class="org-left"><code>integer</code></td>
<td class="org-left"><code>float</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>fraction</code></td>
<td class="org-left"><code>fraction</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(x\)</td>
<td class="org-left">\(x\)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>fraction</code></td>
<td class="org-left"><code>complex</code></td>
<td class="org-left"><code>complex</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">\(x\)</td>
<td class="org-left"><code>fraction</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>complex</code></td>
<td class="org-left">\(x\)</td>
<td class="org-left"><code>complex</code></td>
</tr>
</tbody>
</table>

<p>
Algumas conclusões podem ser tiradas dessa segunda tabela:
</p>

<ul class="org-ul">
<li><code>integer</code> é o subtipo mais fraco em termos de informação carregada;</li>
<li><code>float</code> é  um subtipo  mais forte  que <code>integer</code>,  porém mais  fraco que
<code>fraction</code>: como  implementações de  pontos flutuantes  geralmente são
limitadas,  estes tendem  a  serem mais  inexatos  que <code>fraction</code>,  em
implementações reais;</li>
<li><code>fraction</code> é o subtipo mais forte depois de <code>complex</code>;</li>
<li><code>complex</code> é o subtipo mais forte de todos os anteriores.</li>
</ul>

<p>
Todavia, o caso de <code>complex</code> merece  uma melhor análise, já que trata-se
de um  subtipo que depende  de outros  subtipos diferentes de  si. Por
isso, quando  <code>complex</code> possui  parte imaginária  <i>nula</i>, ele  torna-se um
número <b>com o mesmo subtipo de sua parte real</b>.
</p>

<p>
Com relação  ao subtipo <code>fraction</code>,  é trivial imaginar que  frações com
denominador   <code>1</code>   possam    ser   automaticamente   transformadas   em
<code>integer</code>.  Todavia,  por  facilidade  de  manipulação,  <code>fraction</code>'s  não
precisam  ser transformados  em  em  <code>integer</code>'s automaticamente.  Sendo
assim, <code>2/1</code> e <code>2</code> serão dois  números de Majestic Lisp com representações
e subtipos diferentes, mas que representam o mesmo valor.
</p>
</div>

<ul class="org-ul">
<li><a id="orgb49db30"></a><b>Da nulidade numérica.</b><br />
<div class="outline-text-5" id="text-orgb49db30">
<p>
Devido à natureza das informações contidas em <code>complex</code>, por ser um tipo
primariamente recursivo,  sua conversão para  um valor <i>real</i>  (quando o
valor <i>imaginário</i> é nulo) envolve um  teste de nulidade com a sua parte
imaginária.
</p>

<p>
Tal  teste é  efetuado  utilizando-se a  função  <code>zerop</code>. Todavia,  como
comparações  envolvendo  igualdade em  números  de  subtipo <code>float</code>  nem
sempre  resultam  em  uma  comparação  correta,  Majestic  Lisp  torna
impossível  saber  da  nulidade  de  um  número  <code>float</code>  através  dessa
função<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>.  Assim, um número <code>complex</code> cuja parte imaginária seja
igual a  <code>0.0</code>, por  exemplo, não  será transformado  no subtipo  de sua
parte real.
</p>
</div>
</li>

<li><a id="org186c771"></a><b>Das coerções em divisões inteiras.</b><br />
<div class="outline-text-5" id="text-org186c771">
<p>
Nos  casos de  algumas  operações elementares,  é pertinente  garantir
certos subtipos  numéricos específicos  no retorno de  operações. 
</p>

<p>
Para uma  <b>operação de divisão</b>  entre dois números de  subtipo <code>integer</code>,
retorna-se um número de subtipo  <code>fraction</code> quando o divisor não
for divisível pelo  dividendo.  Essa decisão deriva da ideia  de que é
necessário minimizar a perda de informação em uma operação.
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7292e14" class="outline-3">
<h3 id="org7292e14"><span class="section-number-3">2.6.</span> Dados atômicos e objetos</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Quaisquer  tipos de  dados que  não  sejam células  <i>cons</i> são  chamados
<i>átomos</i>. Portanto, <i>símbolos</i>, <i>caracteres</i>, <i>streams</i> e <i>números</i> são <i>átomos</i>.
</p>

<p>
Instâncias dos cinco tipos fundamentais são chamadas <i>objetos</i>.
</p>
</div>
</div>
</div>
