A-especificacao.org
* Listas

Listas são associações de objetos  em coleções, sendo portanto um /meio
de combinação/ de objetos em  Majestic Lisp, sendo estes objetos outras
listas ou não.

Podemos  utilizar   células  /cons/  para  construir   vários  tipos  de
estruturas  de  dados diferentes,  mas  a  forma mais  fundamental  de
utilizá-las  é para  a construição  de listas.

** TODO Listas pontuadas

** Listas adequadas

Para que  possamos representar listas adequadas,  seguimos duas regras
básicas:

1. O símbolo ~nil~ representa a lista vazia.
2. Se  ~y~ é uma lista,  então o /cons/  ~(x . y)~  é uma lista de  ~x~ seguida
   dos elementos de ~y~.

Eis uma lista feita com um único par:

#+begin_example
(a . nil)
#+end_example

De acordo com a regra 2, esta é uma lista de um símbolo ~a~, seguida dos
elementos  de  ~nil~   que,  de  acordo  com  a  regra   1,  não  possui
elementos. Portanto,  trata-se de  uma lista de  um único  elemento, o
símbolo ~a~.

Através  do aninhamento  de /cons/,  podemos criar  listas de  quaisquer
tamanhos. Eis uma lista cujos elementos sejam os símbolos ~a~ e ~b~:

#+begin_example
(a . (b . nil))
#+end_example

A seguinte lista possui, como elementos, ~a~, ~b~ e ~c~:

#+begin_example
(a . (b . (c . nil)))
#+end_example

** Notação abreviada de listas

Como esta forma de expressar uma  lista é muito pouco prática, podemos
instituir uma notação abreviada que seja mais conveniente:

1. O símbolo ~nil~ pode ser representado como ~()~.
2. Quando o ~cdr~ de um /cons/ for uma /lista/, pode-se omitir o ponto antes
   do mesmo,  e também os parênteses  que o delimitam. Assim,  ~(a . (b
   ...))~ pode ser escrito como ~(a b ...)~.

Através  da  aplicação  repetida  dessas duas  novas  regras,  podemos
transformar

#+begin_example
(a . (b . (c . nil)))
#+end_example

em

#+begin_example
(a b c)
#+end_example

Em outras palavras, uma lista pode ser expressada através da colocação
de seus elementos entre parênteses. Assim, não há motivo para utilizar
a notação com pontos para uma lista como  ~(a b c)~, a não ser que fosse
estritamente necessário, por uma razão especial.

Como  qualquer objeto  pode  ser  uma parte  de  um  /cons/, então  seus
elementos  também podem  ser listas.  Todos os  exemplos a  seguir são
listas válidas:

#+begin_example
(a (b) c)
((a b c))
(nil)
#+end_example

/Cons/ como estes, onde pode-se iterar através do ~cdr~ de seus elementos,
e   eventualmente  encontra-se   sempre  ~nil~,   são  chamadas   /listas
adequadas/. Esta é uma /lista adequada/:

#+begin_example
(a b c)
#+end_example

Esta lista, todavia, não é:

#+begin_example
(a b . c)
#+end_example

A lista vazia também é uma lista adequada.

Um /cons/ que não seja classificado  como uma /lista adequada/ é chamado
/lista  pontuada/,  porque  é  necessária   a  notação  de  pontos  para
representá-la.

** TODO Listas associativas
* TODO Vetores

Vetores são estruturas de dados  mutáveis, com tamanho variável, cujos
elementos sejam de  um mesmo tipo, segundo  certas regras particulares
que garantem um tipo único para o vetor em determinadas situações.

Diferentemente das listas, vetores são meios de combinação que não são
compostos de /cons cells/; ao invés  disso, os elementos de um vetor são
armazenados  de forma  sequencial na  memória, não  sendo encapsulados
pelas estruturas de pares.

** Notação de vetores

Vetores  são representados  sintaticamente entre  colchetes, de  forma
muito similar às listas. De  forma geral, temos como regras sintáticas
que:

1. Os colchetes (~[~ e ~]~) delimitam os elementos de um vetor.
2. Elementos individuais são separados por espaço em branco.

Um vetor vazio pode ser representado como:

#+begin_example
[]
#+end_example

Valores  em   um  vetor  podem  ser   representados  igualmente  entre
colchetes, com espaço vazio entre seus elementos:

#+begin_example
[1 2 3 4 5]
#+end_example

** Tipo de um vetor

Vetores seguem uma uniformidade entre  seus elementos tanto quanto for
possível. Em outras palavras, vetores possuem um tipo único entre seus
elementos, ainda  que este tipo  seja uma representação  genérica para
muitos tipos.

O tipo de um vetor é deduzido a partir dos elementos fornecidos na sua
criação  ou, caso  não seja  possível deduzir  seu tipo,  admite-se um
vetor de qualquer tipo de objeto, o que implica em uma indireção extra
em seus elementos.

Há quatro tipos diferentes de vetores:

*** Vetor de números inteiros

Este vetor  é composto  unicamente de números  com o  subtipo numérico
~integer~.

#+begin_example
[1 2 3 4 5]
#+end_example

*** Vetor de pontos flutuantes

Este vetor  é composto  unicamente de números  com o  subtipo numérico
~float~.

#+begin_example
[1.5 2.4 3.35 4.2 5.1]
#+end_example

*** Vetor de caracteres

Este vetor possui certas particularidades  que serão discutidas mais à
frente. Independente  disso, é  composto unicamente  de objetos  com o
tipo ~char~.

#+begin_example
[#\H #\e #\l #\l #\o]
#+end_example

Para este tipo de vetor, podemos adicionar uma nova regra sintática:

Um vetor de objetos do  tipo ~char~ pode ser sintaticamente representado
através da substituição dos colchetes por aspas duplas (~"~), seguido de
remoção  dos espaços  em branco  entre  os ítens,  e cada  um de  seus
elementos serão  representados como  caracteres em sua  versão textual
simples, sem o sufixo ~#\~.

O vetor anterior de caracteres pode, portanto, ser representado como:

#+begin_example
"Hello"
#+end_example

