A-especificacao.html

<div id="outline-container-org28b0d79" class="outline-2">
<h2 id="org28b0d79"><span class="section-number-2">3.</span> Listas</h2>
<div class="outline-text-2" id="text-3">
<p>
Listas são associações de objetos  em coleções, sendo portanto um <i>meio
de combinação</i> de objetos em  Majestic Lisp, sendo estes objetos outras
listas ou não.
</p>

<p>
Podemos  utilizar   células  <i>cons</i>  para  construir   vários  tipos  de
estruturas  de  dados diferentes,  mas  a  forma mais  fundamental  de
utilizá-las  é para  a construição  de listas.
</p>
</div>

<div id="outline-container-org423d3a0" class="outline-3">
<h3 id="org423d3a0"><span class="section-number-3">3.1.</span> <span class="todo TODO">TODO</span> Listas pontuadas</h3>
</div>

<div id="outline-container-orge1c225a" class="outline-3">
<h3 id="orge1c225a"><span class="section-number-3">3.2.</span> Listas adequadas</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Para que  possamos representar listas adequadas,  seguimos duas regras
básicas:
</p>

<ol class="org-ol">
<li>O símbolo <code>nil</code> representa a lista vazia.</li>
<li>Se  <code>y</code> é uma lista,  então o <i>cons</i>  <code>(x . y)</code>  é uma lista de  <code>x</code> seguida
dos elementos de <code>y</code>.</li>
</ol>

<p>
Eis uma lista feita com um único par:
</p>

<pre class="example" id="org1355afe">
(a . nil)
</pre>

<p>
De acordo com a regra 2, esta é uma lista de um símbolo <code>a</code>, seguida dos
elementos  de  <code>nil</code>   que,  de  acordo  com  a  regra   1,  não  possui
elementos. Portanto,  trata-se de  uma lista de  um único  elemento, o
símbolo <code>a</code>.
</p>

<p>
Através  do aninhamento  de <i>cons</i>,  podemos criar  listas de  quaisquer
tamanhos. Eis uma lista cujos elementos sejam os símbolos <code>a</code> e <code>b</code>:
</p>

<pre class="example" id="orged2261c">
(a . (b . nil))
</pre>

<p>
A seguinte lista possui, como elementos, <code>a</code>, <code>b</code> e <code>c</code>:
</p>

<pre class="example" id="org1869f1f">
(a . (b . (c . nil)))
</pre>
</div>
</div>

<div id="outline-container-org82eb180" class="outline-3">
<h3 id="org82eb180"><span class="section-number-3">3.3.</span> Notação abreviada de listas</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Como esta forma de expressar uma  lista é muito pouco prática, podemos
instituir uma notação abreviada que seja mais conveniente:
</p>

<ol class="org-ol">
<li>O símbolo <code>nil</code> pode ser representado como <code>()</code>.</li>
<li>Quando o <code>cdr</code> de um <i>cons</i> for uma <i>lista</i>, pode-se omitir o ponto antes
do mesmo,  e também os parênteses  que o delimitam. Assim,  <code>(a . (b
   ...))</code> pode ser escrito como <code>(a b ...)</code>.</li>
</ol>

<p>
Através  da  aplicação  repetida  dessas duas  novas  regras,  podemos
transformar
</p>

<pre class="example" id="orge433f3e">
(a . (b . (c . nil)))
</pre>

<p>
em
</p>

<pre class="example" id="orga941772">
(a b c)
</pre>

<p>
Em outras palavras, uma lista pode ser expressada através da colocação
de seus elementos entre parênteses. Assim, não há motivo para utilizar
a notação com pontos para uma lista como  <code>(a b c)</code>, a não ser que fosse
estritamente necessário, por uma razão especial.
</p>

<p>
Como  qualquer objeto  pode  ser  uma parte  de  um  <i>cons</i>, então  seus
elementos  também podem  ser listas.  Todos os  exemplos a  seguir são
listas válidas:
</p>

<pre class="example" id="orgf18971e">
(a (b) c)
((a b c))
(nil)
</pre>

<p>
<i>Cons</i> como estes, onde pode-se iterar através do <code>cdr</code> de seus elementos,
e   eventualmente  encontra-se   sempre  <code>nil</code>,   são  chamadas   <i>listas
adequadas</i>. Esta é uma <i>lista adequada</i>:
</p>

<pre class="example" id="org8089c50">
(a b c)
</pre>

<p>
Esta lista, todavia, não é:
</p>

<pre class="example" id="org6f2f7b0">
(a b . c)
</pre>

<p>
A lista vazia também é uma lista adequada.
</p>

<p>
Um <i>cons</i> que não seja classificado  como uma <i>lista adequada</i> é chamado
<i>lista  pontuada</i>,  porque  é  necessária   a  notação  de  pontos  para
representá-la.
</p>
</div>
</div>

<div id="outline-container-org7e7cb8e" class="outline-3">
<h3 id="org7e7cb8e"><span class="section-number-3">3.4.</span> <span class="todo TODO">TODO</span> Listas associativas</h3>
</div>
</div>
<div id="outline-container-org46afd29" class="outline-2">
<h2 id="org46afd29"><span class="section-number-2">4.</span> <span class="todo TODO">TODO</span> Vetores</h2>
<div class="outline-text-2" id="text-4">
<p>
Vetores são estruturas de dados  mutáveis, com tamanho variável, cujos
elementos sejam de  um mesmo tipo, segundo  certas regras particulares
que garantem um tipo único para o vetor em determinadas situações.
</p>

<p>
Diferentemente das listas, vetores são meios de combinação que não são
compostos de <i>cons cells</i>; ao invés  disso, os elementos de um vetor são
armazenados  de forma  sequencial na  memória, não  sendo encapsulados
pelas estruturas de pares.
</p>
</div>

<div id="outline-container-org12c929e" class="outline-3">
<h3 id="org12c929e"><span class="section-number-3">4.1.</span> Notação de vetores</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Vetores  são representados  sintaticamente entre  colchetes, de  forma
muito similar às listas. De  forma geral, temos como regras sintáticas
que:
</p>

<ol class="org-ol">
<li>Os colchetes (<code>[</code> e <code>]</code>) delimitam os elementos de um vetor.</li>
<li>Elementos individuais são separados por espaço em branco.</li>
</ol>

<p>
Um vetor vazio pode ser representado como:
</p>

<pre class="example" id="org53b8678">
[]
</pre>

<p>
Valores  em   um  vetor  podem  ser   representados  igualmente  entre
colchetes, com espaço vazio entre seus elementos:
</p>

<pre class="example" id="orgc2e63d2">
[1 2 3 4 5]
</pre>
</div>
</div>

<div id="outline-container-orgc6f2300" class="outline-3">
<h3 id="orgc6f2300"><span class="section-number-3">4.2.</span> Tipo de um vetor</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Vetores seguem uma uniformidade entre  seus elementos tanto quanto for
possível. Em outras palavras, vetores possuem um tipo único entre seus
elementos, ainda  que este tipo  seja uma representação  genérica para
muitos tipos.
</p>

<p>
O tipo de um vetor é deduzido a partir dos elementos fornecidos na sua
criação  ou, caso  não seja  possível deduzir  seu tipo,  admite-se um
vetor de qualquer tipo de objeto, o que implica em uma indireção extra
em seus elementos.
</p>

<p>
Há quatro tipos diferentes de vetores:
</p>
</div>

<div id="outline-container-orgbcf942a" class="outline-4">
<h4 id="orgbcf942a"><span class="section-number-4">4.2.1.</span> Vetor de números inteiros</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Este vetor  é composto  unicamente de números  com o  subtipo numérico
<code>integer</code>.
</p>

<pre class="example" id="orgc1e7dfc">
[1 2 3 4 5]
</pre>
</div>
</div>

<div id="outline-container-orge663bdf" class="outline-4">
<h4 id="orge663bdf"><span class="section-number-4">4.2.2.</span> Vetor de pontos flutuantes</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Este vetor  é composto  unicamente de números  com o  subtipo numérico
<code>float</code>.
</p>

<pre class="example" id="orgf705d9d">
[1.5 2.4 3.35 4.2 5.1]
</pre>
</div>
</div>

<div id="outline-container-org34b8a18" class="outline-4">
<h4 id="org34b8a18"><span class="section-number-4">4.2.3.</span> Vetor de caracteres</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Este vetor possui certas particularidades  que serão discutidas mais à
frente. Independente  disso, é  composto unicamente  de objetos  com o
tipo <code>char</code>.
</p>

<pre class="example" id="org13879ee">
[#\H #\e #\l #\l #\o]
</pre>

<p>
Para este tipo de vetor, podemos adicionar uma nova regra sintática:
</p>

<p>
Um vetor de objetos do  tipo <code>char</code> pode ser sintaticamente representado
através da substituição dos colchetes por aspas duplas (<code>"</code>), seguido de
remoção  dos espaços  em branco  entre  os ítens,  e cada  um de  seus
elementos serão  representados como  caracteres em sua  versão textual
simples, sem o sufixo <code>#\</code>.
</p>

<p>
O vetor anterior de caracteres pode, portanto, ser representado como:
</p>

<pre class="example" id="org7c71435">
"Hello"
</pre>
</div>
</div>
