A-especificacao.org
*** Vetor de qualquer tipo (Any)

Este vetor pode possuir qualquer objeto como elemento.

Este é  o tipo inerente a  qualquer vetor que não  possua uniformidade
nos  tipos   de  seus  componentes,   ou  cujo  tipo  não   possa  ser
sintaticamente deduzido.

Vetores de qualquer  tipo (ou de tipo ~any~) possuem  quaisquer tipos de
elementos. Isso inclui  outros vetores, e pode  incluir também vetores
sintaticamente idênticos aos exemplos anteriores.

Os exemplos a seguir representam vetores que tenham, indubitavelmente,
o tipo ~any~.

#+begin_example
[]
[1 2/3 2j5 6 '(a b c)]
[[] [] []]
#+end_example

Outros vetores podem, por meio  de transformações sucessivas durante a
execução  de  um  programa   (por  exemplo,  inserções  sucessivas  de
elementos em  um vetor vazio), serem  vetores de tipo ~any~  que lembram
sintaticamente vetores de tipos específicos.

Por  exemplo,  considere o  vetor  criado  sintaticamente na  forma  a
seguir.

#+begin_example
[]
#+end_example

Este vetor é do tipo ~any~,  porque não podemos deduzir sintaticamente o
tipo mais apropriado para um vetor temporariamente vazio.

Suponhamos, portanto, que  dois elementos de tipo  ~char~ sejam inserido
nesse vetor: as letras ~'H'~ e ~'e'~.

#+begin_example
[#\H #\e]
#+end_example

A regra sintática que garante uma notação entre aspas *não se aplica* no
vetor acima, posto que o tipo de seus elementos não é ~char~, e sim ~any~,
algo determinado no momento de sua criação.

Para que possamos usufruir das idiossincrasias inerentes a um vetor de
~char~, será necessário realizar uma  conversão explícita de um vetor de
~any~ para  um vetor de ~char~.  Isso poderá ser realizado  através de uma
das funções primitivas da linguagem.

** TODO Coerção entre tipos de vetores

** Strings

Strings são  informação textual,  podendo ser compreendida  como algum
tipo de sequência de um número variável de caracteres.

Em  Majestic Lisp,  strings são  vetores  de caracteres  -- em  outras
palavras, vetores de tipo ~char~.

Portanto, um vetor construído pela forma

#+begin_example
(vector #\a #\b #\c)
#+end_example

é uma string válida, podendo  também ser expressado da seguinte forma,
pela notação abreviada de vetores:

#+begin_example
[#\a #\b #\c]
#+end_example

*** Notação abreviada de strings

Mesmo com a notação abreviada de vetores, expressar uma string como um
vetor de  caracteres pode ser  muito pouco prático.  Podemos estipular
algumas regras que tornam a legibilidade de uma string ainda melhor:

1. Pode-se  substituir os colchetes (~[~  e ~]~) por aspas  duplas (~"~), em
   ambos os casos;
2. Caso  isso seja feito,  remova os espaços  entre os caracteres  e o
   prefixo ~#\~ dos mesmos.

Dessa  forma, a  string do  exemplo  anterior poderia  ser escrita  da
seguinte forma:

#+begin_example
"abc"
#+end_example

* Valores-verdade

O  símbolo  ~nil~ representa  falsidade,  além  de representar  a  lista
fazia. O símbolo  ~t~ é a representação padrão de  verdade, mas qualquer
objeto que não seja ~nil~ também contará como verdadeiro.

Poderá parecer estranho usar o  mesmo valor para representar falsidade
e a  lista vazia, mas na  prática, isso funciona bem.  Funções de Lisp
costumeiramente retornam  conjuntos de respostas, e  um conjunto vazio
de respostas é tratado uma falsidade.

* Funções

A  maior parte  dos programas  de  Majestic Lisp  são constituídos  de
funções. Funções  tomam zero ou  mais objetos como  argumentos, talvez
façam  alguma coisa  (por exemplo,  mostrar uma  mensagem na  tela), e
então retornam um objeto.

Funções podem ser classificadas  como /funções primitivas/ ou /clausuras/,
dependendo da forma como são  geradas. Uma função primitiva geralmente
é inerente  à implementação  de Majestic Lisp,  e uma  clausura estará
relacionada a algo que pode ser definido através da própria linguagem,
ou pelo programador.

** Representação de clausuras

Clausuras são representadas  usando listas. Por exemplo,  a clausura a
seguir toma um único argumento, e retorna a soma entre o mesmo e ~1~.

#+begin_example
(lit closure <lexenv> (x) (+ x 1))
#+end_example

O  primeiro  elemento, ~lit~,  especifica  que  estamos tratando  de  um
/objeto literal/, que não será interpretado.

O  segundo,  ~closure~,  especifica  o   tipo  do  objeto  literal:  uma
/clausura/.

O  terceiro elemento  é o  contexto  léxico, uma  associação local  de
símbolos  aos  quais  valores  estejam atrelados.   Se  o  exemplo  de
clausura  tive sido  declarado no  /top-level/, o  contexto léxico  será
vazio.

O quarto  elemento, ~(x)~, é  uma /lambda list/, podendo  ser compreendida
como os parâmetros da função. Quando a  função é chamada, o valor de ~x~
será aquele valor com o qual a função é chamada.

O quinto e último elemento, ~(+ x 1)~, é o /corpo/ da clausura, e define o
valor retornado pela mesma.

** Representação alternativa de clausuras

Normalmente,  não expressamos  uma clausura  usando sua  representação
literal. É suficiente que utilizemos a notação

#+begin_example
(fn (x) (+ x 1))
#+end_example

que gerará a clausura explicitada anteriormente.

Esta sintaxe determina,  a princípio, uma forma especial,  uma vez que
realiza captura de escopo e produz uma literal.

* Macros

Uma funcionalidade muito recorrente em dialetos de Lisp é a construção
de /macros/: elementos  que auxiliam o programador  a reescrever sintaxe
no  programa. Através  do uso  de  /macros/, pode-se  criar formas  mais
sucintas  ou mais  intuitivas  para  determinados problemas,  enquanto
ainda não se foge do uso da sintaxe da linguagem.

** Representação

Macros são  clausuras executadas  sobre uma expressão  qualquer, antes
que a mesma seja interpretada. Nesse  sentido, o /macro/ nada mais é que
uma função que opera sobre dados comuns.

Um /macro/ é  representado como um /literal/ de três  elementos, tal que o
terceiro elemento  seja uma  clausura propriamente dita,  como pode-se
ver a seguir:

#+begin_example
(lit macro (lit closure <lexenv> (f x) (list f x)))
#+end_example

O  primeiro elemento,  ~lit~, deixa  claro  que estamos  tratando de  um
literal,  que  consequentemente  não  deverá  ter  seus  sub-elementos
interpretados. Já o segundo elemento, ~macro~, clarifica que tal literal
constitui um /macro/.

O  terceiro elemento  é  uma  /clausura/ comum,  que  será aplicada  aos
argumentos do /macro/. Esta clausura captura o contexto onde o macro foi
definido, e seu  retorno será considerado uma expressão  que, de forma
subsequente à aplicação comum do macro, será interpretada.

À aplicação  da clausura associada  aos dados preprocessados,  damos o
nome de /expansão/ do /macro/.

