A-especificacao.html

<div id="outline-container-org1cf6abd" class="outline-4">
<h4 id="org1cf6abd"><span class="section-number-4">4.2.4.</span> Vetor de qualquer tipo (Any)</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Este vetor pode possuir qualquer objeto como elemento.
</p>

<p>
Este é  o tipo inerente a  qualquer vetor que não  possua uniformidade
nos  tipos   de  seus  componentes,   ou  cujo  tipo  não   possa  ser
sintaticamente deduzido.
</p>

<p>
Vetores de qualquer  tipo (ou de tipo <code>any</code>) possuem  quaisquer tipos de
elementos. Isso inclui  outros vetores, e pode  incluir também vetores
sintaticamente idênticos aos exemplos anteriores.
</p>

<p>
Os exemplos a seguir representam vetores que tenham, indubitavelmente,
o tipo <code>any</code>.
</p>

<pre class="example" id="orgd7206f1">
[]
[1 2/3 2j5 6 '(a b c)]
[[] [] []]
</pre>

<p>
Outros vetores podem, por meio  de transformações sucessivas durante a
execução  de  um  programa   (por  exemplo,  inserções  sucessivas  de
elementos em  um vetor vazio), serem  vetores de tipo <code>any</code>  que lembram
sintaticamente vetores de tipos específicos.
</p>

<p>
Por  exemplo,  considere o  vetor  criado  sintaticamente na  forma  a
seguir.
</p>

<pre class="example" id="orgac80e07">
[]
</pre>

<p>
Este vetor é do tipo <code>any</code>,  porque não podemos deduzir sintaticamente o
tipo mais apropriado para um vetor temporariamente vazio.
</p>

<p>
Suponhamos, portanto, que  dois elementos de tipo  <code>char</code> sejam inserido
nesse vetor: as letras <code>'H'</code> e <code>'e'</code>.
</p>

<pre class="example" id="org6e21445">
[#\H #\e]
</pre>

<p>
A regra sintática que garante uma notação entre aspas <b>não se aplica</b> no
vetor acima, posto que o tipo de seus elementos não é <code>char</code>, e sim <code>any</code>,
algo determinado no momento de sua criação.
</p>

<p>
Para que possamos usufruir das idiossincrasias inerentes a um vetor de
<code>char</code>, será necessário realizar uma  conversão explícita de um vetor de
<code>any</code> para  um vetor de <code>char</code>.  Isso poderá ser realizado  através de uma
das funções primitivas da linguagem.
</p>
</div>
</div>
</div>

<div id="outline-container-orgcaf69e7" class="outline-3">
<h3 id="orgcaf69e7"><span class="section-number-3">4.3.</span> <span class="todo TODO">TODO</span> Coerção entre tipos de vetores</h3>
</div>

<div id="outline-container-org41b05fe" class="outline-3">
<h3 id="org41b05fe"><span class="section-number-3">4.4.</span> Strings</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Strings são  informação textual,  podendo ser compreendida  como algum
tipo de sequência de um número variável de caracteres.
</p>

<p>
Em  Majestic Lisp,  strings são  vetores  de caracteres  &#x2013; em  outras
palavras, vetores de tipo <code>char</code>.
</p>

<p>
Portanto, um vetor construído pela forma
</p>

<pre class="example" id="org537c83b">
(vector #\a #\b #\c)
</pre>

<p>
é uma string válida, podendo  também ser expressado da seguinte forma,
pela notação abreviada de vetores:
</p>

<pre class="example" id="orgb7bf05c">
[#\a #\b #\c]
</pre>
</div>

<div id="outline-container-org8e99eb3" class="outline-4">
<h4 id="org8e99eb3"><span class="section-number-4">4.4.1.</span> Notação abreviada de strings</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Mesmo com a notação abreviada de vetores, expressar uma string como um
vetor de  caracteres pode ser  muito pouco prático.  Podemos estipular
algumas regras que tornam a legibilidade de uma string ainda melhor:
</p>

<ol class="org-ol">
<li>Pode-se  substituir os colchetes (<code>[</code>  e <code>]</code>) por aspas  duplas (<code>"</code>), em
ambos os casos;</li>
<li>Caso  isso seja feito,  remova os espaços  entre os caracteres  e o
prefixo <code>#\</code> dos mesmos.</li>
</ol>

<p>
Dessa  forma, a  string do  exemplo  anterior poderia  ser escrita  da
seguinte forma:
</p>

<pre class="example" id="orge88708f">
"abc"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2a7cf6c" class="outline-2">
<h2 id="org2a7cf6c"><span class="section-number-2">5.</span> Valores-verdade</h2>
<div class="outline-text-2" id="text-5">
<p>
O  símbolo  <code>nil</code> representa  falsidade,  além  de representar  a  lista
fazia. O símbolo  <code>t</code> é a representação padrão de  verdade, mas qualquer
objeto que não seja <code>nil</code> também contará como verdadeiro.
</p>

<p>
Poderá parecer estranho usar o  mesmo valor para representar falsidade
e a  lista vazia, mas na  prática, isso funciona bem.  Funções de Lisp
costumeiramente retornam  conjuntos de respostas, e  um conjunto vazio
de respostas é tratado uma falsidade.
</p>
</div>
</div>

<div id="outline-container-org6e8d6e0" class="outline-2">
<h2 id="org6e8d6e0"><span class="section-number-2">6.</span> Funções</h2>
<div class="outline-text-2" id="text-6">
<p>
A  maior parte  dos programas  de  Majestic Lisp  são constituídos  de
funções. Funções  tomam zero ou  mais objetos como  argumentos, talvez
façam  alguma coisa  (por exemplo,  mostrar uma  mensagem na  tela), e
então retornam um objeto.
</p>

<p>
Funções podem ser classificadas  como <i>funções primitivas</i> ou <i>clausuras</i>,
dependendo da forma como são  geradas. Uma função primitiva geralmente
é inerente  à implementação  de Majestic Lisp,  e uma  clausura estará
relacionada a algo que pode ser definido através da própria linguagem,
ou pelo programador.
</p>
</div>

<div id="outline-container-org2b67136" class="outline-3">
<h3 id="org2b67136"><span class="section-number-3">6.1.</span> Representação de clausuras</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Clausuras são representadas  usando listas. Por exemplo,  a clausura a
seguir toma um único argumento, e retorna a soma entre o mesmo e <code>1</code>.
</p>

<pre class="example" id="org2b83e66">
(lit closure &lt;lexenv&gt; (x) (+ x 1))
</pre>

<p>
O  primeiro  elemento, <code>lit</code>,  especifica  que  estamos tratando  de  um
<i>objeto literal</i>, que não será interpretado.
</p>

<p>
O  segundo,  <code>closure</code>,  especifica  o   tipo  do  objeto  literal:  uma
<i>clausura</i>.
</p>

<p>
O  terceiro elemento  é o  contexto  léxico, uma  associação local  de
símbolos  aos  quais  valores  estejam atrelados.   Se  o  exemplo  de
clausura  tive sido  declarado no  <i>top-level</i>, o  contexto léxico  será
vazio.
</p>

<p>
O quarto  elemento, <code>(x)</code>, é  uma <i>lambda list</i>, podendo  ser compreendida
como os parâmetros da função. Quando a  função é chamada, o valor de <code>x</code>
será aquele valor com o qual a função é chamada.
</p>

<p>
O quinto e último elemento, <code>(+ x 1)</code>, é o <i>corpo</i> da clausura, e define o
valor retornado pela mesma.
</p>
</div>
</div>

<div id="outline-container-org88f1a0b" class="outline-3">
<h3 id="org88f1a0b"><span class="section-number-3">6.2.</span> Representação alternativa de clausuras</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Normalmente,  não expressamos  uma clausura  usando sua  representação
literal. É suficiente que utilizemos a notação
</p>

<pre class="example" id="org982b3a4">
(fn (x) (+ x 1))
</pre>

<p>
que gerará a clausura explicitada anteriormente.
</p>

<p>
Esta sintaxe determina,  a princípio, uma forma especial,  uma vez que
realiza captura de escopo e produz uma literal.
</p>
</div>
</div>
</div>

<div id="outline-container-orge7599b4" class="outline-2">
<h2 id="orge7599b4"><span class="section-number-2">7.</span> Macros</h2>
<div class="outline-text-2" id="text-7">
<p>
Uma funcionalidade muito recorrente em dialetos de Lisp é a construção
de <i>macros</i>: elementos  que auxiliam o programador  a reescrever sintaxe
no  programa. Através  do uso  de  <i>macros</i>, pode-se  criar formas  mais
sucintas  ou mais  intuitivas  para  determinados problemas,  enquanto
ainda não se foge do uso da sintaxe da linguagem.
</p>
</div>

<div id="outline-container-org6175448" class="outline-3">
<h3 id="org6175448"><span class="section-number-3">7.1.</span> Representação</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Macros são  clausuras executadas  sobre uma expressão  qualquer, antes
que a mesma seja interpretada. Nesse  sentido, o <i>macro</i> nada mais é que
uma função que opera sobre dados comuns.
</p>

<p>
Um <i>macro</i> é  representado como um <i>literal</i> de três  elementos, tal que o
terceiro elemento  seja uma  clausura propriamente dita,  como pode-se
ver a seguir:
</p>

<pre class="example" id="orgc914e82">
(lit macro (lit closure &lt;lexenv&gt; (f x) (list f x)))
</pre>

<p>
O  primeiro elemento,  <code>lit</code>, deixa  claro  que estamos  tratando de  um
literal,  que  consequentemente  não  deverá  ter  seus  sub-elementos
interpretados. Já o segundo elemento, <code>macro</code>, clarifica que tal literal
constitui um <i>macro</i>.
</p>

<p>
O  terceiro elemento  é  uma  <i>clausura</i> comum,  que  será aplicada  aos
argumentos do <i>macro</i>. Esta clausura captura o contexto onde o macro foi
definido, e seu  retorno será considerado uma expressão  que, de forma
subsequente à aplicação comum do macro, será interpretada.
</p>

<p>
À aplicação  da clausura associada  aos dados preprocessados,  damos o
nome de <i>expansão</i> do <i>macro</i>.
</p>
</div>
</div>
