A-especificacao.org
** Representação alternativa

Assim  como o  caso das  clausuras, podemos  expressar /macros/  com uma
notação sucinta baseada em uma forma especial:

#+begin_example
(mac (f x) (list f x))
#+end_example

O literal do macro poderá ser atribuído a um símbolo tanto no contexto
global  quanto no  contexto  léxico, porém,  tentar  /aplicar/ um  macro
(através da forma especial ~apply~, por exemplo) constitui um erro. Para
um macro,  pode-se fazer  sua /expansão/  através de  ~macroexpand-1~, por
exemplo.

* Interpretação

A execução de  um programa em Majestic Lisp  consiste na interpretação
de expressões.  Todos  os objetos Majestic são  expressões, portanto a
palavra "expressão"  é meramente um comunicado  de intenção: significa
que espera-se que seja interpretado.

** Resultados de uma interpretação

1. Pode retornar um valor: ~(+ 1 2)~ retornará ~3~.
2. Pode causar um erro: ~(/ 1 0)~ causará.
3. Pode  falhar em terminar:  ~(defn foo () (foo))~ não parará  após ser
   invocada.

Outras  expressões também  realizam comportamento  no processo  de sua
interpretação,  o  que  é  convencionalmente  conhecido  como  /efeitos
colaterais/. Por exemplo, a expressão

#+begin_example
(print 1)
#+end_example

retornará ~nil~, mas antes disso, imprimirá ~1~ no console.

# TODO: Esse ~o~ aí é pra quê, meu filho?
Alguns /átomos/ são interpretados como si mesmos. Isto ocorre como todos
os caracteres, /streams/  e números, assim como com os  símbolos ~nil~, ~t~,
~o~ e ~apply~.  todos os outros símbolos são nomes  de variáveis, e sempre
serão interpretados para algum valor, ou  causarão um erro se eles não
possuírem valor associado.

** Chamadas de funções

Uma lista adequada cujo primeiro  elemento possa ser interpretado como
uma função  é conhecida  como uma  /chamada de  função/. Por  exemplo, a
expressão

#+begin_example
(+ x 1)
#+end_example

é uma  chamada de função, posto  que o valor  de ~+~ seja uma  função. O
valor de uma chamada de função será o objeto retornado pela mesma.

Chamadas de funções são interpretadas  da esquerda para a direita. Por
exemplo, ao interpretarmos a expressão

#+begin_example
(+ 2 3)
#+end_example

teremos:

1. Primeiramente, ~+~ é interpretado,  retornando uma /função/ que retorna
   a soma de seus argumentos.
2. ~2~ é interpretado, retornando a si mesmo.
3. ~3~ é interpretado, retornando a si mesmo.
4. Finalmente,  os dois números são  passados à função, que  retorna o
   número ~5~.

#+begin_example
> (+ 2 3)
5
#+end_example

Expressões podem ser  aninhadas. A regra de  interpretação da esquerda
para  a  direita significa  que  funções  aninhadas são  interpretadas
primeiramente e em profundidade. Por exemplo, a interpretação de

#+begin_example
(+ (- 5 2) 7)
#+end_example

pressupõe que as  sub-expressões que serão avaliadas  sejam, em ordem,
~+~, ~(- 5 2)~, ~-~, ~5~, ~2~ e ~7~.

** Formas especiais

Nem  todas  as  expressões  são   interpretadas  da  esquerda  para  a
direita.  Há  um  pequeno  conjunto de  símbolos  chamados  de  /formas
especiais/,  e as  expressões  cujo primeiro  elemento  seja uma  forma
especial será interpretada de acordo  com as regras definidas por essa
mesma forma especial.

Por exemplo, ~if~ é uma /forma especial/, e portanto, quando a expressão

#+begin_example
(if test then else)
#+end_example

é   interpretada,  apenas   um   dos  últimos   dois  elementos   será
interpretado,  dependendo do  valor retornado  pelo segundo  elemento,
~test~, que poderá ser verdadeiro ou falso.

Objetos  que  podem  ser  utilizados como  primeiro  elemento  de  uma
expressão são  chamados /operadores/. Assim, /funções/  e /formas especiais/
são /operadores/. Mas, assim como o termo "expressão", esta é apenas uma
expressão de  intenção. Pode-se colocar  qualquer objeto no  início de
uma expressão, desde que especifique-se o que acontece ao colocá-lo.

** TODO Escopo

# Um contexto não deve ser  diretamente modificável. Todavia, pode ser
# representado como uma alist.

# Global: Variáveis globais. Mutável.
# Léxico: Criado por função.
# Dinâmico: Funções percebem o contexto onde estão sendo executadas. O
# que  não significa  que saibam  tal contexto  durante uma  aplicação
# parcial.

* Ligações e Contextos

Há três formas  de fazer com que uma variável  tenha um valor: através
de ligações /globais/, /léxicas/ e /dinâmicas/.  A de consulta dos contextos
durante um processo de consulta de valores de variáveis é:

1. Contexto léxico;
2. Contexto dinâmico;
3. Contexto global.

** Ligações globais

Uma variável poderá  ter um valor /global/, como por  exemplo a função ~+~
possui, significando que, por padrão, ela possui aquele valor em todos
os lugares onde  puder ser invocada.  Tal variável  é dita /globalmente
ligada/, e o conjunto de ligações globais é chamado /contexto global/.

Podemos definir ligações globais entre  variáveis e valores através da
forma especial ~def~.

#+begin_example
> (def my-value 5)
my-value

> my-value
5
#+end_example

