A-especificacao.html

<div id="outline-container-org11630b4" class="outline-3">
<h3 id="org11630b4"><span class="section-number-3">7.2.</span> Representação alternativa</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Assim  como o  caso das  clausuras, podemos  expressar <i>macros</i>  com uma
notação sucinta baseada em uma forma especial:
</p>

<pre class="example" id="org9b77577">
(mac (f x) (list f x))
</pre>

<p>
O literal do macro poderá ser atribuído a um símbolo tanto no contexto
global  quanto no  contexto  léxico, porém,  tentar  <i>aplicar</i> um  macro
(através da forma especial <code>apply</code>, por exemplo) constitui um erro. Para
um macro,  pode-se fazer  sua <i>expansão</i>  através de  <code>macroexpand-1</code>, por
exemplo.
</p>
</div>
</div>
</div>

<div id="outline-container-org3d174e9" class="outline-2">
<h2 id="org3d174e9"><span class="section-number-2">8.</span> Interpretação</h2>
<div class="outline-text-2" id="text-8">
<p>
A execução de  um programa em Majestic Lisp  consiste na interpretação
de expressões.  Todos  os objetos Majestic são  expressões, portanto a
palavra "expressão"  é meramente um comunicado  de intenção: significa
que espera-se que seja interpretado.
</p>
</div>

<div id="outline-container-orge2a4111" class="outline-3">
<h3 id="orge2a4111"><span class="section-number-3">8.1.</span> Resultados de uma interpretação</h3>
<div class="outline-text-3" id="text-8-1">
<ol class="org-ol">
<li>Pode retornar um valor: <code>(+ 1 2)</code> retornará <code>3</code>.</li>
<li>Pode causar um erro: <code>(/ 1 0)</code> causará.</li>
<li>Pode  falhar em terminar:  <code>(defn foo () (foo))</code> não parará  após ser
invocada.</li>
</ol>

<p>
Outras  expressões também  realizam comportamento  no processo  de sua
interpretação,  o  que  é  convencionalmente  conhecido  como  <i>efeitos
colaterais</i>. Por exemplo, a expressão
</p>

<pre class="example" id="orge5b7ac3">
(print 1)
</pre>

<p>
retornará <code>nil</code>, mas antes disso, imprimirá <code>1</code> no console.
</p>

<p>
Alguns <i>átomos</i> são interpretados como si mesmos. Isto ocorre como todos
os caracteres, <i>streams</i>  e números, assim como com os  símbolos <code>nil</code>, <code>t</code>,
<code>o</code> e <code>apply</code>.  todos os outros símbolos são nomes  de variáveis, e sempre
serão interpretados para algum valor, ou  causarão um erro se eles não
possuírem valor associado.
</p>
</div>
</div>

<div id="outline-container-org934385e" class="outline-3">
<h3 id="org934385e"><span class="section-number-3">8.2.</span> Chamadas de funções</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Uma lista adequada cujo primeiro  elemento possa ser interpretado como
uma função  é conhecida  como uma  <i>chamada de  função</i>. Por  exemplo, a
expressão
</p>

<pre class="example" id="org2d95c36">
(+ x 1)
</pre>

<p>
é uma  chamada de função, posto  que o valor  de <code>+</code> seja uma  função. O
valor de uma chamada de função será o objeto retornado pela mesma.
</p>

<p>
Chamadas de funções são interpretadas  da esquerda para a direita. Por
exemplo, ao interpretarmos a expressão
</p>

<pre class="example" id="orga921ebf">
(+ 2 3)
</pre>

<p>
teremos:
</p>

<ol class="org-ol">
<li>Primeiramente, <code>+</code> é interpretado,  retornando uma <i>função</i> que retorna
a soma de seus argumentos.</li>
<li><code>2</code> é interpretado, retornando a si mesmo.</li>
<li><code>3</code> é interpretado, retornando a si mesmo.</li>
<li>Finalmente,  os dois números são  passados à função, que  retorna o
número <code>5</code>.</li>
</ol>

<pre class="example" id="org758d06e">
&gt; (+ 2 3)
5
</pre>

<p>
Expressões podem ser  aninhadas. A regra de  interpretação da esquerda
para  a  direita significa  que  funções  aninhadas são  interpretadas
primeiramente e em profundidade. Por exemplo, a interpretação de
</p>

<pre class="example" id="orga6da642">
(+ (- 5 2) 7)
</pre>

<p>
pressupõe que as  sub-expressões que serão avaliadas  sejam, em ordem,
<code>+</code>, <code>(- 5 2)</code>, <code>-</code>, <code>5</code>, <code>2</code> e <code>7</code>.
</p>
</div>
</div>

<div id="outline-container-org3199dfb" class="outline-3">
<h3 id="org3199dfb"><span class="section-number-3">8.3.</span> Formas especiais</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Nem  todas  as  expressões  são   interpretadas  da  esquerda  para  a
direita.  Há  um  pequeno  conjunto de  símbolos  chamados  de  <i>formas
especiais</i>,  e as  expressões  cujo primeiro  elemento  seja uma  forma
especial será interpretada de acordo  com as regras definidas por essa
mesma forma especial.
</p>

<p>
Por exemplo, <code>if</code> é uma <i>forma especial</i>, e portanto, quando a expressão
</p>

<pre class="example" id="orge78e8ad">
(if test then else)
</pre>

<p>
é   interpretada,  apenas   um   dos  últimos   dois  elementos   será
interpretado,  dependendo do  valor retornado  pelo segundo  elemento,
<code>test</code>, que poderá ser verdadeiro ou falso.
</p>

<p>
Objetos  que  podem  ser  utilizados como  primeiro  elemento  de  uma
expressão são  chamados <i>operadores</i>. Assim, <i>funções</i>  e <i>formas especiais</i>
são <i>operadores</i>. Mas, assim como o termo "expressão", esta é apenas uma
expressão de  intenção. Pode-se colocar  qualquer objeto no  início de
uma expressão, desde que especifique-se o que acontece ao colocá-lo.
</p>
</div>
</div>

<div id="outline-container-org8f08237" class="outline-3">
<h3 id="org8f08237"><span class="section-number-3">8.4.</span> <span class="todo TODO">TODO</span> Escopo</h3>
<div class="outline-text-3" id="text-8-4">
</div>
</div>
</div>

<div id="outline-container-orgde6bcf8" class="outline-2">
<h2 id="orgde6bcf8"><span class="section-number-2">9.</span> Ligações e Contextos</h2>
<div class="outline-text-2" id="text-9">
<p>
Há três formas  de fazer com que uma variável  tenha um valor: através
de ligações <i>globais</i>, <i>léxicas</i> e <i>dinâmicas</i>.  A de consulta dos contextos
durante um processo de consulta de valores de variáveis é:
</p>

<ol class="org-ol">
<li>Contexto léxico;</li>
<li>Contexto dinâmico;</li>
<li>Contexto global.</li>
</ol>
</div>

<div id="outline-container-orga4c904a" class="outline-3">
<h3 id="orga4c904a"><span class="section-number-3">9.1.</span> Ligações globais</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Uma variável poderá  ter um valor <i>global</i>, como por  exemplo a função <code>+</code>
possui, significando que, por padrão, ela possui aquele valor em todos
os lugares onde  puder ser invocada.  Tal variável  é dita <i>globalmente
ligada</i>, e o conjunto de ligações globais é chamado <i>contexto global</i>.
</p>

<p>
Podemos definir ligações globais entre  variáveis e valores através da
forma especial <code>def</code>.
</p>

<pre class="example" id="org8a9f3da">
&gt; (def my-value 5)
my-value

&gt; my-value
5
</pre>
</div>
</div>
