A-especificacao.org
** Ligações léxicas ou estáticas

Outra forma de uma variável ter um valor é através de ser um parâmetro
de uma clausura. Quando a clausura

#+begin_example
(fn (x) (+ x 1))
#+end_example

é chamada,  a variável ~x~  irá, no corpo da  mesma, assumir o  valor de
qualquer que seja o argumento com  o qual a clausura foi chamada. Este
processo é chamado  de /ligação léxica/, e o atual  conjunto de /ligações
léxicas/ durante a execução do corpo de uma clausura é chamado /contexto
léxico/.

Ocasionalmente, caso a clausura tenha sido definida dentro de outra,
como no exemplo a seguir...

#+begin_example
(fn (x) (fn (y) (+ x y)))
#+end_example

...a  clausura  mais  interna  /capturará/  todas  as  ligações  léxicas
determinadas  pela  externa  --  leia-se  o valor  atribuído  a  ~x~  na
invocação da clausura.   Sendo assim, por mais que o  valor de retorno
da  clausura  mais  externa  seja  a  clausura  interna,  esta  última
conhecerá o valor de ~x~ devido a esse mecanismo de captura.

Um  contexto capturado  por  uma clausura  será  extendido mediante  a
aplicação  da mesma,  adicionando-se novas  definições que  determinem
valores associados aos parâmetros da clausura.

Uma clausura  definida sob  um contexto  global capturará  um contexto
vazio, posto que  o contexto global compreenda um  contexto especial e
diretamente modificável pela forma especial ~def~.

Ao contexto capturado  pela clausura, antes e depois  de sua extensão,
damos o nome /contexto léxico/.

Abaixo,  temos  um   exemplo  explícito  que  explora   a  captura  de
contexto. ~g~ é  definido através do retorno da aplicação  direta de uma
função anônima, que por sua vez  retorna uma segunda função. Como esta
segunda função  é gerada  dentro do  escopo da  primeira, o  escopo da
primeira  função, gerado  durante a  aplicação da  mesma, onde  ~x~ está
bem-definido e  ligado a ~9~,  é capturado pela função  retornada.

#+begin_example
> (def g
    ((fn (x)
       (fn (y) (+ x y)))
     9))
g

> (g 4)
13
#+end_example

** Ligações dinâmicas

Adicionalmente,  como terceira  opção, temos  uma ligação  dinâmica. A
ligação dinâmica ocorre  quando uma clausura refere-se  a uma variável
que foi definida pelo contexto léxico onde a clausura foi chamada.

Por exemplo, consideremos as definições a seguir.

#+begin_example
> (def *my-value* 5)
my-value

> (def my-function
    (fn () *my-value*))
my-function
#+end_example

O exemplo  a seguir  demonstra a invocação  da clausura  armazenada no
contexto  global, sob  a alcunha  ~my-function~.  Esta  clausura procura
primeiramente por  essa variável no  contexto léxico que  captura; não
encontrando-a, volta-se para o contexto global, e lá procura-a.

#+begin_example
> (my-function)
5
#+end_example

Em algumas  situações, pode  ser pertinente  /redefinir temporariamente/
uma variável global ou, caso tal  variável global não exista, pode ser
pertinente defini-la temporariamente.

Isso  pode  ser  feito  através  da  criação  de  um  /contexto  léxico
"especial"/, que  será consultado  pela clausura  antes da  consulta no
/contexto global/. Vejamos o exemplo a seguir:

#+begin_example
> (let ((*my-value* 6))
    (my-function))
6
#+end_example

~let~ nada mais é que um  /macro/ para criação de contextos /léxicos/, sendo
portanto   equivalente  à   aplicação  de   uma  clausura,   de  forma
não-explícita.  Isso significa  que ~my-function~  será executada  em um
contexto  léxico  que  realiza  /sombreamento/ da  definição  global  de
~*my-value*~.

Este  exemplo mostra  uma situação  onde, após  ~my-function~ falhar  ao
tentar  encontrar ~*my-value*~  no escopo  léxico que  captura, a  mesma
verifica o escopo  em que foi /invocada/, antes de  realizar uma procura
por ~*my-value*~ no escopo global.

Dizemos,  portanto,  que  ~*my-value*~ foi  dinamicamente  definida  com
relação a ~my-function~, podendo  influenciar recursivamente na execução
dessa  clausura. Todavia,  não  há definição  explícita  de um  /escopo
dinâmico/, sendo  este tão somente  relacionado à forma  como clausuras
são  aplicadas,  e  a  como ~*my-value*~  foi  localmente  redefinida  e
acessada.

Na  prática, durante  a  invocação de  ~my-function~,  esta realiza  uma
*mescla* entre  seu escopo léxico  (após a  extensão) e o  escopo léxico
onde a mesma foi invocada. Esse  processo de mescla é chamado de *união
de contextos*, e deve garantir que os símbolos ligados no escopo léxico
capturado e extendido tenham precedência de consulta sobre os símbolos
ligados no escopo onde a clausura foi invocada.

Assim,  ainda  que  possamos  falar   em  /escopo  dinâmico/  para  fins
didáticos, o mesmo  trata-se de uma pequena modificação  na forma como
uma clausura lida com seu próprio escopo.

** Mutabilidade

Majestic Lisp provê  formas de modificar certos  valores ou variáveis,
principalmente através das formas especiais ~set~, ~set-car~ e ~set-cdr~. As
duas  últimas  modificam  os  valores que  compõem  uma  célula  /cons/,
enquanto ~set~ é responsável por modificar a associação entre um símbolo
e um valor.

A  forma especial  ~set~ é,  portanto, responsável  pela modificação  do
valor associado a um certo identificador, em um contexto específico.

Redefinir o valor associado a um identificador não modifica o valor em
questão, apenas utiliza  um novo valor da linguagem  para substituir o
valor que ali estava associado.

O contexto modificado  pelo uso de ~set~  é dado pelo contexto  em que a
variável em questão estiver alocada.  Desta forma, pode-se alterar uma
variável local, capturada pelo escopo  da função, global, ou até mesmo
dinâmica.

#+begin_example
> (def x 5)
x

> x
5

> (set x 9)
x

> x
9

> (let ((x 12))
    (set x (1+ x))
    x)
13

> (defn mutate-x ()
    (set x (+ x 2))
    x)
mutate-x

> (mutate-x)
11

> (let ((x 12))
    (mutate-x))
14

> x
11

> (let ((x 12))
    (defn mutate-x-local ()
      (set x (+ x 2))
      x))
mutate-x-local

> (mutate-x-local)
14

> x
11

> (mutate-x-local)
16

> x
11
#+end_example

No caso específico das formas especiais ~set-car~ e ~set-cdr~, modifica-se
uma célula /cons/, independentemente do tipo de ligação realizada para a
declaração de tal  célula.  Em outras palavras,  a variável modificada
terá seu contexto deduzido através do mesmo método empregado por ~set~.

#+begin_example
> (def x '(1 . 2))
x

> x
(1 . 2)

> (set-car x 5)
(5 . 2)

> (set-cdr x 6)
(5 . 6)

> x
(5 . 6)

> (defn replace-x-elts (a b)
    (set-car x a)
    (set-cdr x b)
    x)
replace-x-elts

> (let ((x '(9 . 10)))
    (replace-x-elts 20 90))
(20 . 90)

> x
(5 . 6)

> (replace-x-elts 30 45)
(30 . 45)

> x
(30 . 45)

> (let ((x '(9 . 10)))
    (defn replace-x-elts-local (a b)
      (set-car x a)
      (set-cdr x b)
      x))
replace-x-elts-local

> (replace-x-elts-local 13 50)
(13 . 50)

> x
(30 . 45)
#+end_example

