A-especificacao.html

<div id="outline-container-org84f3467" class="outline-3">
<h3 id="org84f3467"><span class="section-number-3">9.2.</span> Ligações léxicas ou estáticas</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Outra forma de uma variável ter um valor é através de ser um parâmetro
de uma clausura. Quando a clausura
</p>

<pre class="example" id="org2b43c49">
(fn (x) (+ x 1))
</pre>

<p>
é chamada,  a variável <code>x</code>  irá, no corpo da  mesma, assumir o  valor de
qualquer que seja o argumento com  o qual a clausura foi chamada. Este
processo é chamado  de <i>ligação léxica</i>, e o atual  conjunto de <i>ligações
léxicas</i> durante a execução do corpo de uma clausura é chamado <i>contexto
léxico</i>.
</p>

<p>
Ocasionalmente, caso a clausura tenha sido definida dentro de outra,
como no exemplo a seguir&#x2026;
</p>

<pre class="example" id="org536b2a7">
(fn (x) (fn (y) (+ x y)))
</pre>

<p>
&#x2026;a  clausura  mais  interna  <i>capturará</i>  todas  as  ligações  léxicas
determinadas  pela  externa  &#x2013;  leia-se  o valor  atribuído  a  <code>x</code>  na
invocação da clausura.   Sendo assim, por mais que o  valor de retorno
da  clausura  mais  externa  seja  a  clausura  interna,  esta  última
conhecerá o valor de <code>x</code> devido a esse mecanismo de captura.
</p>

<p>
Um  contexto capturado  por  uma clausura  será  extendido mediante  a
aplicação  da mesma,  adicionando-se novas  definições que  determinem
valores associados aos parâmetros da clausura.
</p>

<p>
Uma clausura  definida sob  um contexto  global capturará  um contexto
vazio, posto que  o contexto global compreenda um  contexto especial e
diretamente modificável pela forma especial <code>def</code>.
</p>

<p>
Ao contexto capturado  pela clausura, antes e depois  de sua extensão,
damos o nome <i>contexto léxico</i>.
</p>

<p>
Abaixo,  temos  um   exemplo  explícito  que  explora   a  captura  de
contexto. <code>g</code> é  definido através do retorno da aplicação  direta de uma
função anônima, que por sua vez  retorna uma segunda função. Como esta
segunda função  é gerada  dentro do  escopo da  primeira, o  escopo da
primeira  função, gerado  durante a  aplicação da  mesma, onde  <code>x</code> está
bem-definido e  ligado a <code>9</code>,  é capturado pela função  retornada.
</p>

<pre class="example" id="orgf53424d">
&gt; (def g
    ((fn (x)
       (fn (y) (+ x y)))
     9))
g

&gt; (g 4)
13
</pre>
</div>
</div>

<div id="outline-container-org448edc4" class="outline-3">
<h3 id="org448edc4"><span class="section-number-3">9.3.</span> Ligações dinâmicas</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Adicionalmente,  como terceira  opção, temos  uma ligação  dinâmica. A
ligação dinâmica ocorre  quando uma clausura refere-se  a uma variável
que foi definida pelo contexto léxico onde a clausura foi chamada.
</p>

<p>
Por exemplo, consideremos as definições a seguir.
</p>

<pre class="example" id="orge87e2bc">
&gt; (def *my-value* 5)
my-value

&gt; (def my-function
    (fn () *my-value*))
my-function
</pre>

<p>
O exemplo  a seguir  demonstra a invocação  da clausura  armazenada no
contexto  global, sob  a alcunha  <code>my-function</code>.  Esta  clausura procura
primeiramente por  essa variável no  contexto léxico que  captura; não
encontrando-a, volta-se para o contexto global, e lá procura-a.
</p>

<pre class="example" id="org3554a6c">
&gt; (my-function)
5
</pre>

<p>
Em algumas  situações, pode  ser pertinente  <i>redefinir temporariamente</i>
uma variável global ou, caso tal  variável global não exista, pode ser
pertinente defini-la temporariamente.
</p>

<p>
Isso  pode  ser  feito  através  da  criação  de  um  <i>contexto  léxico
"especial"</i>, que  será consultado  pela clausura  antes da  consulta no
<i>contexto global</i>. Vejamos o exemplo a seguir:
</p>

<pre class="example" id="org2dab854">
&gt; (let ((*my-value* 6))
    (my-function))
6
</pre>

<p>
<code>let</code> nada mais é que um  <i>macro</i> para criação de contextos <i>léxicos</i>, sendo
portanto   equivalente  à   aplicação  de   uma  clausura,   de  forma
não-explícita.  Isso significa  que <code>my-function</code>  será executada  em um
contexto  léxico  que  realiza  <i>sombreamento</i> da  definição  global  de
<code>*my-value*</code>.
</p>

<p>
Este  exemplo mostra  uma situação  onde, após  <code>my-function</code> falhar  ao
tentar  encontrar <code>*my-value*</code>  no escopo  léxico que  captura, a  mesma
verifica o escopo  em que foi <i>invocada</i>, antes de  realizar uma procura
por <code>*my-value*</code> no escopo global.
</p>

<p>
Dizemos,  portanto,  que  <code>*my-value*</code> foi  dinamicamente  definida  com
relação a <code>my-function</code>, podendo  influenciar recursivamente na execução
dessa  clausura. Todavia,  não  há definição  explícita  de um  <i>escopo
dinâmico</i>, sendo  este tão somente  relacionado à forma  como clausuras
são  aplicadas,  e  a  como <code>*my-value*</code>  foi  localmente  redefinida  e
acessada.
</p>

<p>
Na  prática, durante  a  invocação de  <code>my-function</code>,  esta realiza  uma
<b>mescla</b> entre  seu escopo léxico  (após a  extensão) e o  escopo léxico
onde a mesma foi invocada. Esse  processo de mescla é chamado de <b>união
de contextos</b>, e deve garantir que os símbolos ligados no escopo léxico
capturado e extendido tenham precedência de consulta sobre os símbolos
ligados no escopo onde a clausura foi invocada.
</p>

<p>
Assim,  ainda  que  possamos  falar   em  <i>escopo  dinâmico</i>  para  fins
didáticos, o mesmo  trata-se de uma pequena modificação  na forma como
uma clausura lida com seu próprio escopo.
</p>
</div>
</div>

<div id="outline-container-orga5ff9f8" class="outline-3">
<h3 id="orga5ff9f8"><span class="section-number-3">9.4.</span> Mutabilidade</h3>
<div class="outline-text-3" id="text-9-4">
<p>
Majestic Lisp provê  formas de modificar certos  valores ou variáveis,
principalmente através das formas especiais <code>set</code>, <code>set-car</code> e <code>set-cdr</code>. As
duas  últimas  modificam  os  valores que  compõem  uma  célula  <i>cons</i>,
enquanto <code>set</code> é responsável por modificar a associação entre um símbolo
e um valor.
</p>

<p>
A  forma especial  <code>set</code> é,  portanto, responsável  pela modificação  do
valor associado a um certo identificador, em um contexto específico.
</p>

<p>
Redefinir o valor associado a um identificador não modifica o valor em
questão, apenas utiliza  um novo valor da linguagem  para substituir o
valor que ali estava associado.
</p>

<p>
O contexto modificado  pelo uso de <code>set</code>  é dado pelo contexto  em que a
variável em questão estiver alocada.  Desta forma, pode-se alterar uma
variável local, capturada pelo escopo  da função, global, ou até mesmo
dinâmica.
</p>

<pre class="example" id="org68e9619">
&gt; (def x 5)
x

&gt; x
5

&gt; (set x 9)
x

&gt; x
9

&gt; (let ((x 12))
    (set x (1+ x))
    x)
13

&gt; (defn mutate-x ()
    (set x (+ x 2))
    x)
mutate-x

&gt; (mutate-x)
11

&gt; (let ((x 12))
    (mutate-x))
14

&gt; x
11

&gt; (let ((x 12))
    (defn mutate-x-local ()
      (set x (+ x 2))
      x))
mutate-x-local

&gt; (mutate-x-local)
14

&gt; x
11

&gt; (mutate-x-local)
16

&gt; x
11
</pre>

<p>
No caso específico das formas especiais <code>set-car</code> e <code>set-cdr</code>, modifica-se
uma célula <i>cons</i>, independentemente do tipo de ligação realizada para a
declaração de tal  célula.  Em outras palavras,  a variável modificada
terá seu contexto deduzido através do mesmo método empregado por <code>set</code>.
</p>

<pre class="example" id="org958aa7c">
&gt; (def x '(1 . 2))
x

&gt; x
(1 . 2)

&gt; (set-car x 5)
(5 . 2)

&gt; (set-cdr x 6)
(5 . 6)

&gt; x
(5 . 6)

&gt; (defn replace-x-elts (a b)
    (set-car x a)
    (set-cdr x b)
    x)
replace-x-elts

&gt; (let ((x '(9 . 10)))
    (replace-x-elts 20 90))
(20 . 90)

&gt; x
(5 . 6)

&gt; (replace-x-elts 30 45)
(30 . 45)

&gt; x
(30 . 45)

&gt; (let ((x '(9 . 10)))
    (defn replace-x-elts-local (a b)
      (set-car x a)
      (set-cdr x b)
      x))
replace-x-elts-local

&gt; (replace-x-elts-local 13 50)
(13 . 50)

&gt; x
(30 . 45)
</pre>
</div>
</div>
</div>
