A-especificacao.org
* Erros

Em  Majestic Lisp,  erros  são sinalizados  através  de uma  expressão
literal. Por exemplo, a expressão

#+begin_example
(/ 1 0)
#+end_example

poderá sinalizar um erro através da expressão:

#+begin_example
(lit error "Division by zero")
#+end_example

Na  expressão  de erro,  o  primeiro  elemento,  ~lit~, sinaliza  que  a
expressão inteira deverá ser interpretada para si mesma.

O segundo elemento,  ~error~, sinaliza que o objeto  em questão trata-se
de um erro.

O terceiro  elemento é uma  informação textual, que  chamamos /formato/,
designando as instruções para a mensagem de erro.

Pode-se  também   adicionar  mais  elementos,  que   complementarão  a
informação a ser impressa na tela. Por exemplo, um erro da forma

#+begin_example
(lit error "{} is not a number" nil)
#+end_example

indica a intenção de que seja mostrada uma mensagem de erro como

#+begin_example
nil is not a number
#+end_example

para o usuário.

Um objeto de  erro levanta uma /condição/ no sistema,  o que não precisa
significar algo muito sofisticado,  mas deverá paralizar imediatamente
o processo atual de interpretação, e  então ser mostrado ao usuário. A
impressão da  mensagem de  erro na  tela fica a  cargo do  ambiente de
programação.

A  notação utilizada  na  mensagem de  erro, que  está  em formato  de
/string/, é uma  notação correspondente à utilizada  na função primitiva
~format~.

Os erros podem  ser diretamente criados através da  primitiva ~err~, que
será especificada junto às funções primitivas da linguagem.

* Axiomas

** Variáveis e constantes

*** Símbolos auto-interpretáveis

Alguns símbolos são  interpretáveis como si mesmos. Este é  o caso dos
símbolos ~nil~, ~t~, ~&~ e ~apply~.

*** Caracteres

Caracteres  também são  símbolos  auto-interpretáveis; o  valor de  um
caractere é sempre ele mesmo.

*** Números

Números   originalmente  poderiam   ser   enquadrados  como   símbolos
especiais,  mas em  Majestic Lisp,  compreendemos o  número como  algo
separado e igualmente auto-interpretável.

*** Constantes globais
**** ~*stdin*~

Referencia, por padrão, o stream padrão de entrada da aplicação.

Normalmente, este  stream está relacionado à  digitação de informações
da parte do usuário, em um terminal.

Como  este  stream  está  relacionado ao  processo  do  programa,  sua
implementação é livre,  desde que se adeque ao  vocabulário de streams
comuns. Todavia, ~*stdin*~  é um stream que *nunca  poderá ser encerrado*,
de forma  que seu tempo  de vida esteja atrelado  ao tempo de  vida da
execução do interpretador de Majestic Lisp.

**** ~*stdout*~

Referencia, por padrão, o stream padrão de saída da aplicação.

Normalmente,  este stream  está relacionado  à escrita  de informações
pelo interpretador, em um terminal.

Como  este  stream  está  relacionado ao  processo  do  programa,  sua
implementação é livre,  desde que se adeque ao  vocabulário de streams
comuns. Todavia, ~*stdout*~ é um  stream que *nunca poderá ser encerrado*,
de forma  que seu tempo  de vida esteja atrelado  ao tempo de  vida da
execução do interpretador de Majestic Lisp.

**** ~*stderr*~

Referencia, por padrão, o stream de saída de erros da aplicação.

Normalmente,  este  stream  está  relacionado à  escrita  de  erros  e
avisos.

Como  este  stream  está  relacionado ao  processo  do  programa,  sua
implementação é livre,  desde que se adeque ao  vocabulário de streams
comuns. Todavia, ~*stderr*~ é um  stream que *nunca poderá ser encerrado*,
de forma  que seu tempo  de vida esteja atrelado  ao tempo de  vida da
execução do interpretador de Majestic Lisp.

**** ~*ulps*~

Enumera um  número inteiro  positivo, expressando a  quantidade mínima
de  números ~float~  representáveis entre  dois números  ~float~ de  mesmo
sinal, para que estes sejam considerados aproximadamente iguais.

Seu nome  está relacionado às  expressões /units of least  precision/ ou
/units in the last place/.

Por padrão, corresponde ao número inteiro ~3~. Para maiores informações,
veja a descrição da função ~float=~.

** Quote

** Funções Primitivas

Funções primitivas podem ser chamadas como funções, todavia, assume-se
que já  existam, sem  que precisem ser  definidas com  código Majestic
Lisp. Assim  como ocorre  nas chamadas de  funções, os  /argumentos/ nas
chamadas de  primitivas são  completamente interpretados,  da esquerda
para a direita.

*** Convenções

# TODO: Isso  aqui precisa ser  analisado com cuidado. Qual  o impacto
# dessa decisão em Majestic?
# TODO: Isso  aqui é  só para primitivas  mesmo ou  precisamos ajustar
# isso para demais funções?
Por convenção, argumentos faltantes  ao fim da /lambda-list/ equivalerão
a  ~nil~.  Em contrapartida,  argumentos  extras  serão considerados  um
erro.

Ademais,  funções  que  enquadram-se  como /predicados/  (ou  seja,  que
produzem um resultado  /verdadeiro/ ou /falso/ de acordo com  uma lista de
argumentos)  normalmente terminam  seus  nomes com  o  caractere ~p~,  à
exceção dos predicados ~eq~ e ~id~, por razões históricas.

*** ~(symbolp x)~

Informa se ~x~ é um símbolo ou  não. ~t~ é retornado em caso afirmativo, e
~nil~ em caso negativo.

#+begin_example
> (symbolp t)
t

> (symbolp 2/3)
nil
#+end_example

*** ~(eq x y)~

Informa se ~x~ e ~y~ são símbolos /equivalentes/. A comparação só realmente
ocorre se  ~x~ e ~y~  forem especificamente  símbolos. Caso ambos  sejam o
mesmo símbolo, ~t~ é retornado; caso algum de ambos não seja símbolo ou,
se forem, caso não sejam idênticos, retorna-se ~nil~.

#+begin_example
> (eq t t)
t

> (eq nil nil)
t

> (eq t nil)
nil

> (eq 20 t)
nil
#+end_example

*** ~(nilp x)~

Informa se ~x~ é /equivalente/ a ~nil~.  ~t~ é retornado em caso afirmativo, e
~nil~ em caso negativo.

# TODO: Isso  perdura? Ver a  questão do valor padrão  doss argumentos
# faltantes.
Pode-se  convencionar que  o comportamento  da chamada  ~(nilp x)~  seja
exatamente o mesmo de ~(eq x)~ ou ~(eq x nil)~.

#+begin_example
> (nilp nil)
t

> (nilp 5)
nil
#+end_example

*** ~(consp x)~

Informa se ~x~ é  uma célula /cons/.  ~t~ é retornado  em caso afirmativo, e
~nil~ em caso negativo.

#+begin_example
> (consp (cons 2 3))
t

> (consp '(a . b))
t

> (consp 10)
nil
#+end_example

