A-especificacao.html

<div id="outline-container-org6064364" class="outline-2">
<h2 id="org6064364"><span class="section-number-2">10.</span> Erros</h2>
<div class="outline-text-2" id="text-10">
<p>
Em  Majestic Lisp,  erros  são sinalizados  através  de uma  expressão
literal. Por exemplo, a expressão
</p>

<pre class="example" id="org3e5db37">
(/ 1 0)
</pre>

<p>
poderá sinalizar um erro através da expressão:
</p>

<pre class="example" id="org34eedbc">
(lit error "Division by zero")
</pre>

<p>
Na  expressão  de erro,  o  primeiro  elemento,  <code>lit</code>, sinaliza  que  a
expressão inteira deverá ser interpretada para si mesma.
</p>

<p>
O segundo elemento,  <code>error</code>, sinaliza que o objeto  em questão trata-se
de um erro.
</p>

<p>
O terceiro  elemento é uma  informação textual, que  chamamos <i>formato</i>,
designando as instruções para a mensagem de erro.
</p>

<p>
Pode-se  também   adicionar  mais  elementos,  que   complementarão  a
informação a ser impressa na tela. Por exemplo, um erro da forma
</p>

<pre class="example" id="org7789c06">
(lit error "{} is not a number" nil)
</pre>

<p>
indica a intenção de que seja mostrada uma mensagem de erro como
</p>

<pre class="example" id="org5bc3c6a">
nil is not a number
</pre>

<p>
para o usuário.
</p>

<p>
Um objeto de  erro levanta uma <i>condição</i> no sistema,  o que não precisa
significar algo muito sofisticado,  mas deverá paralizar imediatamente
o processo atual de interpretação, e  então ser mostrado ao usuário. A
impressão da  mensagem de  erro na  tela fica a  cargo do  ambiente de
programação.
</p>

<p>
A  notação utilizada  na  mensagem de  erro, que  está  em formato  de
<i>string</i>, é uma  notação correspondente à utilizada  na função primitiva
<code>format</code>.
</p>

<p>
Os erros podem  ser diretamente criados através da  primitiva <code>err</code>, que
será especificada junto às funções primitivas da linguagem.
</p>
</div>
</div>

<div id="outline-container-org8ba35d6" class="outline-2">
<h2 id="org8ba35d6"><span class="section-number-2">11.</span> Axiomas</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org7398c10" class="outline-3">
<h3 id="org7398c10"><span class="section-number-3">11.1.</span> Variáveis e constantes</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<div id="outline-container-orgaa45278" class="outline-4">
<h4 id="orgaa45278"><span class="section-number-4">11.1.1.</span> Símbolos auto-interpretáveis</h4>
<div class="outline-text-4" id="text-11-1-1">
<p>
Alguns símbolos são  interpretáveis como si mesmos. Este é  o caso dos
símbolos <code>nil</code>, <code>t</code>, <code>&amp;</code> e <code>apply</code>.
</p>
</div>
</div>

<div id="outline-container-org53ad12f" class="outline-4">
<h4 id="org53ad12f"><span class="section-number-4">11.1.2.</span> Caracteres</h4>
<div class="outline-text-4" id="text-11-1-2">
<p>
Caracteres  também são  símbolos  auto-interpretáveis; o  valor de  um
caractere é sempre ele mesmo.
</p>
</div>
</div>

<div id="outline-container-orgdce789d" class="outline-4">
<h4 id="orgdce789d"><span class="section-number-4">11.1.3.</span> Números</h4>
<div class="outline-text-4" id="text-11-1-3">
<p>
Números   originalmente  poderiam   ser   enquadrados  como   símbolos
especiais,  mas em  Majestic Lisp,  compreendemos o  número como  algo
separado e igualmente auto-interpretável.
</p>
</div>
</div>

<div id="outline-container-org0f91f7c" class="outline-4">
<h4 id="org0f91f7c"><span class="section-number-4">11.1.4.</span> Constantes globais</h4>
<div class="outline-text-4" id="text-11-1-4">
</div>
<ol class="org-ol">
<li><a id="org02a3f47"></a><code>*stdin*</code><br />
<div class="outline-text-5" id="text-11-1-4-1">
<p>
Referencia, por padrão, o stream padrão de entrada da aplicação.
</p>

<p>
Normalmente, este  stream está relacionado à  digitação de informações
da parte do usuário, em um terminal.
</p>

<p>
Como  este  stream  está  relacionado ao  processo  do  programa,  sua
implementação é livre,  desde que se adeque ao  vocabulário de streams
comuns. Todavia, <code>*stdin*</code>  é um stream que <b>nunca  poderá ser encerrado</b>,
de forma  que seu tempo  de vida esteja atrelado  ao tempo de  vida da
execução do interpretador de Majestic Lisp.
</p>
</div>
</li>

<li><a id="org01cfca9"></a><code>*stdout*</code><br />
<div class="outline-text-5" id="text-11-1-4-2">
<p>
Referencia, por padrão, o stream padrão de saída da aplicação.
</p>

<p>
Normalmente,  este stream  está relacionado  à escrita  de informações
pelo interpretador, em um terminal.
</p>

<p>
Como  este  stream  está  relacionado ao  processo  do  programa,  sua
implementação é livre,  desde que se adeque ao  vocabulário de streams
comuns. Todavia, <code>*stdout*</code> é um  stream que <b>nunca poderá ser encerrado</b>,
de forma  que seu tempo  de vida esteja atrelado  ao tempo de  vida da
execução do interpretador de Majestic Lisp.
</p>
</div>
</li>

<li><a id="org015daa0"></a><code>*stderr*</code><br />
<div class="outline-text-5" id="text-11-1-4-3">
<p>
Referencia, por padrão, o stream de saída de erros da aplicação.
</p>

<p>
Normalmente,  este  stream  está  relacionado à  escrita  de  erros  e
avisos.
</p>

<p>
Como  este  stream  está  relacionado ao  processo  do  programa,  sua
implementação é livre,  desde que se adeque ao  vocabulário de streams
comuns. Todavia, <code>*stderr*</code> é um  stream que <b>nunca poderá ser encerrado</b>,
de forma  que seu tempo  de vida esteja atrelado  ao tempo de  vida da
execução do interpretador de Majestic Lisp.
</p>
</div>
</li>

<li><a id="org9abe479"></a><code>*ulps*</code><br />
<div class="outline-text-5" id="text-11-1-4-4">
<p>
Enumera um  número inteiro  positivo, expressando a  quantidade mínima
de  números <code>float</code>  representáveis entre  dois números  <code>float</code> de  mesmo
sinal, para que estes sejam considerados aproximadamente iguais.
</p>

<p>
Seu nome  está relacionado às  expressões <i>units of least  precision</i> ou
<i>units in the last place</i>.
</p>

<p>
Por padrão, corresponde ao número inteiro <code>3</code>. Para maiores informações,
veja a descrição da função <code>float=</code>.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org52409f7" class="outline-3">
<h3 id="org52409f7"><span class="section-number-3">11.2.</span> Quote</h3>
</div>

<div id="outline-container-orgf04cd8e" class="outline-3">
<h3 id="orgf04cd8e"><span class="section-number-3">11.3.</span> Funções Primitivas</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Funções primitivas podem ser chamadas como funções, todavia, assume-se
que já  existam, sem  que precisem ser  definidas com  código Majestic
Lisp. Assim  como ocorre  nas chamadas de  funções, os  <i>argumentos</i> nas
chamadas de  primitivas são  completamente interpretados,  da esquerda
para a direita.
</p>
</div>

<div id="outline-container-orgc8de040" class="outline-4">
<h4 id="orgc8de040"><span class="section-number-4">11.3.1.</span> Convenções</h4>
<div class="outline-text-4" id="text-11-3-1">
<p>
Por convenção, argumentos faltantes  ao fim da <i>lambda-list</i> equivalerão
a  <code>nil</code>.  Em contrapartida,  argumentos  extras  serão considerados  um
erro.
</p>

<p>
Ademais,  funções  que  enquadram-se  como <i>predicados</i>  (ou  seja,  que
produzem um resultado  <i>verdadeiro</i> ou <i>falso</i> de acordo com  uma lista de
argumentos)  normalmente terminam  seus  nomes com  o  caractere <code>p</code>,  à
exceção dos predicados <code>eq</code> e <code>id</code>, por razões históricas.
</p>
</div>
</div>

<div id="outline-container-org4ae11eb" class="outline-4">
<h4 id="org4ae11eb"><span class="section-number-4">11.3.2.</span> <code>(symbolp x)</code></h4>
<div class="outline-text-4" id="text-11-3-2">
<p>
Informa se <code>x</code> é um símbolo ou  não. <code>t</code> é retornado em caso afirmativo, e
<code>nil</code> em caso negativo.
</p>

<pre class="example" id="org51576ab">
&gt; (symbolp t)
t

&gt; (symbolp 2/3)
nil
</pre>
</div>
</div>

<div id="outline-container-org7b53e1e" class="outline-4">
<h4 id="org7b53e1e"><span class="section-number-4">11.3.3.</span> <code>(eq x y)</code></h4>
<div class="outline-text-4" id="text-11-3-3">
<p>
Informa se <code>x</code> e <code>y</code> são símbolos <i>equivalentes</i>. A comparação só realmente
ocorre se  <code>x</code> e <code>y</code>  forem especificamente  símbolos. Caso ambos  sejam o
mesmo símbolo, <code>t</code> é retornado; caso algum de ambos não seja símbolo ou,
se forem, caso não sejam idênticos, retorna-se <code>nil</code>.
</p>

<pre class="example" id="orgda30fc1">
&gt; (eq t t)
t

&gt; (eq nil nil)
t

&gt; (eq t nil)
nil

&gt; (eq 20 t)
nil
</pre>
</div>
</div>

<div id="outline-container-org60e8471" class="outline-4">
<h4 id="org60e8471"><span class="section-number-4">11.3.4.</span> <code>(nilp x)</code></h4>
<div class="outline-text-4" id="text-11-3-4">
<p>
Informa se <code>x</code> é <i>equivalente</i> a <code>nil</code>.  <code>t</code> é retornado em caso afirmativo, e
<code>nil</code> em caso negativo.
</p>

<p>
Pode-se  convencionar que  o comportamento  da chamada  <code>(nilp x)</code>  seja
exatamente o mesmo de <code>(eq x)</code> ou <code>(eq x nil)</code>.
</p>

<pre class="example" id="org1c57883">
&gt; (nilp nil)
t

&gt; (nilp 5)
nil
</pre>
</div>
</div>
