A-especificacao.org
*** ~(atomp x)~

Informa se  ~x~ é  um /átomo/.  Convenciona-se que,  para todo  e qualquer
objeto que  não seja uma  célula /cons/, tal objeto  será um /átomo/.  ~t~ é
retornado em caso afirmativo, e ~nil~ em caso negativo.

#+begin_example
> (atomp 1)
t

> (atomp 'a)
t

> (atomp '(1 2 3))
nil
#+end_example

*** ~(charp x)~

Informa se ~x~ é  um caractere. ~t~ é retornado em  caso afirmativo, e ~nil~
em caso negativo.

# TODO: Incluir exemplo para strings aqui.

#+begin_example
> (charp #\a)
t

> (charp t)
nil
#+end_example

*** ~(char= x y)~

Compara pela igualdade de dois caracteres.

Caso algum dos objetos não seja um caractere, retorna um erro.

#+begin_example
> (char= #\a #\a)
t

> (char= #\a #\A)
nil

> (char= #\a t)
(lit error "{} is not a character" t)

> (char= nil #\bel)
(lit error "{} is not a character" nil)
#+end_example

*** ~(streamp x)~

Informa se ~x~ é um /stream/.  ~t~  é retornado em caso afirmativo, e ~nil~ em
caso negativo.

# TODO: Talvez seja necessário  alterar esse exemplo ao estabilizarmos
# os streams.

#+begin_example
> (streamp (open-stream 'out "/home/user/file.txt"))
t

> (streamp *stdout*)
t

> (streamp t)
nil
#+end_example

*** ~(numberp x)~

Informa se  ~x~ é um  /número/. Esse predicado  diz respeito a  números em
geral, não efetuando distinção de subtipos numéricos.

#+begin_example
> (numberp 2)
t

> (numberp .5)
t

> (numberp 2/3)
t

> (numberp 0j2.)
t

> (numberp t)
nil
#+end_example

A seguir, descreveremos alguns predicados  que fazem a distinção entre
subtipos numéricos.

**** ~(integerp x)~

Informa se ~x~ é um número  /inteiro/.  Esse predicado realiza a avaliação
de ~x~ para identificar se o mesmo é um número e, caso o seja, avalia se
trata-se de  um número inteiro.  ~t~  é retornado em caso  afirmativo, e
~nil~ em caso negativo.

#+begin_example
> (integerp 2)
t

> (integerp 2/3)
nil
#+end_example

**** ~(floatp x)~

Informa se ~x~ é um /ponto flutuante/.  Esse predicado realiza a avaliação
de ~x~ para identificar se o mesmo é um número e, caso o seja, avalia se
trata-se de um  ponto flutuante.  ~t~ é retornado em  caso afirmativo, e
~nil~ em caso negativo.

#+begin_example
> (floatp 2.5)

> (floatp 2.)
t

> (floatp .5)
t

> (floatp 3)
nil
#+end_example

**** ~(fractionp x)~

Informa se  ~x~ é uma /fração/.   Esse predicado realiza a  avaliação de ~x~
para identificar  se o  mesmo é um  número e, caso  o seja,  avalia se
trata-se de um número fracionário.   ~t~ é retornado em caso afirmativo,
e ~nil~ em caso negativo.

#+begin_example
> (fractionp 2/3)
t

> (fractionp 5/9)
t

> (fractionp 8)
nil
#+end_example

**** ~(complexp x)~

Informa se ~x~ é um número /complexo/.  Esse predicado realiza a avaliação
de ~x~ para identificar se o mesmo é um número e, caso o seja, avalia se
trata-se de um  número complexo.  ~t~ é retornado em  caso afirmativo, e
~nil~ em caso negativo.

#+begin_example
> (complexp .5J1)
t

> (complexp -10J-3)
t

> (complexp 5)
nil

> (complexp 5J0)
nil

> (complexp 5J0.)
t
#+end_example

Os dois últimos casos acima podem parecer peculiares do ponto de vista
do que  fazem, mas são  bastante triviais.  O número ~5J0~  é convertido
para  ~5~  (número  inteiro),  devido  à  nulidade  de  seu  coeficiente
imaginário. Em  ~5J0.~, porém, que  é também equivalente a  ~5J0.0~, ainda
que sua parte imaginária seja  tecnicamente nula, devido à condição de
não-comparação por nulidade em coerções de pontos flutuantes, inibe-se
que  o número  complexo como  um todo  seja convertido  para o  número
inteiro ~5~.

*** ~(vectorp x)~

Informa se ~x~  é um vetor. ~t~  é retornado em caso afirmativo,  e ~nil~ em
caso negativo.

#+begin_example
> (vectorp [1 2 3])
t

> (vectorp t)
nil
#+end_example

*** ~(id x y)~

Informa se ~x~ e ~y~ são /idênticos/, ou sejam, se são objetos que habitam o
mesmo lugar na memória da máquina.

A  ideia de  /identidade/  é  mais rigorosa  que  a  /igualdade/, e  menos
específica que a /equivalência/. Enquanto pode-se dizer que há apenas um
de  cada símbolo  ou caractere,  pode  haver um  número gigantesco  de
células  /cons/  que não  sejam  /idênticas/,  mas  que tenham  /os  mesmos
elementos/.

#+begin_example
> (id 'a 'a)
t

> (id #\c #\c)
t

> (id '(a b) '(a b))
nil
#+end_example

Igualmente,  pode  ser também  que  dois  números sejam  numericamente
iguais, mas sejam objetos diferentes.

#+begin_example
> (id 5 5)
nil
#+end_example

Esse  comportamento  ocorre  porque  a /identidade/  trata  de  comparar
diretamente  dois  objetos.  Enquanto  símbolos  e  caracteres  têm  a
/identidade/ verificada de forma diferente,  outros tipos de objetos são
comparados de  acordo com sua  localização na memória: caso  não sejam
símbolos ou caracteres, dois objetos  serão /idênticos/ se referem-se ao
exato mesmo espaço de memória.

Para  realizar  comparações  por   /igualdade/,  em  especial  de  forma
aritmética, recomenda-se utilizar a função ~=~ em vez de ~id~.

Para uma identidade,  ~t~ é retornado em caso afirmativo,  e ~nil~ em caso
negativo.

*** ~(proper-list-p x)~

Informa se ~x~ é uma /lista adequada/.

Como anteriormente  citado, uma  lista adequada  é um  encadeamento de
células /cons/, de tal forma que  iniciemos em uma célula /cons/ qualquer,
indicando o primeiro elemento da lista, e verifique-se que o ~cdr~ dessa
célula seja outro  /cons/, ou seja o símbolo ~nil~.  Caso seja outro /cons/,
deve-se   verificar    essa   mesma    condição   para    tal   célula
recém-descoberta.  ~t~ é  retornado em  caso afirmativo,  e ~nil~  em caso
negativo.

#+begin_example
> (proper-list-p '(a b c d))
t

> (proper-list-p '(a b c . d))
nil
#+end_example

*** ~(stringp x)~

Informa se ~x~ é uma /string/.

Strings são  vetores de caracteres  -- em outras palavras,  vetores de
tipo ~char~.

Caso  ~x~  seja  uma string,  ~t~  é  retornado.   Caso  não seja,  ~nil~  é
retornado.

#+begin_example
> (stringp (vector #\a #\b #\c))
t

> (stringp [#\a #\b #\c])
t

> (stringp "abc")
t

> (stringp '(#\a #\b #\c))
nil

> (stringp (vec-coerce 'any [#\a #\b #\c]))
nil

> (stringp t)
nil
#+end_example

