A-especificacao.html

<div id="outline-container-org1cd6160" class="outline-4">
<h4 id="org1cd6160"><span class="section-number-4">11.3.5.</span> <code>(consp x)</code></h4>
<div class="outline-text-4" id="text-11-3-5">
<p>
Informa se <code>x</code> é  uma célula <i>cons</i>.  <code>t</code> é retornado  em caso afirmativo, e
<code>nil</code> em caso negativo.
</p>

<pre class="example" id="orgf31f722">
&gt; (consp (cons 2 3))
t

&gt; (consp '(a . b))
t

&gt; (consp 10)
nil
</pre>
</div>
</div>

<div id="outline-container-org872a8b7" class="outline-4">
<h4 id="org872a8b7"><span class="section-number-4">11.3.6.</span> <code>(atomp x)</code></h4>
<div class="outline-text-4" id="text-11-3-6">
<p>
Informa se  <code>x</code> é  um <i>átomo</i>.  Convenciona-se que,  para todo  e qualquer
objeto que  não seja uma  célula <i>cons</i>, tal objeto  será um <i>átomo</i>.  <code>t</code> é
retornado em caso afirmativo, e <code>nil</code> em caso negativo.
</p>

<pre class="example" id="orgb511acd">
&gt; (atomp 1)
t

&gt; (atomp 'a)
t

&gt; (atomp '(1 2 3))
nil
</pre>
</div>
</div>

<div id="outline-container-orgfd7d30f" class="outline-4">
<h4 id="orgfd7d30f"><span class="section-number-4">11.3.7.</span> <code>(charp x)</code></h4>
<div class="outline-text-4" id="text-11-3-7">
<p>
Informa se <code>x</code> é  um caractere. <code>t</code> é retornado em  caso afirmativo, e <code>nil</code>
em caso negativo.
</p>

<pre class="example" id="org1ee7ca9">
&gt; (charp #\a)
t

&gt; (charp t)
nil
</pre>
</div>
</div>

<div id="outline-container-org58911f1" class="outline-4">
<h4 id="org58911f1"><span class="section-number-4">11.3.8.</span> <code>(char= x y)</code></h4>
<div class="outline-text-4" id="text-11-3-8">
<p>
Compara pela igualdade de dois caracteres.
</p>

<p>
Caso algum dos objetos não seja um caractere, retorna um erro.
</p>

<pre class="example" id="orgaac5ddd">
&gt; (char= #\a #\a)
t

&gt; (char= #\a #\A)
nil

&gt; (char= #\a t)
(lit error "{} is not a character" t)

&gt; (char= nil #\bel)
(lit error "{} is not a character" nil)
</pre>
</div>
</div>

<div id="outline-container-org9578239" class="outline-4">
<h4 id="org9578239"><span class="section-number-4">11.3.9.</span> <code>(streamp x)</code></h4>
<div class="outline-text-4" id="text-11-3-9">
<p>
Informa se <code>x</code> é um <i>stream</i>.  <code>t</code>  é retornado em caso afirmativo, e <code>nil</code> em
caso negativo.
</p>

<pre class="example" id="org22929b3">
&gt; (streamp (open-stream 'out "/home/user/file.txt"))
t

&gt; (streamp *stdout*)
t

&gt; (streamp t)
nil
</pre>
</div>
</div>

<div id="outline-container-org44a74d1" class="outline-4">
<h4 id="org44a74d1"><span class="section-number-4">11.3.10.</span> <code>(numberp x)</code></h4>
<div class="outline-text-4" id="text-11-3-10">
<p>
Informa se  <code>x</code> é um  <i>número</i>. Esse predicado  diz respeito a  números em
geral, não efetuando distinção de subtipos numéricos.
</p>

<pre class="example" id="orgf2656d0">
&gt; (numberp 2)
t

&gt; (numberp .5)
t

&gt; (numberp 2/3)
t

&gt; (numberp 0j2.)
t

&gt; (numberp t)
nil
</pre>

<p>
A seguir, descreveremos alguns predicados  que fazem a distinção entre
subtipos numéricos.
</p>
</div>

<ol class="org-ol">
<li><a id="org1ff372f"></a><code>(integerp x)</code><br />
<div class="outline-text-5" id="text-11-3-10-1">
<p>
Informa se <code>x</code> é um número  <i>inteiro</i>.  Esse predicado realiza a avaliação
de <code>x</code> para identificar se o mesmo é um número e, caso o seja, avalia se
trata-se de  um número inteiro.  <code>t</code>  é retornado em caso  afirmativo, e
<code>nil</code> em caso negativo.
</p>

<pre class="example" id="orgd64bd16">
&gt; (integerp 2)
t

&gt; (integerp 2/3)
nil
</pre>
</div>
</li>

<li><a id="org6cabc62"></a><code>(floatp x)</code><br />
<div class="outline-text-5" id="text-11-3-10-2">
<p>
Informa se <code>x</code> é um <i>ponto flutuante</i>.  Esse predicado realiza a avaliação
de <code>x</code> para identificar se o mesmo é um número e, caso o seja, avalia se
trata-se de um  ponto flutuante.  <code>t</code> é retornado em  caso afirmativo, e
<code>nil</code> em caso negativo.
</p>

<pre class="example" id="org223fc83">
&gt; (floatp 2.5)

&gt; (floatp 2.)
t

&gt; (floatp .5)
t

&gt; (floatp 3)
nil
</pre>
</div>
</li>

<li><a id="org4126cd8"></a><code>(fractionp x)</code><br />
<div class="outline-text-5" id="text-11-3-10-3">
<p>
Informa se  <code>x</code> é uma <i>fração</i>.   Esse predicado realiza a  avaliação de <code>x</code>
para identificar  se o  mesmo é um  número e, caso  o seja,  avalia se
trata-se de um número fracionário.   <code>t</code> é retornado em caso afirmativo,
e <code>nil</code> em caso negativo.
</p>

<pre class="example" id="org5b01047">
&gt; (fractionp 2/3)
t

&gt; (fractionp 5/9)
t

&gt; (fractionp 8)
nil
</pre>
</div>
</li>

<li><a id="orgbf21573"></a><code>(complexp x)</code><br />
<div class="outline-text-5" id="text-11-3-10-4">
<p>
Informa se <code>x</code> é um número <i>complexo</i>.  Esse predicado realiza a avaliação
de <code>x</code> para identificar se o mesmo é um número e, caso o seja, avalia se
trata-se de um  número complexo.  <code>t</code> é retornado em  caso afirmativo, e
<code>nil</code> em caso negativo.
</p>

<pre class="example" id="orge86784c">
&gt; (complexp .5J1)
t

&gt; (complexp -10J-3)
t

&gt; (complexp 5)
nil

&gt; (complexp 5J0)
nil

&gt; (complexp 5J0.)
t
</pre>

<p>
Os dois últimos casos acima podem parecer peculiares do ponto de vista
do que  fazem, mas são  bastante triviais.  O número <code>5J0</code>  é convertido
para  <code>5</code>  (número  inteiro),  devido  à  nulidade  de  seu  coeficiente
imaginário. Em  <code>5J0.</code>, porém, que  é também equivalente a  <code>5J0.0</code>, ainda
que sua parte imaginária seja  tecnicamente nula, devido à condição de
não-comparação por nulidade em coerções de pontos flutuantes, inibe-se
que  o número  complexo como  um todo  seja convertido  para o  número
inteiro <code>5</code>.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgca253f5" class="outline-4">
<h4 id="orgca253f5"><span class="section-number-4">11.3.11.</span> <code>(vectorp x)</code></h4>
<div class="outline-text-4" id="text-11-3-11">
<p>
Informa se <code>x</code>  é um vetor. <code>t</code>  é retornado em caso afirmativo,  e <code>nil</code> em
caso negativo.
</p>

<pre class="example" id="org3db6dff">
&gt; (vectorp [1 2 3])
t

&gt; (vectorp t)
nil
</pre>
</div>
</div>

<div id="outline-container-org1e83056" class="outline-4">
<h4 id="org1e83056"><span class="section-number-4">11.3.12.</span> <code>(id x y)</code></h4>
<div class="outline-text-4" id="text-11-3-12">
<p>
Informa se <code>x</code> e <code>y</code> são <i>idênticos</i>, ou sejam, se são objetos que habitam o
mesmo lugar na memória da máquina.
</p>

<p>
A  ideia de  <i>identidade</i>  é  mais rigorosa  que  a  <i>igualdade</i>, e  menos
específica que a <i>equivalência</i>. Enquanto pode-se dizer que há apenas um
de  cada símbolo  ou caractere,  pode  haver um  número gigantesco  de
células  <i>cons</i>  que não  sejam  <i>idênticas</i>,  mas  que tenham  <i>os  mesmos
elementos</i>.
</p>

<pre class="example" id="org9d44253">
&gt; (id 'a 'a)
t

&gt; (id #\c #\c)
t

&gt; (id '(a b) '(a b))
nil
</pre>

<p>
Igualmente,  pode  ser também  que  dois  números sejam  numericamente
iguais, mas sejam objetos diferentes.
</p>

<pre class="example" id="orgae6261a">
&gt; (id 5 5)
nil
</pre>

<p>
Esse  comportamento  ocorre  porque  a <i>identidade</i>  trata  de  comparar
diretamente  dois  objetos.  Enquanto  símbolos  e  caracteres  têm  a
<i>identidade</i> verificada de forma diferente,  outros tipos de objetos são
comparados de  acordo com sua  localização na memória: caso  não sejam
símbolos ou caracteres, dois objetos  serão <i>idênticos</i> se referem-se ao
exato mesmo espaço de memória.
</p>

<p>
Para  realizar  comparações  por   <i>igualdade</i>,  em  especial  de  forma
aritmética, recomenda-se utilizar a função <code>=</code> em vez de <code>id</code>.
</p>

<p>
Para uma identidade,  <code>t</code> é retornado em caso afirmativo,  e <code>nil</code> em caso
negativo.
</p>
</div>
</div>

<div id="outline-container-org9c0522d" class="outline-4">
<h4 id="org9c0522d"><span class="section-number-4">11.3.13.</span> <code>(proper-list-p x)</code></h4>
<div class="outline-text-4" id="text-11-3-13">
<p>
Informa se <code>x</code> é uma <i>lista adequada</i>.
</p>

<p>
Como anteriormente  citado, uma  lista adequada  é um  encadeamento de
células <i>cons</i>, de tal forma que  iniciemos em uma célula <i>cons</i> qualquer,
indicando o primeiro elemento da lista, e verifique-se que o <code>cdr</code> dessa
célula seja outro  <i>cons</i>, ou seja o símbolo <code>nil</code>.  Caso seja outro <i>cons</i>,
deve-se   verificar    essa   mesma    condição   para    tal   célula
recém-descoberta.  <code>t</code> é  retornado em  caso afirmativo,  e <code>nil</code>  em caso
negativo.
</p>

<pre class="example" id="org7d57e2b">
&gt; (proper-list-p '(a b c d))
t

&gt; (proper-list-p '(a b c . d))
nil
</pre>
</div>
</div>

<div id="outline-container-org6de9649" class="outline-4">
<h4 id="org6de9649"><span class="section-number-4">11.3.14.</span> <code>(stringp x)</code></h4>
<div class="outline-text-4" id="text-11-3-14">
<p>
Informa se <code>x</code> é uma <i>string</i>.
</p>

<p>
Strings são  vetores de caracteres  &#x2013; em outras palavras,  vetores de
tipo <code>char</code>.
</p>

<p>
Caso  <code>x</code>  seja  uma string,  <code>t</code>  é  retornado.   Caso  não seja,  <code>nil</code>  é
retornado.
</p>

<pre class="example" id="orgccadbdb">
&gt; (stringp (vector #\a #\b #\c))
t

&gt; (stringp [#\a #\b #\c])
t

&gt; (stringp "abc")
t

&gt; (stringp '(#\a #\b #\c))
nil

&gt; (stringp (vec-coerce 'any [#\a #\b #\c]))
nil

&gt; (stringp t)
nil
</pre>
</div>
</div>
