A-especificacao.org
*** ~(literalp x)~

Informa se ~x~ é um /literal/.

Literais são listas adequadas que são iniciadas pelo símbolo ~lit~. Tais
listas nunca  são recursivamente interpretadas; tentar  interpretar um
literal resulta nele mesmo como valor de retorno.

Caso  ~x~  seja  um  literal,  ~t~  é retornado.  Caso  não  seja,  ~nil~  é
retornado.

#+begin_example
> (literalp (fn (x) (* x x)))
t

> (literalp '(a b c))
nil

> (literalp (lit blah))
t
#+end_example

*** ~(primitivep x)~

Informa se ~x~ é uma /função primitiva/.

Funções primitivas são  similares a clausuras no sentido  de que podem
ser   /aplicadas/   a   argumentos,  porém   não   classificam-se   como
clausuras. Em  outras palavras, pressupõe-se que  uma primitiva esteja
presente  na  linguagem  durante  o  tempo  de  vida  da  execução  do
interpretador.

Assimo  como  no  caso  das clausuras,  primitivas  são  identificadas
internamente como literais. Por exemplo, a função primitiva ~primitivep~
em si  é interpretada  para um literal  ~(lit prim  primitivep)~. Assim,
identifica-se uma  /primitiva/ pelo valor  da consulta do seu  nome, que
envolve o símbolo ~prim~ como segundo elemento da lista.

Caso  ~x~ seja  uma primitiva,  ~t~  é retornado.   Caso não  seja, ~nil~  é
retornado.

#+begin_example
> (primitivep primitivep)
t

> (primitivep (fn (x) (+ x x)))
nil

> (primitivep +)
t
#+end_example

*** ~(closurep x)~

Informa se ~x~ é uma /clausura/.

Clausuras são literais gerados pelo  resultado de interpretação de uma
função  do usuário.  Especifica-se que  seja uma  clausura através  do
segundo símbolo  da lista  que identifica  tal literal;  este elemento
deverá ser o símbolo ~closure~.

Em geral, clausuras  possuem a peculiaridade de  não misturarem-se com
primitivas.  Portanto,  uma função  primitiva  não  é considerada  uma
clausura.

Caso  ~x~  seja uma  clausura,  ~t~  é retornado.  Caso  não  seja, ~nil~  é
retornado.

#+begin_example
> (closurep (fn (x) (* x x)))
t

> (closurep (lit blah))
nil

> (closurep cons)
nil

> (closurep +)
nil
#+end_example

*** ~(functionp x)~

Informa se ~x~  é uma função. Uma possível  implementação para ~functionp~
poderia ser:

#+begin_example
(defn functionp (f)
  (or (primitivep f)
      (closurep f)))
#+end_example

A alcunha /função/ deverá ser compreendida como um nome generalizado que
define  /funções primitivas/  ou  /clausuras/; em  outras palavras,  ambos
estes tipos de objetos compreendem /funções/.

Esta função, portanto,  retorna ~t~ caso ~x~ seja uma  função primitiva ou
uma clausura, e retorna ~nil~ em situação contrária.

#+begin_example
> (functionp (fn (x) (* x x)))
t

> (functionp +)
t

> (functionp cons)
t

> (functionp (lit blah))
nil
#+end_example

*** ~(macrop x)~

Informa se ~x~ é um /macro/.

Macros são literais  gerados pelo resultado de  interpretação da forma
especial ~mac~, que são capazes  de manipular expressões e reescrevê-las
para  que sejam,  subsequencialmente, interpretadas.  Especifica-se um
macro através do segundo símbolo  da lista que identifica tal literal;
este elemento deverá ser o símbolo ~macro~.

Macros  englobam uma  /clausura/  subjacente em  sua criação,  portanto,
pode-se compreender  o terceiro elemento  de um literal de  macro como
sendo tal clausura. Esta clausura  é responsável por receber dados que
não  serão interpretados  antes de  serem repassados,  e portanto,  um
/macro/ nada  mais é que uma  função especial que manipula  sintaxe para
que possa ser interpretada, de forma subsequente.

Caso ~x~ seja um macro, ~t~ é retornado. Caso não seja, ~nil~ é retornado.

#+begin_example
> (macrop (mac (x) `(list ,x)))
t

> (macrop until)
t

> (macrop (lit blah))
nil

> (macrop cons)
nil

> (macrop +)
nil
#+end_example

*** ~(errorp x)~

Informa se ~x~ é um objeto de /erro/.

Erros  assemelham-se  a  clausuras  e primitivas,  porque  são  também
/literais/. Um erro pode ser identificado através do segundo elemento de
sua literal, que será sempre o símbolo ~error~.

Caso ~x~ seja  um objeto de erro,  ~t~ é retornado.  Caso não  seja, ~nil~ é
retornado.

#+begin_example
> (errorp (err "Some error"))
t

> (errorp (lit error "Some other error"))
t

> (errorp 2)
nil
#+end_example

*** ~(cons x y)~

Retorna  uma nova  célula  /cons/ cuja  primeira metade  seja  ~x~ e  cuja
segunda metade seja ~y~.

#+begin_example
> (cons 'a 'b)
(a . b)

> (cons 1 2)
(1 . 2)
#+end_example

Uma nova  célula /cons/ não  será idêntica  (~id~) a nenhuma  outra célula
/cons/ existente.

*** ~(car x)~

Retorna a primeira metade de uma célula /cons/.

#+begin_example
> (car '(a . b))
a

> (car (cons 'c 'd))
c
#+end_example

Especificamente para o símbolo ~nil~, seu ~car~ é ~nil~.

#+begin_example
> (car nil)
nil
#+end_example

Historicamente,  /car/ refere-se  a "conteúdo  da parte  de endereço  do
número  no registrador"  (/Contents  of the  Address  part of  Register
number/). Esse nome legado refere-se à implementação original de LISP,
feita em um IBM 704 no final da década de 1950, por John McCarthy e
associados[fn:8].

*** ~(cdr x)~

Retorna a segunda metade de uma célula /cons/.

#+begin_example
> (cdr '(a . b))
b

> (cdr (cons 'c 'd))
d
#+end_example

Assim como em ~car~, para o símbolo ~nil~, seu ~cdr~ é ~nil~.

#+begin_example
> (cdr nil)
nil
#+end_example

Como  igualmente explicado  em  ~car~, o  nome /cdr/  é  histórico, e  diz
respeito ao "conteúdo da parte de decremento do número no registrador"
(/Contents of the Decrement part of Register number/).

*** ~(copy x)~

Retorna uma cópia rasa  de uma célula /cons/ ~x~. Se ~x~  não for uma célula
/cons/, retorna um erro.

A  função  cria uma  nova  célula  /cons/, garantidamente  diferente  de
quaisquer  outras células  /cons/  anteriormente  criadas. Todavia,  seu
conteúdo (/car/ e /cdr/) não  será copiado, permanecendo os mesmos objetos
do ~x~ original.

#+begin_example
> (def x (cons 'a 'b))
x

> (def y (copy x))
y

> x
(a . b)

> y
(a . b)

> (id x y)
nil

> (and (id (car x) (car y))
       (id (cdr x) (cdr y)))
t

> (copy t)
(lit error "{} is not a cons cell" t)
#+end_example

