A-especificacao.html

<div id="outline-container-orgc6bf322" class="outline-4">
<h4 id="orgc6bf322"><span class="section-number-4">11.3.15.</span> <code>(literalp x)</code></h4>
<div class="outline-text-4" id="text-11-3-15">
<p>
Informa se <code>x</code> é um <i>literal</i>.
</p>

<p>
Literais são listas adequadas que são iniciadas pelo símbolo <code>lit</code>. Tais
listas nunca  são recursivamente interpretadas; tentar  interpretar um
literal resulta nele mesmo como valor de retorno.
</p>

<p>
Caso  <code>x</code>  seja  um  literal,  <code>t</code>  é retornado.  Caso  não  seja,  <code>nil</code>  é
retornado.
</p>

<pre class="example" id="org4568074">
&gt; (literalp (fn (x) (* x x)))
t

&gt; (literalp '(a b c))
nil

&gt; (literalp (lit blah))
t
</pre>
</div>
</div>

<div id="outline-container-org82f6c4e" class="outline-4">
<h4 id="org82f6c4e"><span class="section-number-4">11.3.16.</span> <code>(primitivep x)</code></h4>
<div class="outline-text-4" id="text-11-3-16">
<p>
Informa se <code>x</code> é uma <i>função primitiva</i>.
</p>

<p>
Funções primitivas são  similares a clausuras no sentido  de que podem
ser   <i>aplicadas</i>   a   argumentos,  porém   não   classificam-se   como
clausuras. Em  outras palavras, pressupõe-se que  uma primitiva esteja
presente  na  linguagem  durante  o  tempo  de  vida  da  execução  do
interpretador.
</p>

<p>
Assimo  como  no  caso  das clausuras,  primitivas  são  identificadas
internamente como literais. Por exemplo, a função primitiva <code>primitivep</code>
em si  é interpretada  para um literal  <code>(lit prim  primitivep)</code>. Assim,
identifica-se uma  <i>primitiva</i> pelo valor  da consulta do seu  nome, que
envolve o símbolo <code>prim</code> como segundo elemento da lista.
</p>

<p>
Caso  <code>x</code> seja  uma primitiva,  <code>t</code>  é retornado.   Caso não  seja, <code>nil</code>  é
retornado.
</p>

<pre class="example" id="org2bcccd7">
&gt; (primitivep primitivep)
t

&gt; (primitivep (fn (x) (+ x x)))
nil

&gt; (primitivep +)
t
</pre>
</div>
</div>

<div id="outline-container-orgc1beee0" class="outline-4">
<h4 id="orgc1beee0"><span class="section-number-4">11.3.17.</span> <code>(closurep x)</code></h4>
<div class="outline-text-4" id="text-11-3-17">
<p>
Informa se <code>x</code> é uma <i>clausura</i>.
</p>

<p>
Clausuras são literais gerados pelo  resultado de interpretação de uma
função  do usuário.  Especifica-se que  seja uma  clausura através  do
segundo símbolo  da lista  que identifica  tal literal;  este elemento
deverá ser o símbolo <code>closure</code>.
</p>

<p>
Em geral, clausuras  possuem a peculiaridade de  não misturarem-se com
primitivas.  Portanto,  uma função  primitiva  não  é considerada  uma
clausura.
</p>

<p>
Caso  <code>x</code>  seja uma  clausura,  <code>t</code>  é retornado.  Caso  não  seja, <code>nil</code>  é
retornado.
</p>

<pre class="example" id="orgd6cf112">
&gt; (closurep (fn (x) (* x x)))
t

&gt; (closurep (lit blah))
nil

&gt; (closurep cons)
nil

&gt; (closurep +)
nil
</pre>
</div>
</div>

<div id="outline-container-org93c8e44" class="outline-4">
<h4 id="org93c8e44"><span class="section-number-4">11.3.18.</span> <code>(functionp x)</code></h4>
<div class="outline-text-4" id="text-11-3-18">
<p>
Informa se <code>x</code>  é uma função. Uma possível  implementação para <code>functionp</code>
poderia ser:
</p>

<pre class="example" id="org856e906">
(defn functionp (f)
  (or (primitivep f)
      (closurep f)))
</pre>

<p>
A alcunha <i>função</i> deverá ser compreendida como um nome generalizado que
define  <i>funções primitivas</i>  ou  <i>clausuras</i>; em  outras palavras,  ambos
estes tipos de objetos compreendem <i>funções</i>.
</p>

<p>
Esta função, portanto,  retorna <code>t</code> caso <code>x</code> seja uma  função primitiva ou
uma clausura, e retorna <code>nil</code> em situação contrária.
</p>

<pre class="example" id="org13accd1">
&gt; (functionp (fn (x) (* x x)))
t

&gt; (functionp +)
t

&gt; (functionp cons)
t

&gt; (functionp (lit blah))
nil
</pre>
</div>
</div>

<div id="outline-container-org668ddeb" class="outline-4">
<h4 id="org668ddeb"><span class="section-number-4">11.3.19.</span> <code>(macrop x)</code></h4>
<div class="outline-text-4" id="text-11-3-19">
<p>
Informa se <code>x</code> é um <i>macro</i>.
</p>

<p>
Macros são literais  gerados pelo resultado de  interpretação da forma
especial <code>mac</code>, que são capazes  de manipular expressões e reescrevê-las
para  que sejam,  subsequencialmente, interpretadas.  Especifica-se um
macro através do segundo símbolo  da lista que identifica tal literal;
este elemento deverá ser o símbolo <code>macro</code>.
</p>

<p>
Macros  englobam uma  <i>clausura</i>  subjacente em  sua criação,  portanto,
pode-se compreender  o terceiro elemento  de um literal de  macro como
sendo tal clausura. Esta clausura  é responsável por receber dados que
não  serão interpretados  antes de  serem repassados,  e portanto,  um
<i>macro</i> nada  mais é que uma  função especial que manipula  sintaxe para
que possa ser interpretada, de forma subsequente.
</p>

<p>
Caso <code>x</code> seja um macro, <code>t</code> é retornado. Caso não seja, <code>nil</code> é retornado.
</p>

<pre class="example" id="org6a2da7d">
&gt; (macrop (mac (x) `(list ,x)))
t

&gt; (macrop until)
t

&gt; (macrop (lit blah))
nil

&gt; (macrop cons)
nil

&gt; (macrop +)
nil
</pre>
</div>
</div>

<div id="outline-container-orgf69c3a8" class="outline-4">
<h4 id="orgf69c3a8"><span class="section-number-4">11.3.20.</span> <code>(errorp x)</code></h4>
<div class="outline-text-4" id="text-11-3-20">
<p>
Informa se <code>x</code> é um objeto de <i>erro</i>.
</p>

<p>
Erros  assemelham-se  a  clausuras  e primitivas,  porque  são  também
<i>literais</i>. Um erro pode ser identificado através do segundo elemento de
sua literal, que será sempre o símbolo <code>error</code>.
</p>

<p>
Caso <code>x</code> seja  um objeto de erro,  <code>t</code> é retornado.  Caso não  seja, <code>nil</code> é
retornado.
</p>

<pre class="example" id="org55dcc4f">
&gt; (errorp (err "Some error"))
t

&gt; (errorp (lit error "Some other error"))
t

&gt; (errorp 2)
nil
</pre>
</div>
</div>

<div id="outline-container-org032b9a0" class="outline-4">
<h4 id="org032b9a0"><span class="section-number-4">11.3.21.</span> <code>(cons x y)</code></h4>
<div class="outline-text-4" id="text-11-3-21">
<p>
Retorna  uma nova  célula  <i>cons</i> cuja  primeira metade  seja  <code>x</code> e  cuja
segunda metade seja <code>y</code>.
</p>

<pre class="example" id="orgbd07a25">
&gt; (cons 'a 'b)
(a . b)

&gt; (cons 1 2)
(1 . 2)
</pre>

<p>
Uma nova  célula <i>cons</i> não  será idêntica  (<code>id</code>) a nenhuma  outra célula
<i>cons</i> existente.
</p>
</div>
</div>

<div id="outline-container-org6c04c37" class="outline-4">
<h4 id="org6c04c37"><span class="section-number-4">11.3.22.</span> <code>(car x)</code></h4>
<div class="outline-text-4" id="text-11-3-22">
<p>
Retorna a primeira metade de uma célula <i>cons</i>.
</p>

<pre class="example" id="org720424d">
&gt; (car '(a . b))
a

&gt; (car (cons 'c 'd))
c
</pre>

<p>
Especificamente para o símbolo <code>nil</code>, seu <code>car</code> é <code>nil</code>.
</p>

<pre class="example" id="org250e94e">
&gt; (car nil)
nil
</pre>

<p>
Historicamente,  <i>car</i> refere-se  a "conteúdo  da parte  de endereço  do
número  no registrador"  (<i>Contents  of the  Address  part of  Register
number</i>). Esse nome legado refere-se à implementação original de LISP,
feita em um IBM 704 no final da década de 1950, por John McCarthy e
associados<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.
</p>
</div>
</div>

<div id="outline-container-org5a0b28f" class="outline-4">
<h4 id="org5a0b28f"><span class="section-number-4">11.3.23.</span> <code>(cdr x)</code></h4>
<div class="outline-text-4" id="text-11-3-23">
<p>
Retorna a segunda metade de uma célula <i>cons</i>.
</p>

<pre class="example" id="org18c6a00">
&gt; (cdr '(a . b))
b

&gt; (cdr (cons 'c 'd))
d
</pre>

<p>
Assim como em <code>car</code>, para o símbolo <code>nil</code>, seu <code>cdr</code> é <code>nil</code>.
</p>

<pre class="example" id="orgf2a2547">
&gt; (cdr nil)
nil
</pre>

<p>
Como  igualmente explicado  em  <code>car</code>, o  nome <i>cdr</i>  é  histórico, e  diz
respeito ao "conteúdo da parte de decremento do número no registrador"
(<i>Contents of the Decrement part of Register number</i>).
</p>
</div>
</div>

<div id="outline-container-orgc24a07a" class="outline-4">
<h4 id="orgc24a07a"><span class="section-number-4">11.3.24.</span> <code>(copy x)</code></h4>
<div class="outline-text-4" id="text-11-3-24">
<p>
Retorna uma cópia rasa  de uma célula <i>cons</i> <code>x</code>. Se <code>x</code>  não for uma célula
<i>cons</i>, retorna um erro.
</p>

<p>
A  função  cria uma  nova  célula  <i>cons</i>, garantidamente  diferente  de
quaisquer  outras células  <i>cons</i>  anteriormente  criadas. Todavia,  seu
conteúdo (<i>car</i> e <i>cdr</i>) não  será copiado, permanecendo os mesmos objetos
do <code>x</code> original.
</p>

<pre class="example" id="org41849f5">
&gt; (def x (cons 'a 'b))
x

&gt; (def y (copy x))
y

&gt; x
(a . b)

&gt; y
(a . b)

&gt; (id x y)
nil

&gt; (and (id (car x) (car y))
       (id (cdr x) (cdr y)))
t

&gt; (copy t)
(lit error "{} is not a cons cell" t)
</pre>
</div>
</div>
