A-especificacao.org
*** ~(length x)~

Retorna um número /inteiro/ correspondente  à quantidade de elementos em
uma  /lista/.

Se o  objeto for uma lista  pontuada, considera-se o tamanho  da mesma
até o /cdr/ contendo um átomo.

Se o  objeto for uma lista  adequada, procede-se da mesma  maneira até
que ~nil~ seja encontrado.

Caso o objeto em questão não seja uma /lista/, será levantado um erro no
sistema.

#+begin_example
> (length '(1 2 3 4))
4

> (length '(a b c))
3

> (length nil)
0

> (length 'a)
(lit error "{} is not a proper list" a)

> (length '(1 2 . 3))
2
#+end_example

*** ~(depth x)~

Retorna  um   número  inteiro   correspondente  ao  nível   máximo  de
aninhamentos em uma lista.

Se o objeto for um átomo, será levantado um erro no sistema.

Do contrário, a função recorre sobre a estrutura das células /cons/. Uma
sublista  será considerada  como tendo  profundidade se  e somente  se
possuir pelo menos um elemento.

#+begin_example
> (depth 1)
(lit error "{} is an atom" 1)

> (depth '())
0

> (depth '(()))
1

> (depth '((1)))
2

> (depth '(1 2 3 4 5))
5

> (depth '(1 2 3 4 5 6))
6

> (depth '(1 2 3 4 5 . 6))
5
#+end_example

*** ~(type x)~

Retorna um símbolo que indique o /tipo/ de um certo objeto.

Para  os  tipos  numéricos,  que envolvem  a  ideia  intermediária  de
/subtipo/, retorna-se  a informação  mais específica a  respeito daquele
elemento.  Por exemplo,  o tipo  de ~1/3~  será ~fraction~,  pois isso  já
indica  implicitamente  que  o  objeto  seja  um  ~number~.  Comparações
genéricas podem ser feitas com os predicados apropriados.

#+begin_example
> (type 1)
integer

> (type 2.0)
float

> (type 'a)
symbol

> (type nil)
symbol

> (type 2/3)
fraction

> (type '(a b c))
cons

> (type #\L)
char

> (type *stdout*)
stream

> (type 1J5)
complex

> (type [1 2 3])
vector
#+end_example

*** ~(intern x)~

/Interna/   um  novo   símbolo   no  escopo   global   da  linguagem   e
retorna-o.  Caso o  símbolo já  exista no  escopo global,  retorne tal
símbolo. Caso a string em questão seja vazia, será retornado o símbolo
~nil~.

~x~ deverá ser obrigatoriamente uma string. Essa string será o nome para
o novo símbolo em questão. Caso não seja, será retornado um erro.

É importante lembrar que o nome  de um símbolo é puramente estético do
ponto de  vista de sintaxe,  servindo portanto para designar  um único
símbolo, independente de sua implementação.

#+begin_example
> (intern "blah")
blah

> (intern "foo")
foo

> (intern "")
nil

> (intern 'a)
(lit error "{} is not a string" a)
#+end_example

*** ~(name x)~

Toma um  símbolo /interno/ no escopo  global da linguagem e  retorna seu
nome, no formato de string. Caso ~x~ não seja um símbolo, será retornado
um erro.

#+begin_example
> (name t)
"t"

> (name 'foo)
"foo"

> (name 'thing)
"thing"

> (name nil)
"nil"

> (name "Blah")
(lit error "{} is not a symbol" "Blah")
#+end_example

*** ~(get-environment type)~

Retorna uma referência  ao contexto requisitado. Se  o contexto léxico
for requisitado no /top-level/, será retornado um contexto vazio.

~type~ deve  corresponder a  um dos símbolos  ~lexical~ ou  ~global~. Outros
símbolos ocasionarão um erro.

Note que modificar o contexto retornado poderá colocar o interpretador
em um estado  inseguro. Todavia, os contextos /léxico/ e  /global/ não são
~set~-áveis, ou seja,  não há local em algum contexto,  por padrão, onde
podem ser redefinidos, pois suas referências não podem ser obtidas com
consulta simples.

#+begin_example
> (get-environment 'global)
#<environment {...}>

> (get-environment 'blah)
(lit error "Unknown environment type {}" blah)

> (let ((x 5)
        (y 6))
    (get-environment 'lexical))
#<environment {...}>

> (let ((x 5)
        (y 6))
    (let ((env (get-environment 'lexical)))
      (def sum-test `(lit closure ,env () ((+ x y))))))
sum-test

> (sum-test)
11
#+end_example

*** ~(coin)~

Retorna os símbolos ~t~ e ~nil~, aleatoriamente.

#+begin_example
> (coin)
t

> (coin)
t

> (coin)
nil

> (coin)
t

> (coin)
nil

> (coin)
nil
#+end_example

*** ~(sys com . args)~

Executa  o comando  ~com~, seguido  dos  argumentos em  ~args~. Tanto  ~com~
quanto os elementos da lista ~args~ devem ser /strings/.

Caso  o comando  não possa  ser  executado por  algum motivo  anormal,
retorna  um erro.   Caso algum  dos  argumentos não  seja uma  string,
também retorna um erro.

Caso o comando  seja executado com sucesso, retorna  um número inteiro
correspondente ao código de retorno do comando.

#+begin_example
> (sys "/bin/true")
0

> (sys "/bin/false")
1

> (sys "ls" "-all" "--color=never")
0
#+end_example

*** ~(format fmt . rest)~

Retorna uma /string/ contendo os elementos em ~rest~, formatados segundo a
/string/ de formato ~fmt~.

A /string/  de formato deverá conter  zero ou mais indicadores  na forma
~{}~,  que  serão  substituídos  pela formatação  padrão  dos  elementos
contidos em ~rest~, na sequência em que aparecem.

Caso  um  ou  mais  indicadores  ~{}~  estejam  mal-escritos,  a  função
retornará  um  erro.  Da  mesma  forma, caso  a  função  possua  menos
argumentos, após  o formato, do  que for  esperado no mesmo,  a função
também retornará um erro.

#+begin_example
> (format "Hello world")
"Hello world"

> (format "The number five: {}" 5)
"The number five: 5"

> (format "The floating point {} is nice" 2.)
"The floating point 2.0 is nice"

> (let ((x 1/2))
    (format "The number {} has a subtype {}"
            x
            (type x)))
"The number 1/2 has a subtype fraction"

> (format "Hello {}")
(lit error "Missing arguments on format")

> (format "Hello {" "World")
(lit error "Unmatched opening curly brace in {}" "Hello {")

> (format "Hello }" "World")
(lit error "Unmatched closing curly brace in {}" "Hello }")
#+end_example

*** ~(err fmt . rest)~

Cria um  objeto de  /erro/. O  retorno será um  /literal/, que  conterá um
formato e o restante dos argumentos para compor tal formato.

A string  de formato obedece à  mesma sintaxe de ~format~,  sendo também
acompanhada  de tantos  objetos quanto  forem necessários  para que  a
formatação possa ser aplicada.

#+begin_example
> (err "{} is not a number" t)
(lit error "{} is not a number" t)

> (err "This is an error, numbers are {} and {}" 2 3)
(lit error "This is an error, numbers are {} and {}" 2 3)
#+end_example

