A-especificacao.html

<div id="outline-container-orgb565c52" class="outline-4">
<h4 id="orgb565c52"><span class="section-number-4">11.3.25.</span> <code>(length x)</code></h4>
<div class="outline-text-4" id="text-11-3-25">
<p>
Retorna um número <i>inteiro</i> correspondente  à quantidade de elementos em
uma  <i>lista</i>.
</p>

<p>
Se o  objeto for uma lista  pontuada, considera-se o tamanho  da mesma
até o <i>cdr</i> contendo um átomo.
</p>

<p>
Se o  objeto for uma lista  adequada, procede-se da mesma  maneira até
que <code>nil</code> seja encontrado.
</p>

<p>
Caso o objeto em questão não seja uma <i>lista</i>, será levantado um erro no
sistema.
</p>

<pre class="example" id="org4194155">
&gt; (length '(1 2 3 4))
4

&gt; (length '(a b c))
3

&gt; (length nil)
0

&gt; (length 'a)
(lit error "{} is not a proper list" a)

&gt; (length '(1 2 . 3))
2
</pre>
</div>
</div>

<div id="outline-container-orga57edce" class="outline-4">
<h4 id="orga57edce"><span class="section-number-4">11.3.26.</span> <code>(depth x)</code></h4>
<div class="outline-text-4" id="text-11-3-26">
<p>
Retorna  um   número  inteiro   correspondente  ao  nível   máximo  de
aninhamentos em uma lista.
</p>

<p>
Se o objeto for um átomo, será levantado um erro no sistema.
</p>

<p>
Do contrário, a função recorre sobre a estrutura das células <i>cons</i>. Uma
sublista  será considerada  como tendo  profundidade se  e somente  se
possuir pelo menos um elemento.
</p>

<pre class="example" id="orgc0363a9">
&gt; (depth 1)
(lit error "{} is an atom" 1)

&gt; (depth '())
0

&gt; (depth '(()))
1

&gt; (depth '((1)))
2

&gt; (depth '(1 2 3 4 5))
5

&gt; (depth '(1 2 3 4 5 6))
6

&gt; (depth '(1 2 3 4 5 . 6))
5
</pre>
</div>
</div>

<div id="outline-container-org965085e" class="outline-4">
<h4 id="org965085e"><span class="section-number-4">11.3.27.</span> <code>(type x)</code></h4>
<div class="outline-text-4" id="text-11-3-27">
<p>
Retorna um símbolo que indique o <i>tipo</i> de um certo objeto.
</p>

<p>
Para  os  tipos  numéricos,  que envolvem  a  ideia  intermediária  de
<i>subtipo</i>, retorna-se  a informação  mais específica a  respeito daquele
elemento.  Por exemplo,  o tipo  de <code>1/3</code>  será <code>fraction</code>,  pois isso  já
indica  implicitamente  que  o  objeto  seja  um  <code>number</code>.  Comparações
genéricas podem ser feitas com os predicados apropriados.
</p>

<pre class="example" id="org917fe9c">
&gt; (type 1)
integer

&gt; (type 2.0)
float

&gt; (type 'a)
symbol

&gt; (type nil)
symbol

&gt; (type 2/3)
fraction

&gt; (type '(a b c))
cons

&gt; (type #\L)
char

&gt; (type *stdout*)
stream

&gt; (type 1J5)
complex

&gt; (type [1 2 3])
vector
</pre>
</div>
</div>

<div id="outline-container-org30cbb4e" class="outline-4">
<h4 id="org30cbb4e"><span class="section-number-4">11.3.28.</span> <code>(intern x)</code></h4>
<div class="outline-text-4" id="text-11-3-28">
<p>
<i>Interna</i>   um  novo   símbolo   no  escopo   global   da  linguagem   e
retorna-o.  Caso o  símbolo já  exista no  escopo global,  retorne tal
símbolo. Caso a string em questão seja vazia, será retornado o símbolo
<code>nil</code>.
</p>

<p>
<code>x</code> deverá ser obrigatoriamente uma string. Essa string será o nome para
o novo símbolo em questão. Caso não seja, será retornado um erro.
</p>

<p>
É importante lembrar que o nome  de um símbolo é puramente estético do
ponto de  vista de sintaxe,  servindo portanto para designar  um único
símbolo, independente de sua implementação.
</p>

<pre class="example" id="org1b4fe83">
&gt; (intern "blah")
blah

&gt; (intern "foo")
foo

&gt; (intern "")
nil

&gt; (intern 'a)
(lit error "{} is not a string" a)
</pre>
</div>
</div>

<div id="outline-container-orgfb4b9e2" class="outline-4">
<h4 id="orgfb4b9e2"><span class="section-number-4">11.3.29.</span> <code>(name x)</code></h4>
<div class="outline-text-4" id="text-11-3-29">
<p>
Toma um  símbolo <i>interno</i> no escopo  global da linguagem e  retorna seu
nome, no formato de string. Caso <code>x</code> não seja um símbolo, será retornado
um erro.
</p>

<pre class="example" id="org7e7ab6d">
&gt; (name t)
"t"

&gt; (name 'foo)
"foo"

&gt; (name 'thing)
"thing"

&gt; (name nil)
"nil"

&gt; (name "Blah")
(lit error "{} is not a symbol" "Blah")
</pre>
</div>
</div>

<div id="outline-container-org1b38ffe" class="outline-4">
<h4 id="org1b38ffe"><span class="section-number-4">11.3.30.</span> <code>(get-environment type)</code></h4>
<div class="outline-text-4" id="text-11-3-30">
<p>
Retorna uma referência  ao contexto requisitado. Se  o contexto léxico
for requisitado no <i>top-level</i>, será retornado um contexto vazio.
</p>

<p>
<code>type</code> deve  corresponder a  um dos símbolos  <code>lexical</code> ou  <code>global</code>. Outros
símbolos ocasionarão um erro.
</p>

<p>
Note que modificar o contexto retornado poderá colocar o interpretador
em um estado  inseguro. Todavia, os contextos <i>léxico</i> e  <i>global</i> não são
<code>set</code>-áveis, ou seja,  não há local em algum contexto,  por padrão, onde
podem ser redefinidos, pois suas referências não podem ser obtidas com
consulta simples.
</p>

<pre class="example" id="org4fc1b99">
&gt; (get-environment 'global)
#&lt;environment {...}&gt;

&gt; (get-environment 'blah)
(lit error "Unknown environment type {}" blah)

&gt; (let ((x 5)
        (y 6))
    (get-environment 'lexical))
#&lt;environment {...}&gt;

&gt; (let ((x 5)
        (y 6))
    (let ((env (get-environment 'lexical)))
      (def sum-test `(lit closure ,env () ((+ x y))))))
sum-test

&gt; (sum-test)
11
</pre>
</div>
</div>

<div id="outline-container-org5f859ae" class="outline-4">
<h4 id="org5f859ae"><span class="section-number-4">11.3.31.</span> <code>(coin)</code></h4>
<div class="outline-text-4" id="text-11-3-31">
<p>
Retorna os símbolos <code>t</code> e <code>nil</code>, aleatoriamente.
</p>

<pre class="example" id="orgf41551a">
&gt; (coin)
t

&gt; (coin)
t

&gt; (coin)
nil

&gt; (coin)
t

&gt; (coin)
nil

&gt; (coin)
nil
</pre>
</div>
</div>

<div id="outline-container-org08da3d4" class="outline-4">
<h4 id="org08da3d4"><span class="section-number-4">11.3.32.</span> <code>(sys com . args)</code></h4>
<div class="outline-text-4" id="text-11-3-32">
<p>
Executa  o comando  <code>com</code>, seguido  dos  argumentos em  <code>args</code>. Tanto  <code>com</code>
quanto os elementos da lista <code>args</code> devem ser <i>strings</i>.
</p>

<p>
Caso  o comando  não possa  ser  executado por  algum motivo  anormal,
retorna  um erro.   Caso algum  dos  argumentos não  seja uma  string,
também retorna um erro.
</p>

<p>
Caso o comando  seja executado com sucesso, retorna  um número inteiro
correspondente ao código de retorno do comando.
</p>

<pre class="example" id="org17f02fd">
&gt; (sys "/bin/true")
0

&gt; (sys "/bin/false")
1

&gt; (sys "ls" "-all" "--color=never")
0
</pre>
</div>
</div>

<div id="outline-container-org3e975ff" class="outline-4">
<h4 id="org3e975ff"><span class="section-number-4">11.3.33.</span> <code>(format fmt . rest)</code></h4>
<div class="outline-text-4" id="text-11-3-33">
<p>
Retorna uma <i>string</i> contendo os elementos em <code>rest</code>, formatados segundo a
<i>string</i> de formato <code>fmt</code>.
</p>

<p>
A <i>string</i>  de formato deverá conter  zero ou mais indicadores  na forma
<code>{}</code>,  que  serão  substituídos  pela formatação  padrão  dos  elementos
contidos em <code>rest</code>, na sequência em que aparecem.
</p>

<p>
Caso  um  ou  mais  indicadores  <code>{}</code>  estejam  mal-escritos,  a  função
retornará  um  erro.  Da  mesma  forma, caso  a  função  possua  menos
argumentos, após  o formato, do  que for  esperado no mesmo,  a função
também retornará um erro.
</p>

<pre class="example" id="org831c08c">
&gt; (format "Hello world")
"Hello world"

&gt; (format "The number five: {}" 5)
"The number five: 5"

&gt; (format "The floating point {} is nice" 2.)
"The floating point 2.0 is nice"

&gt; (let ((x 1/2))
    (format "The number {} has a subtype {}"
            x
            (type x)))
"The number 1/2 has a subtype fraction"

&gt; (format "Hello {}")
(lit error "Missing arguments on format")

&gt; (format "Hello {" "World")
(lit error "Unmatched opening curly brace in {}" "Hello {")

&gt; (format "Hello }" "World")
(lit error "Unmatched closing curly brace in {}" "Hello }")
</pre>
</div>
</div>

<div id="outline-container-orgfa75b1c" class="outline-4">
<h4 id="orgfa75b1c"><span class="section-number-4">11.3.34.</span> <code>(err fmt . rest)</code></h4>
<div class="outline-text-4" id="text-11-3-34">
<p>
Cria um  objeto de  <i>erro</i>. O  retorno será um  <i>literal</i>, que  conterá um
formato e o restante dos argumentos para compor tal formato.
</p>

<p>
A string  de formato obedece à  mesma sintaxe de <code>format</code>,  sendo também
acompanhada  de tantos  objetos quanto  forem necessários  para que  a
formatação possa ser aplicada.
</p>

<pre class="example" id="orgf6b1db6">
&gt; (err "{} is not a number" t)
(lit error "{} is not a number" t)

&gt; (err "This is an error, numbers are {} and {}" 2 3)
(lit error "This is an error, numbers are {} and {}" 2 3)
</pre>
</div>
</div>
