A-especificacao.org
*** ~(warn fmt . rest)~

Mostra uma mensagem de alerta em  ~*stderr*~, sucedida por uma quebra de
linha. O retorno será sempre ~nil~.

A string  de formato obedece à  mesma sintaxe de ~format~,  sendo também
acompanhada  de tantos  objetos quanto  forem necessários  para que  a
formatação possa ser aplicada.

Nos exemplos a seguir, a saída para o console corresponde à saída para
~*stderr*~, e não para a saída  padrão, como normalmente se apresenta em
outros exemplos.

#+begin_example
> (warn "{} is not a number" t)
; Warning: t is not a number
;
nil

> (warn "This is a warning, numbers are {} and {}" 2 3)
; Warning: This is a warning, numbers are 2 and 3
;
nil
#+end_example

*** ~(list . rest)~

Retorna uma nova lista com  todos os elementos passados por parâmetro,
na sequência em que foram passados.

Caso nenhum elemento tenha sido passado, retornará ~nil~.

#+begin_example
> (list 1 2 3)
(1 2 3)

> (list 'a 6 'b)
(a 6 b)

> (list)
nil
#+end_example

*** ~(append . rest)~

Retorna uma nova lista, gerada através  da anexação de todas as listas
passadas à função.

Se ~rest~  é uma lista  de listas, será gerada  uma nova lista,  tal que
todos  os elementos  de cada  sublistas  sejam dispostos  na nova,  na
sequência em que as sublistas foram fornecidas.

Se o último elemento de ~rest~ for  um único átomo, ele se tornará o /cdr/
ao fim da lista -- isto é, o resultado será uma /lista pontuada/.

#+begin_example
> (append '(1 2 3) '(4 5 6))
(1 2 3 4 5 6)

> (append '(a (b c) d (e)) '(f (g h)))
(a (b c) d (e) f (g h))

> (append '(a b c) 'd)
(a b c . d)
#+end_example

*** ~(last x)~

Retorna  o  último   /cons/ de  uma  lista.  Se   o  parâmetro  passado
inicialmente não for um /cons/, retorna um erro.

Caso a  lista passada seja uma  /lista pontuada/, retorna o  último /cons/
possível.

#+begin_example
> (last '(a b c d))
(d)

> (last '(a b c . d))
(c . d)

> (last 'a)
(lit error "{} is not a cons" a)
#+end_example

*** ~(reverse x)~

Inverte  os elementos  de uma  lista adequada  ~x~, retornando  uma nova
lista com os mesmos elementos da original.

Caso ~x~ não seja um /cons/, retorna  um erro. Da mesma forma, caso ~x~ seja
uma lista pontuada, retorna também um erro.

#+begin_example
> (reverse '(a b c d))
(d c b a)

> (reverse 'a)
(lit error "{} is not a cons" a)

> (reverse '(a b c . d))
(lit error "Not a proper list: {}" (a b c . d))
#+end_example

*** ~(nthcdr n lst)~

Recupera o ~n~-ésimo /cons/ da lista ~lst~.

Os /cons/'es  começam a ser  contados a partir  de ~0~.  Assim,  um número
menor  que  ~0~  incorrerá  em  um erro.   Da  mesma  forma,  um  número
não-inteiro também será considerado um erro.

Se  ~lst~ for  uma  lista  pontuada, o  algoritmo  tentará encontrar  os
elementos até  onde for possível.  Caso o algoritmo precise  chegar ao
ponto de encontrar o  /cdr/ de um objeto que não seja  /cons/ ou o símbolo
~nil~, um erro será levantado.

Caso ~n~ corresponda a um índice  maior que o índice atribuído ao último
elemento, o retorno será ~nil~.

#+begin_example
> (nthcdr 0 '(1 2 3 4))
(1 2 3 4)

> (nthcdr 1 '(1 2 3 4))
(2 3 4)

> (nthcdr 3 '(1 2 3 4))
(4)

> (nthcdr 3 '(1 2 3 . 4))
(lit error "{} is not a list" 4)

> (nthcdr -1 '(1 2 3 4))
(lit error "{} is not a valid index" -1)

> (nthcdr 3/4 '(1 2 3 4))
(lit error "{} is not an integer" 3/4)

> (nthcdr 4 '(1 2 3 4))
nil

> (nthcdr 5 '(1 2 3 4))
nil

> (nthcdr 50 nil)
nil
#+end_example

*** ~(nth n lst)~

Recupera o ~n~-ésimo elemento da lista ~lst~.

Uma possível implementação para ~nth~ seria:

#+begin_example
(defn nth (n lst)
  (car (nthcdr n lst)))
#+end_example

Os elementos  começam a ser contados  a partir de ~0~.  Assim, um número
menor  que  ~0~  incorrerá  em  um  erro.  Da  mesma  forma,  um  número
não-inteiro também será considerado um erro.

Se  ~lst~ for  uma  lista  pontuada, o  algoritmo  tentará encontrar  os
elementos até  onde for possível.  Caso o algoritmo precise  chegar ao
ponto de encontrar o  /cdr/ de um objeto que não seja  /cons/ ou o símbolo
~nil~, um erro será levantado.

Caso ~n~ corresponda a um índice  maior que o índice atribuído ao último
elemento, o retorno será ~nil~.

#+begin_example
> (nth 0 '(1 2 3 4))
1

> (nth 3 '(1 2 3 4))
4

> (nth 3 '(1 2 3 . 4))
(lit error "{} is not a list" 4)

> (nth -1 '(1 2 3 4))
(lit error "{} is not a valid index" -1)

> (nth 3/4 '(1 2 3 4))
(lit error "{} is not an integer" 3/4)

> (nth 4 '(1 2 3 4))
nil

> (nth 5 '(1 2 3 4))
nil

> (nth 50 nil)
nil
#+end_example

*** ~(macroexpand-1 x)~

Expande uma  expressão quotada,  caso esta envolva  a aplicação  de um
/macro/.

Retorna o resultado  da aplicação da função associada ao  macro, o que
pode ser tanto uma expressão válida quanto um objeto de erro.

#+begin_example
> (def m (mac (f x) (list f x)))
m

> (macroexpand-1 '(m f 5))
(f 5)
#+end_example

A expansão de um  macro deverá retornar um erro caso  a expansão em si
gere uma /função/  ao invés alguma outra forma, pois  *macros não admitem
aplicação parcial*.

Igualmente, caso a própria aplicação do  macro gere algum erro, o erro
deverá ser retornado.

*** TODO ~(macroexpand x)~ :noexport:

# Macroexpand não é pra funcionar assim não! Revisar isso aqui.
# Talvez  seja  legal  bolar  uma estratégia  melhor  de  expansão  de
# macros. Evitar expansões ad-hoc em runtime, quem sabe.

Expande  uma  expressão  quotada,   enquanto  esta  ainda  envolver  a
aplicação de um /macro/.

~macroexpand~ compreende  a aplicação  repetida da  função ~macroexpand-1~
até que não seja possível realizar uma nova expansão.

#+begin_example
> (def m1 (mac (f x) (list f x)))
m1

> (def m2 (mac (f) (list 'm1 f 5)))
m2

> (macroexpand-1 '(m2 f))
(m1 f 5)

> (macroexpand '(m2 f))
(f 5)
#+end_example

*** ~(not x)~

Nega logicamente o argumento ~x~.

De acordo  com as regras de  /verdade/ de Majestic Lisp,  qualquer valor
diferente de ~nil~ será  considerado verdadeiro. Portanto, ao aplicarmos
esta  função a  qualquer valor  diferente de  ~nil~, obteremos  ~nil~ como
resposta.

Pela mesma regra de /verdade/, ao  aplicarmos a função ~not~ ao valor ~nil~,
obteremos necessariamente o símbolo ~t~.

#+begin_example
> (not 1)
nil

> (not '(a b c))
nil

> (not t)
nil

> (not nil)
t
#+end_example

*** ~(gensym)~

Gera um símbolo aleatório.

Os símbolos  têm uma representação textual  com o formato ~:Gx~,  onde ~x~
será um número  que, internamente, é gerado sem que  haja colisões com
outros símbolos.

Isso  classifica  a  função  ~gensym~ como  uma  função  necessariamente
impura, sendo portanto dependente de estado externo à mesma.

#+begin_example
> (gensym)
:G88

> (gensym)
:G89

> (gensym)
:G90

> (gensym)
:G91
#+end_example

