A-especificacao.html

<div id="outline-container-org430f544" class="outline-4">
<h4 id="org430f544"><span class="section-number-4">11.3.35.</span> <code>(warn fmt . rest)</code></h4>
<div class="outline-text-4" id="text-11-3-35">
<p>
Mostra uma mensagem de alerta em  <code>*stderr*</code>, sucedida por uma quebra de
linha. O retorno será sempre <code>nil</code>.
</p>

<p>
A string  de formato obedece à  mesma sintaxe de <code>format</code>,  sendo também
acompanhada  de tantos  objetos quanto  forem necessários  para que  a
formatação possa ser aplicada.
</p>

<p>
Nos exemplos a seguir, a saída para o console corresponde à saída para
<code>*stderr*</code>, e não para a saída  padrão, como normalmente se apresenta em
outros exemplos.
</p>

<pre class="example" id="orgb484edc">
&gt; (warn "{} is not a number" t)
; Warning: t is not a number
;
nil

&gt; (warn "This is a warning, numbers are {} and {}" 2 3)
; Warning: This is a warning, numbers are 2 and 3
;
nil
</pre>
</div>
</div>

<div id="outline-container-org5b5ea5c" class="outline-4">
<h4 id="org5b5ea5c"><span class="section-number-4">11.3.36.</span> <code>(list . rest)</code></h4>
<div class="outline-text-4" id="text-11-3-36">
<p>
Retorna uma nova lista com  todos os elementos passados por parâmetro,
na sequência em que foram passados.
</p>

<p>
Caso nenhum elemento tenha sido passado, retornará <code>nil</code>.
</p>

<pre class="example" id="org041849f">
&gt; (list 1 2 3)
(1 2 3)

&gt; (list 'a 6 'b)
(a 6 b)

&gt; (list)
nil
</pre>
</div>
</div>

<div id="outline-container-org925d662" class="outline-4">
<h4 id="org925d662"><span class="section-number-4">11.3.37.</span> <code>(append . rest)</code></h4>
<div class="outline-text-4" id="text-11-3-37">
<p>
Retorna uma nova lista, gerada através  da anexação de todas as listas
passadas à função.
</p>

<p>
Se <code>rest</code>  é uma lista  de listas, será gerada  uma nova lista,  tal que
todos  os elementos  de cada  sublistas  sejam dispostos  na nova,  na
sequência em que as sublistas foram fornecidas.
</p>

<p>
Se o último elemento de <code>rest</code> for  um único átomo, ele se tornará o <i>cdr</i>
ao fim da lista &#x2013; isto é, o resultado será uma <i>lista pontuada</i>.
</p>

<pre class="example" id="orge2bfa6d">
&gt; (append '(1 2 3) '(4 5 6))
(1 2 3 4 5 6)

&gt; (append '(a (b c) d (e)) '(f (g h)))
(a (b c) d (e) f (g h))

&gt; (append '(a b c) 'd)
(a b c . d)
</pre>
</div>
</div>

<div id="outline-container-orga04122d" class="outline-4">
<h4 id="orga04122d"><span class="section-number-4">11.3.38.</span> <code>(last x)</code></h4>
<div class="outline-text-4" id="text-11-3-38">
<p>
Retorna  o  último   <i>cons</i> de  uma  lista.  Se   o  parâmetro  passado
inicialmente não for um <i>cons</i>, retorna um erro.
</p>

<p>
Caso a  lista passada seja uma  <i>lista pontuada</i>, retorna o  último <i>cons</i>
possível.
</p>

<pre class="example" id="org3e02bb8">
&gt; (last '(a b c d))
(d)

&gt; (last '(a b c . d))
(c . d)

&gt; (last 'a)
(lit error "{} is not a cons" a)
</pre>
</div>
</div>

<div id="outline-container-orgb89e7b5" class="outline-4">
<h4 id="orgb89e7b5"><span class="section-number-4">11.3.39.</span> <code>(reverse x)</code></h4>
<div class="outline-text-4" id="text-11-3-39">
<p>
Inverte  os elementos  de uma  lista adequada  <code>x</code>, retornando  uma nova
lista com os mesmos elementos da original.
</p>

<p>
Caso <code>x</code> não seja um <i>cons</i>, retorna  um erro. Da mesma forma, caso <code>x</code> seja
uma lista pontuada, retorna também um erro.
</p>

<pre class="example" id="orgea636cb">
&gt; (reverse '(a b c d))
(d c b a)

&gt; (reverse 'a)
(lit error "{} is not a cons" a)

&gt; (reverse '(a b c . d))
(lit error "Not a proper list: {}" (a b c . d))
</pre>
</div>
</div>

<div id="outline-container-orge43f4bf" class="outline-4">
<h4 id="orge43f4bf"><span class="section-number-4">11.3.40.</span> <code>(nthcdr n lst)</code></h4>
<div class="outline-text-4" id="text-11-3-40">
<p>
Recupera o <code>n</code>-ésimo <i>cons</i> da lista <code>lst</code>.
</p>

<p>
Os <i>cons</i>'es  começam a ser  contados a partir  de <code>0</code>.  Assim,  um número
menor  que  <code>0</code>  incorrerá  em  um erro.   Da  mesma  forma,  um  número
não-inteiro também será considerado um erro.
</p>

<p>
Se  <code>lst</code> for  uma  lista  pontuada, o  algoritmo  tentará encontrar  os
elementos até  onde for possível.  Caso o algoritmo precise  chegar ao
ponto de encontrar o  <i>cdr</i> de um objeto que não seja  <i>cons</i> ou o símbolo
<code>nil</code>, um erro será levantado.
</p>

<p>
Caso <code>n</code> corresponda a um índice  maior que o índice atribuído ao último
elemento, o retorno será <code>nil</code>.
</p>

<pre class="example" id="org2bc0747">
&gt; (nthcdr 0 '(1 2 3 4))
(1 2 3 4)

&gt; (nthcdr 1 '(1 2 3 4))
(2 3 4)

&gt; (nthcdr 3 '(1 2 3 4))
(4)

&gt; (nthcdr 3 '(1 2 3 . 4))
(lit error "{} is not a list" 4)

&gt; (nthcdr -1 '(1 2 3 4))
(lit error "{} is not a valid index" -1)

&gt; (nthcdr 3/4 '(1 2 3 4))
(lit error "{} is not an integer" 3/4)

&gt; (nthcdr 4 '(1 2 3 4))
nil

&gt; (nthcdr 5 '(1 2 3 4))
nil

&gt; (nthcdr 50 nil)
nil
</pre>
</div>
</div>

<div id="outline-container-orgaa09a6f" class="outline-4">
<h4 id="orgaa09a6f"><span class="section-number-4">11.3.41.</span> <code>(nth n lst)</code></h4>
<div class="outline-text-4" id="text-11-3-41">
<p>
Recupera o <code>n</code>-ésimo elemento da lista <code>lst</code>.
</p>

<p>
Uma possível implementação para <code>nth</code> seria:
</p>

<pre class="example" id="orgc2c911b">
(defn nth (n lst)
  (car (nthcdr n lst)))
</pre>

<p>
Os elementos  começam a ser contados  a partir de <code>0</code>.  Assim, um número
menor  que  <code>0</code>  incorrerá  em  um  erro.  Da  mesma  forma,  um  número
não-inteiro também será considerado um erro.
</p>

<p>
Se  <code>lst</code> for  uma  lista  pontuada, o  algoritmo  tentará encontrar  os
elementos até  onde for possível.  Caso o algoritmo precise  chegar ao
ponto de encontrar o  <i>cdr</i> de um objeto que não seja  <i>cons</i> ou o símbolo
<code>nil</code>, um erro será levantado.
</p>

<p>
Caso <code>n</code> corresponda a um índice  maior que o índice atribuído ao último
elemento, o retorno será <code>nil</code>.
</p>

<pre class="example" id="org7fb69bb">
&gt; (nth 0 '(1 2 3 4))
1

&gt; (nth 3 '(1 2 3 4))
4

&gt; (nth 3 '(1 2 3 . 4))
(lit error "{} is not a list" 4)

&gt; (nth -1 '(1 2 3 4))
(lit error "{} is not a valid index" -1)

&gt; (nth 3/4 '(1 2 3 4))
(lit error "{} is not an integer" 3/4)

&gt; (nth 4 '(1 2 3 4))
nil

&gt; (nth 5 '(1 2 3 4))
nil

&gt; (nth 50 nil)
nil
</pre>
</div>
</div>

<div id="outline-container-orga0dc269" class="outline-4">
<h4 id="orga0dc269"><span class="section-number-4">11.3.42.</span> <code>(macroexpand-1 x)</code></h4>
<div class="outline-text-4" id="text-11-3-42">
<p>
Expande uma  expressão quotada,  caso esta envolva  a aplicação  de um
<i>macro</i>.
</p>

<p>
Retorna o resultado  da aplicação da função associada ao  macro, o que
pode ser tanto uma expressão válida quanto um objeto de erro.
</p>

<pre class="example" id="orged34a6a">
&gt; (def m (mac (f x) (list f x)))
m

&gt; (macroexpand-1 '(m f 5))
(f 5)
</pre>

<p>
A expansão de um  macro deverá retornar um erro caso  a expansão em si
gere uma <i>função</i>  ao invés alguma outra forma, pois  <b>macros não admitem
aplicação parcial</b>.
</p>

<p>
Igualmente, caso a própria aplicação do  macro gere algum erro, o erro
deverá ser retornado.
</p>
</div>
</div>

<div id="outline-container-orgb215998" class="outline-4">
<h4 id="orgb215998"><span class="section-number-4">11.3.43.</span> <code>(not x)</code></h4>
<div class="outline-text-4" id="text-11-3-43">
<p>
Nega logicamente o argumento <code>x</code>.
</p>

<p>
De acordo  com as regras de  <i>verdade</i> de Majestic Lisp,  qualquer valor
diferente de <code>nil</code> será  considerado verdadeiro. Portanto, ao aplicarmos
esta  função a  qualquer valor  diferente de  <code>nil</code>, obteremos  <code>nil</code> como
resposta.
</p>

<p>
Pela mesma regra de <i>verdade</i>, ao  aplicarmos a função <code>not</code> ao valor <code>nil</code>,
obteremos necessariamente o símbolo <code>t</code>.
</p>

<pre class="example" id="org9db41ac">
&gt; (not 1)
nil

&gt; (not '(a b c))
nil

&gt; (not t)
nil

&gt; (not nil)
t
</pre>
</div>
</div>

<div id="outline-container-orgf2c7c6f" class="outline-4">
<h4 id="orgf2c7c6f"><span class="section-number-4">11.3.44.</span> <code>(gensym)</code></h4>
<div class="outline-text-4" id="text-11-3-44">
<p>
Gera um símbolo aleatório.
</p>

<p>
Os símbolos  têm uma representação textual  com o formato <code>:Gx</code>,  onde <code>x</code>
será um número  que, internamente, é gerado sem que  haja colisões com
outros símbolos.
</p>

<p>
Isso  classifica  a  função  <code>gensym</code> como  uma  função  necessariamente
impura, sendo portanto dependente de estado externo à mesma.
</p>

<pre class="example" id="org6218dd6">
&gt; (gensym)
:G88

&gt; (gensym)
:G89

&gt; (gensym)
:G90

&gt; (gensym)
:G91
</pre>
</div>
</div>
