A-especificacao.org
*** ~(terpri)~

Imprime uma nova linha no stream ~*stdout*~.

Uma possível implementação para ~terpri~ poderia ser:

#+begin_example
(defn terpri ()
  (write-char #\newline *stdout*))
#+end_example

A impressão da nova linha retorna um erro se não puder ser efetuada em
~*stdout*~. Caso contrário, a função sempre retorna ~nil~.

#+begin_example
> (terpri)
;
nil

> (let ((*stdout* (open-stream 'out "file.txt")))
    (close-stream *stdout*)
    (terpri))
(lit error "The stream {} is closed" #<stream (out) {...}>)
#+end_example

*** ~(display x)~

Imprime o  objeto ~x~ no  /stream/ ~*stdout*~.  A impressão *não  adiciona* um
caractere de fim de linha ao final da impressão, portanto, *o resultado
da execução pode aparecer junto à saída esperada*.

Para  adicionar um  terminador de  linha ao  final da  impressão, veja
~terpri~.

Uma possível implementação de ~display~ seria:

#+begin_example
(defn display (x)
  (write x *stdout*))
#+end_example

A  impressão do  objeto está  condicionada à  impressão de  objetos de
Majestic por parte do sistema.

Retorna um erro  se o objeto não puder ser  impresso em ~*stdout*~. Caso
contrário, a função sempre retorna ~nil~.

#+begin_example
> (display 'hello)
; hello
nil

> (do (display 'hello)
      (terpri))
; hello
;
nil

> (let ((x 2)
        (y 3))
    (display (+ x y))
    (terpri))
; 5
;
nil

> (let ((*stdout* (open-stream 'out "file.txt")))
    (close-stream *stdout*)
    (display 'a))
(lit error "Cannot write to closed stream")
#+end_example

*** TODO ~(pretty-display x)~

Imprime o objeto ~x~ no stream ~*stdout*~.

~pretty-display~ é exatamente igual a ~display~,  à exceção do fato de que
esta função tenta realizar /pretty printing/ da expressão em ~x~.

# Falta aqui alguns exemplos, mas não sem antes ajustar quais serão as
# regras  do pretty  printer, que  também deveria  ser especificado  à
# parte.

# Essa função pode se tornar inútil em breve.

*** ~(print fmt . rest)~

Imprime uma string formatada a partir  de ~fmt~ e dos argumentos em ~rest~
no /stream/  ~*stdout*~. O processo de  impressão *necessariamente adiciona
uma nova linha ao final do texto impresso*.

Uma possível implementação  para essa função em  Majestic Lisp poderia
ser:

#+begin_example
(defn print args
  (write-string
    (apply format args)
    *stdout*)
  (terpri))
#+end_example

Esta função retorna um erro caso  a formatação não possa ser feita, 

#+begin_example
> (print "My name is {}" 'Someone)
; My name is Someone
;
nil

> (print "{} + {} = {}"
         2
         3
         (+ 2 3))
; 2 + 3 = 5
;
nil

> (print "Hello {}")
(lit error "Missing arguments on format")

> (let ((*stdout* (open-stream 'out "file.txt")))
    (close-stream *stdout*)
    (print "Hello {}" 'World))
(lit error "Cannot write to closed stream")
#+end_example

*** ~(load path)~

Carrega o código do arquivo existente no caminho ~path~, interpretando-o
logo em seguida.

Caso o caminho não possa ser aberto, retorna um objeto de erro.

Espera-se que  o arquivo  em questão  constitua-se de  código Majestic
Lisp válido. Caso alguma das  formas textualmente descritas no arquivo
falhe   em  sua   interpretação,  tal   processo  será   imediatamente
interrompido, e o erro relacionado será retornado.

Do contrário,  a função retornará o  mesmo valor de retorno  da última
expressão interpretada no arquivo.

O exemplo  a seguir  assume a  execução em um  sistema Unix,  apenas a
título de exemplo.

Suponha-se o arquivo ~test.maj~ com conteúdo:

#+begin_example
(defn foo (x)
  (+ x 2))

(defn bar ()
  (foo 5))
#+end_example

Pode-se, portanto, considerar o seguinte uso de tal arquivo:

#+begin_example
> (load "test.maj")
bar

> (foo 7)
9

> (bar)
7
#+end_example

De forma similar, erros serão emitidos quando um arquivo não existir.

#+begin_example
> (load "blah.maj")
(lit error "While reading file {}: Cannot open file" "blah.maj")
#+end_example

*** ~(equal x y)~

Informa  se  ~x~  e ~y~  são  iguais.  A  igualdade  tratada por  ~equal~  é
inerentemente mais  permissiva, e procurará realizar  comparação entre
os elementos de acordo com o  tipo dos mesmos, quando tais tipos forem
iguais.  Ademais,  ~equal~  realizará comparações  recursivas  entre  os
elementos de coleções.

A função ~equal~ é executada de forma a ser o mais permissiva quanto for
possível. Isso significa que ~equal~ não retorna erros relacionados aos
tipos  de ~x~  e  ~y~, e  será  capaz de  comparar  estes dois  argumentos
independentemente de seus tipos.

A  função ~equal~  pode ser  implementada em  Majestic Lisp  da seguinte
forma:

#+begin_example
(defn equal (x y)
  (cond ((and (numberp x) (numberp y))
         (= x y))
        ((and (vectorp x) (vectorp y))
         (vector= x y))
        ((and (symbolp x) (symbolp y))
         (eq x y))
        ((and (consp x) (consp y))
         (when (equal (car x) (car y))
           (equal (cdr x) (cdr y))))
        ((and (atomp x) (atomp y))
         (id x y))
        (t nil)))
#+end_example

Como é  possível notar, ~x~  e ~y~ podem  ser quaisquer tipos  de valores;
quando  forem  coleções  (como  listas ou  vetores),  ~equal~  realizará
comparações recursivamente entre seus elementos.

Caso   os  dois   parâmetros  sejam   iguais,  segundo   os  critérios
estabelecidos, retorna ~t~. Caso contrário, retorna ~nil~.

#+begin_example
> (equal 0.5 1/2)
t

> (equal [1 2 3] [1 2 3])
t

> (equal 'a 'b)
nil

> (equal '(a b c) '(a b c))
t

> (equal #\F #\F)
t

> (equal *stdin* *stdin*)
t

> (equal *stdin* *stdout*)
nil

> (equal 20 'a)
nil

> (equal *stdout* '(a b c))
nil

> (equal [6 5] '(6 5))
nil

> (equal "Teste" "Teste")
t
#+end_example

** Funções para vetores
*** ~(vector . rest)~

Cria um vetor de objetos.

O tipo do vetor está relacionado aos tipos dos elementos fornecidos em
~rest~:

1. Se ~rest~ é ~nil~, então será retornado um vetor vazio de tipo ~any~;
2. Se ~rest~ possui elementos de tipos variados, então será retornado um
   vetor de tipo ~any~ com os elementos fornecidos em sequência;
3. Se  ~rest~ possui apenas elementos  de tipos ~integer~, ~float~  ou ~char~,
   então  será retornado  um vetor  com tipo  igual ao  dos elementos,
   populado pelos mesmos elementos fornecidos em sequência.

#+begin_example
> (vector)
[]

> (vec-type (vector))
any

> (vector 1 2 3 4)
[1 2 3 4]

> (vec-type (vector 1 2 3 4))
integer

> (vector 1. 3. 2.5)
[1.0 3.0 2.5]

> (vec-type (vector 1. 3. 2.5))
float

> (vector #\H #\e #\l #\l #\o)
"Hello"

> (vec-type (vector #\H #\e #\l #\l #\o))
char

> (vector 1. 3 2/5 2j6 'blah)
[1.0 3 2/5 2J6 blah]

> (vec-type (vector 1. 3 2/5 2j6 'blah))
any
#+end_example

