A-especificacao.html

<div id="outline-container-org2c9db82" class="outline-4">
<h4 id="org2c9db82"><span class="section-number-4">11.3.45.</span> <code>(terpri)</code></h4>
<div class="outline-text-4" id="text-11-3-45">
<p>
Imprime uma nova linha no stream <code>*stdout*</code>.
</p>

<p>
Uma possível implementação para <code>terpri</code> poderia ser:
</p>

<pre class="example" id="org6dae1ea">
(defn terpri ()
  (write-char #\newline *stdout*))
</pre>

<p>
A impressão da nova linha retorna um erro se não puder ser efetuada em
<code>*stdout*</code>. Caso contrário, a função sempre retorna <code>nil</code>.
</p>

<pre class="example" id="org21cbf5b">
&gt; (terpri)
;
nil

&gt; (let ((*stdout* (open-stream 'out "file.txt")))
    (close-stream *stdout*)
    (terpri))
(lit error "The stream {} is closed" #&lt;stream (out) {...}&gt;)
</pre>
</div>
</div>

<div id="outline-container-orgcc46024" class="outline-4">
<h4 id="orgcc46024"><span class="section-number-4">11.3.46.</span> <code>(display x)</code></h4>
<div class="outline-text-4" id="text-11-3-46">
<p>
Imprime o  objeto <code>x</code> no  <i>stream</i> <code>*stdout*</code>.  A impressão <b>não  adiciona</b> um
caractere de fim de linha ao final da impressão, portanto, <b>o resultado
da execução pode aparecer junto à saída esperada</b>.
</p>

<p>
Para  adicionar um  terminador de  linha ao  final da  impressão, veja
<code>terpri</code>.
</p>

<p>
Uma possível implementação de <code>display</code> seria:
</p>

<pre class="example" id="orgf429269">
(defn display (x)
  (write x *stdout*))
</pre>

<p>
A  impressão do  objeto está  condicionada à  impressão de  objetos de
Majestic por parte do sistema.
</p>

<p>
Retorna um erro  se o objeto não puder ser  impresso em <code>*stdout*</code>. Caso
contrário, a função sempre retorna <code>nil</code>.
</p>

<pre class="example" id="orgb76396a">
&gt; (display 'hello)
; hello
nil

&gt; (do (display 'hello)
      (terpri))
; hello
;
nil

&gt; (let ((x 2)
        (y 3))
    (display (+ x y))
    (terpri))
; 5
;
nil

&gt; (let ((*stdout* (open-stream 'out "file.txt")))
    (close-stream *stdout*)
    (display 'a))
(lit error "Cannot write to closed stream")
</pre>
</div>
</div>

<div id="outline-container-org7d9f96a" class="outline-4">
<h4 id="org7d9f96a"><span class="section-number-4">11.3.47.</span> <span class="todo TODO">TODO</span> <code>(pretty-display x)</code></h4>
<div class="outline-text-4" id="text-11-3-47">
<p>
Imprime o objeto <code>x</code> no stream <code>*stdout*</code>.
</p>

<p>
<code>pretty-display</code> é exatamente igual a <code>display</code>,  à exceção do fato de que
esta função tenta realizar <i>pretty printing</i> da expressão em <code>x</code>.
</p>
</div>
</div>

<div id="outline-container-orgdb64f9b" class="outline-4">
<h4 id="orgdb64f9b"><span class="section-number-4">11.3.48.</span> <code>(print fmt . rest)</code></h4>
<div class="outline-text-4" id="text-11-3-48">
<p>
Imprime uma string formatada a partir  de <code>fmt</code> e dos argumentos em <code>rest</code>
no <i>stream</i>  <code>*stdout*</code>. O processo de  impressão <b>necessariamente adiciona
uma nova linha ao final do texto impresso</b>.
</p>

<p>
Uma possível implementação  para essa função em  Majestic Lisp poderia
ser:
</p>

<pre class="example" id="org94712b2">
(defn print args
  (write-string
    (apply format args)
    *stdout*)
  (terpri))
</pre>

<p>
Esta função retorna um erro caso  a formatação não possa ser feita, 
</p>

<pre class="example" id="org7304948">
&gt; (print "My name is {}" 'Someone)
; My name is Someone
;
nil

&gt; (print "{} + {} = {}"
         2
         3
         (+ 2 3))
; 2 + 3 = 5
;
nil

&gt; (print "Hello {}")
(lit error "Missing arguments on format")

&gt; (let ((*stdout* (open-stream 'out "file.txt")))
    (close-stream *stdout*)
    (print "Hello {}" 'World))
(lit error "Cannot write to closed stream")
</pre>
</div>
</div>

<div id="outline-container-org0d0ce2f" class="outline-4">
<h4 id="org0d0ce2f"><span class="section-number-4">11.3.49.</span> <code>(load path)</code></h4>
<div class="outline-text-4" id="text-11-3-49">
<p>
Carrega o código do arquivo existente no caminho <code>path</code>, interpretando-o
logo em seguida.
</p>

<p>
Caso o caminho não possa ser aberto, retorna um objeto de erro.
</p>

<p>
Espera-se que  o arquivo  em questão  constitua-se de  código Majestic
Lisp válido. Caso alguma das  formas textualmente descritas no arquivo
falhe   em  sua   interpretação,  tal   processo  será   imediatamente
interrompido, e o erro relacionado será retornado.
</p>

<p>
Do contrário,  a função retornará o  mesmo valor de retorno  da última
expressão interpretada no arquivo.
</p>

<p>
O exemplo  a seguir  assume a  execução em um  sistema Unix,  apenas a
título de exemplo.
</p>

<p>
Suponha-se o arquivo <code>test.maj</code> com conteúdo:
</p>

<pre class="example" id="org0b679f9">
(defn foo (x)
  (+ x 2))

(defn bar ()
  (foo 5))
</pre>

<p>
Pode-se, portanto, considerar o seguinte uso de tal arquivo:
</p>

<pre class="example" id="org85a41f9">
&gt; (load "test.maj")
bar

&gt; (foo 7)
9

&gt; (bar)
7
</pre>

<p>
De forma similar, erros serão emitidos quando um arquivo não existir.
</p>

<pre class="example" id="org3e379a3">
&gt; (load "blah.maj")
(lit error "While reading file {}: Cannot open file" "blah.maj")
</pre>
</div>
</div>

<div id="outline-container-orgfb71f3e" class="outline-4">
<h4 id="orgfb71f3e"><span class="section-number-4">11.3.50.</span> <code>(equal x y)</code></h4>
<div class="outline-text-4" id="text-11-3-50">
<p>
Informa  se  <code>x</code>  e <code>y</code>  são  iguais.  A  igualdade  tratada por  <code>equal</code>  é
inerentemente mais  permissiva, e procurará realizar  comparação entre
os elementos de acordo com o  tipo dos mesmos, quando tais tipos forem
iguais.  Ademais,  <code>equal</code>  realizará comparações  recursivas  entre  os
elementos de coleções.
</p>

<p>
A função <code>equal</code> é executada de forma a ser o mais permissiva quanto for
possível. Isso significa que <code>equal</code> não retorna erros relacionados aos
tipos  de <code>x</code>  e  <code>y</code>, e  será  capaz de  comparar  estes dois  argumentos
independentemente de seus tipos.
</p>

<p>
A  função <code>equal</code>  pode ser  implementada em  Majestic Lisp  da seguinte
forma:
</p>

<pre class="example" id="org876a749">
(defn equal (x y)
  (cond ((and (numberp x) (numberp y))
         (= x y))
        ((and (vectorp x) (vectorp y))
         (vector= x y))
        ((and (symbolp x) (symbolp y))
         (eq x y))
        ((and (consp x) (consp y))
         (when (equal (car x) (car y))
           (equal (cdr x) (cdr y))))
        ((and (atomp x) (atomp y))
         (id x y))
        (t nil)))
</pre>

<p>
Como é  possível notar, <code>x</code>  e <code>y</code> podem  ser quaisquer tipos  de valores;
quando  forem  coleções  (como  listas ou  vetores),  <code>equal</code>  realizará
comparações recursivamente entre seus elementos.
</p>

<p>
Caso   os  dois   parâmetros  sejam   iguais,  segundo   os  critérios
estabelecidos, retorna <code>t</code>. Caso contrário, retorna <code>nil</code>.
</p>

<pre class="example" id="org13de433">
&gt; (equal 0.5 1/2)
t

&gt; (equal [1 2 3] [1 2 3])
t

&gt; (equal 'a 'b)
nil

&gt; (equal '(a b c) '(a b c))
t

&gt; (equal #\F #\F)
t

&gt; (equal *stdin* *stdin*)
t

&gt; (equal *stdin* *stdout*)
nil

&gt; (equal 20 'a)
nil

&gt; (equal *stdout* '(a b c))
nil

&gt; (equal [6 5] '(6 5))
nil

&gt; (equal "Teste" "Teste")
t
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcf94c15" class="outline-3">
<h3 id="orgcf94c15"><span class="section-number-3">11.4.</span> Funções para vetores</h3>
<div class="outline-text-3" id="text-11-4">
</div>
<div id="outline-container-org5edfd85" class="outline-4">
<h4 id="org5edfd85"><span class="section-number-4">11.4.1.</span> <code>(vector . rest)</code></h4>
<div class="outline-text-4" id="text-11-4-1">
<p>
Cria um vetor de objetos.
</p>

<p>
O tipo do vetor está relacionado aos tipos dos elementos fornecidos em
<code>rest</code>:
</p>

<ol class="org-ol">
<li>Se <code>rest</code> é <code>nil</code>, então será retornado um vetor vazio de tipo <code>any</code>;</li>
<li>Se <code>rest</code> possui elementos de tipos variados, então será retornado um
vetor de tipo <code>any</code> com os elementos fornecidos em sequência;</li>
<li>Se  <code>rest</code> possui apenas elementos  de tipos <code>integer</code>, <code>float</code>  ou <code>char</code>,
então  será retornado  um vetor  com tipo  igual ao  dos elementos,
populado pelos mesmos elementos fornecidos em sequência.</li>
</ol>

<pre class="example" id="org57a9488">
&gt; (vector)
[]

&gt; (vec-type (vector))
any

&gt; (vector 1 2 3 4)
[1 2 3 4]

&gt; (vec-type (vector 1 2 3 4))
integer

&gt; (vector 1. 3. 2.5)
[1.0 3.0 2.5]

&gt; (vec-type (vector 1. 3. 2.5))
float

&gt; (vector #\H #\e #\l #\l #\o)
"Hello"

&gt; (vec-type (vector #\H #\e #\l #\l #\o))
char

&gt; (vector 1. 3 2/5 2j6 'blah)
[1.0 3 2/5 2J6 blah]

&gt; (vec-type (vector 1. 3 2/5 2j6 'blah))
any
</pre>
</div>
</div>
