A-especificacao.org
*** ~(vec-type vec)~

Retorna o tipo de um vetor. Caso o objeto fornecido não seja um vetor,
será retornado um erro.

Em  circunstâncias normais,  será  retornado um  dos símbolo  ~integer~,
~float~, ~char~ ou ~any~.

#+begin_example
> (vec-type [])
any

> (vec-type [1 2 3 4])
integer

> (vec-type [1. 3. 2.5])
float

> (vec-type "Hello")
char

> (vec-type [1. 3 2/5 2j6 'blah])
any

> (vec-type 2)
(lit error "{} is not a vector" 2)
#+end_example

*** ~(vec-coerce type vec)~

Tenta converter o  tipo de um vetor  ~vec~ para o tipo  ~type~, que deverá
ser um dos símbolos ~integer~, ~float~, ~char~ ou ~any~.

O vetor original não será alterado, e será retornado um novo vetor com
o novo tipo.

A conversão  segue as regras de  coerção entre vetores. Assim,  caso a
coerção individual  de um  elemento falhe,  a coerção  do vetor  em si
falhará.

Caso  ~vec~ não  seja um  vetor, caso  ~type~ não  seja um  símbolo --  em
especial, caso não seja um  dos símbolos permitidos --, será retornado
um erro.

#+begin_example
> (let ((v []))
    (vec-push v 2)
    (vec-push v 3)
    (print "Vector: {}" v)
    (print "Vector type: {}" (vec-type v))
    (set v (vec-coerce 'integer v))
    (print "Vector type: {}" (vec-type v)))
; Vector: [2 3]
; Vector type: any
; Vector type: integer
;
nil

> (vec-coerce 'any "Hello")
[#\H #\e #\l #\l #\o]
#+end_example

*** ~(vec-push x vec)~

Insere um novo elemento ~x~ ao final do vetor ~vec~. O vetor original será
alterado  durante essa  operação.  Portanto,  ~vec-push~ *é  uma operação
destrutiva*.

Uma possível implementação para ~vec-push~ poderia ser:

#+begin_example
(defn vec-push (x vec)
  (vec-insert vec
              (vec-length vec)
              x))
#+end_example

Para que essa operação funcione, ~vec~ precisa ser um vetor, e ~x~ precisa
ser  um elemento  cujo tipo  seja compatível  com o  tipo do  vetor em
questão. Por exemplo, vetores de tipo ~integer~, ~float~ e ~char~ só aceitam
novos elementos de  tais tipos; vetores de tipo  ~any~ aceitam quaisquer
tipos de elementos.

Caso os parâmetros não possuam os  tipos e valores esperados, a função
retornará  erros. Em  caso de  sucesso, será  retornado o  mesmo vetor
original, após a sua modificação.

#+begin_example
> (def v (vec-coerce 'integer []))
v

> (vec-push 5 v)
[5]

> (vec-push 6 v)
[5 6]

> (vec-push 'a v)
(lit error "{} has type {}, which is incompatible with pushing to vector of type {}" a symbol integer)

> (let ((myvec []))
    (mapc (fn (x) (vec-push x myvec)) '(5 6 a 2/3))
    myvec)
[5 6 a 2/3]
#+end_example

*** ~(vec-set pos x vec)~

Redefine um  elemento de  ~vec~ na posição  ~pos~ para o  novo valor  ~x~. O
vetor original será alterado  durante essa operação. Portanto, ~vec-set~
*é uma operação destrutiva*.

Para que essa operação funcione, ~vec~ precisa ser um vetor, e ~x~ precisa
ser  um elemento  cujo tipo  seja compatível  com o  tipo do  vetor em
questão. Por exemplo, vetores de tipo ~integer~, ~float~ e ~char~ só aceitam
novos elementos de  tais tipos; vetores de tipo  ~any~ aceitam quaisquer
tipos de elementos.

Ademais, ~pos~  precisa ser um número  inteiro maior ou igual  a zero, e
menor que  o tamanho do vetor  em questão. Por exemplo,  para um vetor
com  tamanho  ~6~,  serão  admitidos  valores no  intervalo  de  ~0~  a  ~5~
inclusive.

Caso os parâmetros não possuam os  tipos e valores esperados, a função
retornará  erros. Em  caso de  sucesso, será  retornado o  mesmo vetor
original, após a sua modificação.

#+begin_example
> (def v [1 2 3 4 5])
v

> (vec-type v)
integer

> (vec-set 2 50 v)
[1 2 50 4 5]

> (vec-set 4 10 v)
[1 2 50 4 10]

> (vec-set 5 90 v)
(lit error "Index {} is out of bounds in {}" 5 [11 2 50 4 10])
#+end_example

*** ~(vec-pop vec)~

Remove  um elemento  na última  posição de  ~vec~ e  o retorna.  O vetor
original será alterado durante essa  operação. Portanto, ~vec-pop~ *é uma
operação destrutiva*.

Uma possível implementação para ~vec-pop~ poderia ser:

#+begin_example
(defn vec-pop (vec)
  (let ((len (vec-length vec)))
    (unless (zerop len)
      (vec-remove vec (1- len)))))
#+end_example

Para que essa operação funcione, ~vec~  precisa ser um vetor. Caso não o
seja, a função retornará um erro.

Se  não  houver  mais  elementos  a serem  retirados  do  vetor,  será
retornado ~nil~.

#+begin_example
> (def vec [1 2 3])
vec

> (while (> (vec-length vec) 0)
    (print "{}" (vec-pop vec)))
; 3
; 2
; 1
;
nil

> (vec-pop vec)
nil

> vec
[]

> (vec-pop 2/3)
(lit error "{} is not a vector" 2/3)
#+end_example

*** ~(vec-deq vec)~

Remove um  elemento na primeira  posição de ~vec~  e o retorna.  O vetor
original será alterado  durante essa operação. Portanto  ~vec-deq~ *é uma
operação destrutiva*.

Para que essa operação funcione, ~vec~  precisa ser um vetor. Caso não o
seja, a função retornará um erro.

Se  não  houver  mais  elementos  a serem  retirados  do  vetor,  será
retornado ~nil~.

#+begin_example
> (def vec (apply vector (iota 3)))
vec

> vec
[0 1 2]

> (until (zerop (vec-length vec))
    (print "{}" (vec-deq vec)))
; 0
; 1
; 2
;
nil

> (vec-deq vec)
nil

> vec
[]

> (vec-deq 2/3)
(lit error "{} is not a vector" 2/3)
#+end_example

*** ~(vec-length vec)~

Retorna  a quantidade  de elementos  do  vetor. A  quantidade será  um
número inteiro maior ou igual a zero.

Caso o objeto informado não seja um vetor, será retornado um erro.

#+begin_example
> (vec-length [])
0

> (vec-length [1 2 3 4])
4

> (vec-length (apply vector (reverse (iota 50))))
50

> (vec-length *stdin*)
(lit error "{} is not a vector" #<stream (in) {...}>)
#+end_example

*** ~(vec-at pos vec)~

Retorna um valor numa posição específica do vetor.

~pos~ deve ser um valor maior ou igual  a ~0~, e menor que a quantidade de
elementos  do vetor.  Assim, um  vetor  de cinco  elementos permite  a
recuperação  de  valores nas  posições  entre  ~0~  e ~4~  inclusive,  por
exemplo.

Se  ~vec~ não  for um  vetor ou  ~pos~ não  for um  número inteiro,  serão
retornados  erros. Igualmente,  se  ~pos~ não  estiver  no intervalo  de
valores admitido, será também retornado um erro.

#+begin_example
> (vec-at 1 [1 2 3])
2

> (vec-at 0 "Hello")
#\H

> (vec-at 5 "Hello")
(lit error "Index {} is out of bounds in {}" 5 "Hello")

> (vec-at 5 '(1 2 3))
(lit error "{} is not a vector" (1 2 3))
#+end_example

