A-especificacao.html

<div id="outline-container-org54f5896" class="outline-4">
<h4 id="org54f5896"><span class="section-number-4">11.4.2.</span> <code>(vec-type vec)</code></h4>
<div class="outline-text-4" id="text-11-4-2">
<p>
Retorna o tipo de um vetor. Caso o objeto fornecido não seja um vetor,
será retornado um erro.
</p>

<p>
Em  circunstâncias normais,  será  retornado um  dos símbolo  <code>integer</code>,
<code>float</code>, <code>char</code> ou <code>any</code>.
</p>

<pre class="example" id="org96d71a8">
&gt; (vec-type [])
any

&gt; (vec-type [1 2 3 4])
integer

&gt; (vec-type [1. 3. 2.5])
float

&gt; (vec-type "Hello")
char

&gt; (vec-type [1. 3 2/5 2j6 'blah])
any

&gt; (vec-type 2)
(lit error "{} is not a vector" 2)
</pre>
</div>
</div>

<div id="outline-container-org0905ffa" class="outline-4">
<h4 id="org0905ffa"><span class="section-number-4">11.4.3.</span> <code>(vec-coerce type vec)</code></h4>
<div class="outline-text-4" id="text-11-4-3">
<p>
Tenta converter o  tipo de um vetor  <code>vec</code> para o tipo  <code>type</code>, que deverá
ser um dos símbolos <code>integer</code>, <code>float</code>, <code>char</code> ou <code>any</code>.
</p>

<p>
O vetor original não será alterado, e será retornado um novo vetor com
o novo tipo.
</p>

<p>
A conversão  segue as regras de  coerção entre vetores. Assim,  caso a
coerção individual  de um  elemento falhe,  a coerção  do vetor  em si
falhará.
</p>

<p>
Caso  <code>vec</code> não  seja um  vetor, caso  <code>type</code> não  seja um  símbolo &#x2013;  em
especial, caso não seja um  dos símbolos permitidos &#x2013;, será retornado
um erro.
</p>

<pre class="example" id="orgf7e4440">
&gt; (let ((v []))
    (vec-push v 2)
    (vec-push v 3)
    (print "Vector: {}" v)
    (print "Vector type: {}" (vec-type v))
    (set v (vec-coerce 'integer v))
    (print "Vector type: {}" (vec-type v)))
; Vector: [2 3]
; Vector type: any
; Vector type: integer
;
nil

&gt; (vec-coerce 'any "Hello")
[#\H #\e #\l #\l #\o]
</pre>
</div>
</div>

<div id="outline-container-org06a8caf" class="outline-4">
<h4 id="org06a8caf"><span class="section-number-4">11.4.4.</span> <code>(vec-push x vec)</code></h4>
<div class="outline-text-4" id="text-11-4-4">
<p>
Insere um novo elemento <code>x</code> ao final do vetor <code>vec</code>. O vetor original será
alterado  durante essa  operação.  Portanto,  <code>vec-push</code> <b>é  uma operação
destrutiva</b>.
</p>

<p>
Uma possível implementação para <code>vec-push</code> poderia ser:
</p>

<pre class="example" id="orgbc67e77">
(defn vec-push (x vec)
  (vec-insert vec
              (vec-length vec)
              x))
</pre>

<p>
Para que essa operação funcione, <code>vec</code> precisa ser um vetor, e <code>x</code> precisa
ser  um elemento  cujo tipo  seja compatível  com o  tipo do  vetor em
questão. Por exemplo, vetores de tipo <code>integer</code>, <code>float</code> e <code>char</code> só aceitam
novos elementos de  tais tipos; vetores de tipo  <code>any</code> aceitam quaisquer
tipos de elementos.
</p>

<p>
Caso os parâmetros não possuam os  tipos e valores esperados, a função
retornará  erros. Em  caso de  sucesso, será  retornado o  mesmo vetor
original, após a sua modificação.
</p>

<pre class="example" id="orgd554cca">
&gt; (def v (vec-coerce 'integer []))
v

&gt; (vec-push 5 v)
[5]

&gt; (vec-push 6 v)
[5 6]

&gt; (vec-push 'a v)
(lit error "{} has type {}, which is incompatible with pushing to vector of type {}" a symbol integer)

&gt; (let ((myvec []))
    (mapc (fn (x) (vec-push x myvec)) '(5 6 a 2/3))
    myvec)
[5 6 a 2/3]
</pre>
</div>
</div>

<div id="outline-container-orgd0c7eec" class="outline-4">
<h4 id="orgd0c7eec"><span class="section-number-4">11.4.5.</span> <code>(vec-set pos x vec)</code></h4>
<div class="outline-text-4" id="text-11-4-5">
<p>
Redefine um  elemento de  <code>vec</code> na posição  <code>pos</code> para o  novo valor  <code>x</code>. O
vetor original será alterado  durante essa operação. Portanto, <code>vec-set</code>
<b>é uma operação destrutiva</b>.
</p>

<p>
Para que essa operação funcione, <code>vec</code> precisa ser um vetor, e <code>x</code> precisa
ser  um elemento  cujo tipo  seja compatível  com o  tipo do  vetor em
questão. Por exemplo, vetores de tipo <code>integer</code>, <code>float</code> e <code>char</code> só aceitam
novos elementos de  tais tipos; vetores de tipo  <code>any</code> aceitam quaisquer
tipos de elementos.
</p>

<p>
Ademais, <code>pos</code>  precisa ser um número  inteiro maior ou igual  a zero, e
menor que  o tamanho do vetor  em questão. Por exemplo,  para um vetor
com  tamanho  <code>6</code>,  serão  admitidos  valores no  intervalo  de  <code>0</code>  a  <code>5</code>
inclusive.
</p>

<p>
Caso os parâmetros não possuam os  tipos e valores esperados, a função
retornará  erros. Em  caso de  sucesso, será  retornado o  mesmo vetor
original, após a sua modificação.
</p>

<pre class="example" id="orgc78be62">
&gt; (def v [1 2 3 4 5])
v

&gt; (vec-type v)
integer

&gt; (vec-set 2 50 v)
[1 2 50 4 5]

&gt; (vec-set 4 10 v)
[1 2 50 4 10]

&gt; (vec-set 5 90 v)
(lit error "Index {} is out of bounds in {}" 5 [11 2 50 4 10])
</pre>
</div>
</div>

<div id="outline-container-org45ac863" class="outline-4">
<h4 id="org45ac863"><span class="section-number-4">11.4.6.</span> <code>(vec-pop vec)</code></h4>
<div class="outline-text-4" id="text-11-4-6">
<p>
Remove  um elemento  na última  posição de  <code>vec</code> e  o retorna.  O vetor
original será alterado durante essa  operação. Portanto, <code>vec-pop</code> <b>é uma
operação destrutiva</b>.
</p>

<p>
Uma possível implementação para <code>vec-pop</code> poderia ser:
</p>

<pre class="example" id="orgd00104a">
(defn vec-pop (vec)
  (let ((len (vec-length vec)))
    (unless (zerop len)
      (vec-remove vec (1- len)))))
</pre>

<p>
Para que essa operação funcione, <code>vec</code>  precisa ser um vetor. Caso não o
seja, a função retornará um erro.
</p>

<p>
Se  não  houver  mais  elementos  a serem  retirados  do  vetor,  será
retornado <code>nil</code>.
</p>

<pre class="example" id="org19ad257">
&gt; (def vec [1 2 3])
vec

&gt; (while (&gt; (vec-length vec) 0)
    (print "{}" (vec-pop vec)))
; 3
; 2
; 1
;
nil

&gt; (vec-pop vec)
nil

&gt; vec
[]

&gt; (vec-pop 2/3)
(lit error "{} is not a vector" 2/3)
</pre>
</div>
</div>

<div id="outline-container-orgd682da6" class="outline-4">
<h4 id="orgd682da6"><span class="section-number-4">11.4.7.</span> <code>(vec-deq vec)</code></h4>
<div class="outline-text-4" id="text-11-4-7">
<p>
Remove um  elemento na primeira  posição de <code>vec</code>  e o retorna.  O vetor
original será alterado  durante essa operação. Portanto  <code>vec-deq</code> <b>é uma
operação destrutiva</b>.
</p>

<p>
Para que essa operação funcione, <code>vec</code>  precisa ser um vetor. Caso não o
seja, a função retornará um erro.
</p>

<p>
Se  não  houver  mais  elementos  a serem  retirados  do  vetor,  será
retornado <code>nil</code>.
</p>

<pre class="example" id="org87398ea">
&gt; (def vec (apply vector (iota 3)))
vec

&gt; vec
[0 1 2]

&gt; (until (zerop (vec-length vec))
    (print "{}" (vec-deq vec)))
; 0
; 1
; 2
;
nil

&gt; (vec-deq vec)
nil

&gt; vec
[]

&gt; (vec-deq 2/3)
(lit error "{} is not a vector" 2/3)
</pre>
</div>
</div>

<div id="outline-container-orgafbc6dd" class="outline-4">
<h4 id="orgafbc6dd"><span class="section-number-4">11.4.8.</span> <code>(vec-length vec)</code></h4>
<div class="outline-text-4" id="text-11-4-8">
<p>
Retorna  a quantidade  de elementos  do  vetor. A  quantidade será  um
número inteiro maior ou igual a zero.
</p>

<p>
Caso o objeto informado não seja um vetor, será retornado um erro.
</p>

<pre class="example" id="org6642c55">
&gt; (vec-length [])
0

&gt; (vec-length [1 2 3 4])
4

&gt; (vec-length (apply vector (reverse (iota 50))))
50

&gt; (vec-length *stdin*)
(lit error "{} is not a vector" #&lt;stream (in) {...}&gt;)
</pre>
</div>
</div>

<div id="outline-container-orgb7aa2db" class="outline-4">
<h4 id="orgb7aa2db"><span class="section-number-4">11.4.9.</span> <code>(vec-at pos vec)</code></h4>
<div class="outline-text-4" id="text-11-4-9">
<p>
Retorna um valor numa posição específica do vetor.
</p>

<p>
<code>pos</code> deve ser um valor maior ou igual  a <code>0</code>, e menor que a quantidade de
elementos  do vetor.  Assim, um  vetor  de cinco  elementos permite  a
recuperação  de  valores nas  posições  entre  <code>0</code>  e <code>4</code>  inclusive,  por
exemplo.
</p>

<p>
Se  <code>vec</code> não  for um  vetor ou  <code>pos</code> não  for um  número inteiro,  serão
retornados  erros. Igualmente,  se  <code>pos</code> não  estiver  no intervalo  de
valores admitido, será também retornado um erro.
</p>

<pre class="example" id="org2ce1f74">
&gt; (vec-at 1 [1 2 3])
2

&gt; (vec-at 0 "Hello")
#\H

&gt; (vec-at 5 "Hello")
(lit error "Index {} is out of bounds in {}" 5 "Hello")

&gt; (vec-at 5 '(1 2 3))
(lit error "{} is not a vector" (1 2 3))
</pre>
</div>
</div>
