A-especificacao.org
*** ~(vec-remove pos vec)~

Remove um elemento na posição ~pos~ de ~vec~ e o retorna. O vetor original
será  alterado  durante essa  operação.   Portanto,  ~vec-remove~ *é  uma
operação destrutiva*.

Para  que essa  operação funcione,  ~vec~ precisa  ser um  vetor, e  ~pos~
precisa ser um número inteiro positivo, maior ou igual a ~0~ e menor que
o tamanho de ~vec~. Caso contrário, a função retornará erros.

O elemento removido será então retornado pela função.

#+begin_example
> (def vec [1 2 3 4 5])
vec

> (vec-remove 2 vec)
3

> (vec-remove 2 vec)
4

> vec
[1 2 5]

> (vec-remove 2 vec)
5

> (vec-remove 2 vec)
(lit error "Index {} is out of bounds in {}" [1 2])

> (vec-remove 0 2)
(lit error "{} is not a vector" 2)
#+end_example

*** ~(vec-insert pos x vec)~

Insere  um novo  elemento  ~x~ na  posição  ~pos~ do  vetor  ~vec~. O  vetor
original será  alterado durante essa operação.  Portanto, ~vec-insert~ *é
uma operação destrutiva*.

Para que essa  operação funcione, ~vec~ precisa ser um  vetor, ~x~ precisa
ser  um elemento  cujo tipo  seja compatível  com o  tipo do  vetor em
questão, e  ~pos~ precisa  ser um número  inteiro de valor  entre ~0~  e o
tamanho do vetor ~vec~.

Por exemplo,  vetores de tipo ~integer~,  ~float~ e ~char~ só  aceitam novos
elementos de tais  tipos; vetores de tipo ~any~  aceitam quaisquer tipos
de elementos.

No caso de ~pos~, para um  vetor de ~n~ elementos, serão admitidos valores
de ~0~  a ~n~ inclusive.  Uma inserção  na posição ~n~  é similar ao  uso de
~vec-push~.

Caso os parâmetros não possuam os  tipos e valores esperados, a função
retornará  erros. Em  caso de  sucesso, será  retornado o  mesmo vetor
original, após a sua modificação.

#+begin_example
> (def v [1 2 3])
v

> v
[1 2 3]

> (vec-insert 3 5 v)
[1 2 3 5]

> (vec-insert 0 5 v)
[5 1 2 3 5]

> (vec-insert 0 5 v)
[5 5 1 2 3 5]

> (vec-insert 0 5 v)
[5 5 5 1 2 3 5]

> (vec-insert 1 7 v)
[5 7 5 5 1 2 3 5]

> (vec-insert 3 8 v)
[5 7 5 8 5 1 2 3 5]

> (vec-insert 20 8 [1 2 3])
(lit error "Index {} is out of bounds in {}" 20 [1 2 3])

> (vec-insert 2 'a [1 2 3])
(lit error "{} has type {}, which is incompatible with insertion on vector of type {}" a symbol integer)
#+end_example

*** ~(vector= va vb)~

Verifica se ~va~ e ~vb~ são vetores iguais.

Vetores iguais são aqueles que possuem mesmo subtipo, mesmo tamanho, e
elementos iguais. A igualdade de  elementos entre vetores é verificada
com auxílio da função ~equal~,  que pode ser temporariamente substituída
com a utilização de escopo dinâmico.

Uma possível implementação de ~vector=~ pode ser:

#+begin_example
(defn vector= (va vb)
  (when (eq (vec-type va) (vec-type vb))
    (let* ((len (vec-length va))
           (i 0)
           (continue t))
      (when (= len (vec-length vb))
        (while (and (< i len) continue)
          (unless (equal (vec-at va i)
                         (vec-at vb i))
            (set continue nil))
          (set i (1+ i)))
        continue))))
#+end_example

Caso ~va~ e ~vb~ sejam iguais,  retorna ~t~. Caso contrário, retorna ~nil~. Se
~va~ ou ~vb~ não forem vetores, será retornado um erro.

#+begin_example
> (vector= [1 2 3] [1 2 3])
t

> (let ((v [5 6 7 8]))
    (vector= v [5 6 7 8]))
t

> (vector= [1 2] [3 4 5])
nil

> (vector= "Hello" "Hello")
t

> (vector= ['a 'b] [#\a #\b])
nil

> (vector= 'a ['a])
(lit error "{} is not a vector" a)

> (vector= [5] 5)
(lit error "{} is not a vector" 5)
#+end_example

** Funções numéricas

As funções a seguir descrevem operações com números.

*** Coerção e extração de elementos
**** ~(number-coerce subtype x)~

Realiza coerção de  um número, de um subtipo para  outro. Ao contrário
das operações primitivas, que realizam coerções para que haja o mínimo
de perda de  informação possível, aqui a coerção é  realizada de forma
forçada.

~x~  pode ser  qualquer  número.  ~subtype~ precisa  ser  um dos  símbolos
~integer~, ~fraction~, ~float~ e ~complex~.

Caso ~x~ não seja um número, será retornado um erro.

#+begin_example
> (number-coerce 'float 1)
1.0

> (number-coerce 'integer 1J3)
1

> (number-coerce 'integer 2.3)
2

> (number-coerce 'float 2/5)
0.4

> (number-coerce 'integer t)
(lit error "{} is not a number" t)
#+end_example

**** ~(real-part x)~

Retorna a parte real de um número complexo. Retorna erros se ~x~ não for
um número, e também se não for um número complexo.

#+begin_example
> (real-part 2j5)
2

> (real-part 3/2j7)
3/2

> (real-part 1/2)
(lit error "{} is not a complex number" 1/2)

> (real-part nil)
(lit error "{} is not a number" nil)
#+end_example

**** ~(imag-part x)~

Retorna  o coeficiente  da  parte imaginária  de  um número  complexo,
enquanto número real, dependendo do subtipo da mesma. Retorna erros se
~x~ não for um número, e também se não for um número complexo.

#+begin_example
> (imag-part 2j5)
5

> (imag-part 7j3/2)
3/2

> (imag-part 1/2)
(lit error "{} is not a complex number" 1/2)

> (imag-part nil)
(lit error "{} is not a number" nil)
#+end_example

**** ~(numer x)~

Retorna o  numerador de uma  fração, enquanto número  inteiro. Retorna
erros se ~x~ não for um número, e também se não for uma fração.

A função sempre considera a fração passada após sua simplificação.

#+begin_example
> (numer 1/2)
1

> (numer 6/4)
3

> (numer 2)
(lit error "{} is not a fraction" 2)

> (numer nil)
(lit error "{} is not a number" nil)
#+end_example

**** ~(denom x)~

Retorna o denominador de uma  fração, enquanto número inteiro. Retorna
erros se ~x~ não for um número, e também se não for uma fração.

A função sempre considera a fração passada após sua simplificação.

#+begin_example
> (denom 1/2)
2

> (denom 6/4)
2

> (denom 2)
(lit error "{} is not a fraction" 2)

> (denom nil)
(lit error "{} is not a number" nil)
#+end_example

