A-especificacao.html

<div id="outline-container-org6ea599a" class="outline-4">
<h4 id="org6ea599a"><span class="section-number-4">11.4.10.</span> <code>(vec-remove pos vec)</code></h4>
<div class="outline-text-4" id="text-11-4-10">
<p>
Remove um elemento na posição <code>pos</code> de <code>vec</code> e o retorna. O vetor original
será  alterado  durante essa  operação.   Portanto,  <code>vec-remove</code> <b>é  uma
operação destrutiva</b>.
</p>

<p>
Para  que essa  operação funcione,  <code>vec</code> precisa  ser um  vetor, e  <code>pos</code>
precisa ser um número inteiro positivo, maior ou igual a <code>0</code> e menor que
o tamanho de <code>vec</code>. Caso contrário, a função retornará erros.
</p>

<p>
O elemento removido será então retornado pela função.
</p>

<pre class="example" id="org038a0a2">
&gt; (def vec [1 2 3 4 5])
vec

&gt; (vec-remove 2 vec)
3

&gt; (vec-remove 2 vec)
4

&gt; vec
[1 2 5]

&gt; (vec-remove 2 vec)
5

&gt; (vec-remove 2 vec)
(lit error "Index {} is out of bounds in {}" [1 2])

&gt; (vec-remove 0 2)
(lit error "{} is not a vector" 2)
</pre>
</div>
</div>

<div id="outline-container-orgce92312" class="outline-4">
<h4 id="orgce92312"><span class="section-number-4">11.4.11.</span> <code>(vec-insert pos x vec)</code></h4>
<div class="outline-text-4" id="text-11-4-11">
<p>
Insere  um novo  elemento  <code>x</code> na  posição  <code>pos</code> do  vetor  <code>vec</code>. O  vetor
original será  alterado durante essa operação.  Portanto, <code>vec-insert</code> <b>é
uma operação destrutiva</b>.
</p>

<p>
Para que essa  operação funcione, <code>vec</code> precisa ser um  vetor, <code>x</code> precisa
ser  um elemento  cujo tipo  seja compatível  com o  tipo do  vetor em
questão, e  <code>pos</code> precisa  ser um número  inteiro de valor  entre <code>0</code>  e o
tamanho do vetor <code>vec</code>.
</p>

<p>
Por exemplo,  vetores de tipo <code>integer</code>,  <code>float</code> e <code>char</code> só  aceitam novos
elementos de tais  tipos; vetores de tipo <code>any</code>  aceitam quaisquer tipos
de elementos.
</p>

<p>
No caso de <code>pos</code>, para um  vetor de <code>n</code> elementos, serão admitidos valores
de <code>0</code>  a <code>n</code> inclusive.  Uma inserção  na posição <code>n</code>  é similar ao  uso de
<code>vec-push</code>.
</p>

<p>
Caso os parâmetros não possuam os  tipos e valores esperados, a função
retornará  erros. Em  caso de  sucesso, será  retornado o  mesmo vetor
original, após a sua modificação.
</p>

<pre class="example" id="org0f1ae92">
&gt; (def v [1 2 3])
v

&gt; v
[1 2 3]

&gt; (vec-insert 3 5 v)
[1 2 3 5]

&gt; (vec-insert 0 5 v)
[5 1 2 3 5]

&gt; (vec-insert 0 5 v)
[5 5 1 2 3 5]

&gt; (vec-insert 0 5 v)
[5 5 5 1 2 3 5]

&gt; (vec-insert 1 7 v)
[5 7 5 5 1 2 3 5]

&gt; (vec-insert 3 8 v)
[5 7 5 8 5 1 2 3 5]

&gt; (vec-insert 20 8 [1 2 3])
(lit error "Index {} is out of bounds in {}" 20 [1 2 3])

&gt; (vec-insert 2 'a [1 2 3])
(lit error "{} has type {}, which is incompatible with insertion on vector of type {}" a symbol integer)
</pre>
</div>
</div>

<div id="outline-container-org502ddc2" class="outline-4">
<h4 id="org502ddc2"><span class="section-number-4">11.4.12.</span> <code>(vector= va vb)</code></h4>
<div class="outline-text-4" id="text-11-4-12">
<p>
Verifica se <code>va</code> e <code>vb</code> são vetores iguais.
</p>

<p>
Vetores iguais são aqueles que possuem mesmo subtipo, mesmo tamanho, e
elementos iguais. A igualdade de  elementos entre vetores é verificada
com auxílio da função <code>equal</code>,  que pode ser temporariamente substituída
com a utilização de escopo dinâmico.
</p>

<p>
Uma possível implementação de <code>vector=</code> pode ser:
</p>

<pre class="example" id="orga809465">
(defn vector= (va vb)
  (when (eq (vec-type va) (vec-type vb))
    (let* ((len (vec-length va))
           (i 0)
           (continue t))
      (when (= len (vec-length vb))
        (while (and (&lt; i len) continue)
          (unless (equal (vec-at va i)
                         (vec-at vb i))
            (set continue nil))
          (set i (1+ i)))
        continue))))
</pre>

<p>
Caso <code>va</code> e <code>vb</code> sejam iguais,  retorna <code>t</code>. Caso contrário, retorna <code>nil</code>. Se
<code>va</code> ou <code>vb</code> não forem vetores, será retornado um erro.
</p>

<pre class="example" id="org4ea51ff">
&gt; (vector= [1 2 3] [1 2 3])
t

&gt; (let ((v [5 6 7 8]))
    (vector= v [5 6 7 8]))
t

&gt; (vector= [1 2] [3 4 5])
nil

&gt; (vector= "Hello" "Hello")
t

&gt; (vector= ['a 'b] [#\a #\b])
nil

&gt; (vector= 'a ['a])
(lit error "{} is not a vector" a)

&gt; (vector= [5] 5)
(lit error "{} is not a vector" 5)
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f7b926" class="outline-3">
<h3 id="org4f7b926"><span class="section-number-3">11.5.</span> Funções numéricas</h3>
<div class="outline-text-3" id="text-11-5">
<p>
As funções a seguir descrevem operações com números.
</p>
</div>

<div id="outline-container-org3fe7e73" class="outline-4">
<h4 id="org3fe7e73"><span class="section-number-4">11.5.1.</span> Coerção e extração de elementos</h4>
<div class="outline-text-4" id="text-11-5-1">
</div>
<ol class="org-ol">
<li><a id="org4c217ab"></a><code>(number-coerce subtype x)</code><br />
<div class="outline-text-5" id="text-11-5-1-1">
<p>
Realiza coerção de  um número, de um subtipo para  outro. Ao contrário
das operações primitivas, que realizam coerções para que haja o mínimo
de perda de  informação possível, aqui a coerção é  realizada de forma
forçada.
</p>

<p>
<code>x</code>  pode ser  qualquer  número.  <code>subtype</code> precisa  ser  um dos  símbolos
<code>integer</code>, <code>fraction</code>, <code>float</code> e <code>complex</code>.
</p>

<p>
Caso <code>x</code> não seja um número, será retornado um erro.
</p>

<pre class="example" id="org5e9662b">
&gt; (number-coerce 'float 1)
1.0

&gt; (number-coerce 'integer 1J3)
1

&gt; (number-coerce 'integer 2.3)
2

&gt; (number-coerce 'float 2/5)
0.4

&gt; (number-coerce 'integer t)
(lit error "{} is not a number" t)
</pre>
</div>
</li>

<li><a id="org438f71b"></a><code>(real-part x)</code><br />
<div class="outline-text-5" id="text-11-5-1-2">
<p>
Retorna a parte real de um número complexo. Retorna erros se <code>x</code> não for
um número, e também se não for um número complexo.
</p>

<pre class="example" id="orgaa3b252">
&gt; (real-part 2j5)
2

&gt; (real-part 3/2j7)
3/2

&gt; (real-part 1/2)
(lit error "{} is not a complex number" 1/2)

&gt; (real-part nil)
(lit error "{} is not a number" nil)
</pre>
</div>
</li>

<li><a id="org1dc4792"></a><code>(imag-part x)</code><br />
<div class="outline-text-5" id="text-11-5-1-3">
<p>
Retorna  o coeficiente  da  parte imaginária  de  um número  complexo,
enquanto número real, dependendo do subtipo da mesma. Retorna erros se
<code>x</code> não for um número, e também se não for um número complexo.
</p>

<pre class="example" id="org4e411d7">
&gt; (imag-part 2j5)
5

&gt; (imag-part 7j3/2)
3/2

&gt; (imag-part 1/2)
(lit error "{} is not a complex number" 1/2)

&gt; (imag-part nil)
(lit error "{} is not a number" nil)
</pre>
</div>
</li>

<li><a id="org36a5771"></a><code>(numer x)</code><br />
<div class="outline-text-5" id="text-11-5-1-4">
<p>
Retorna o  numerador de uma  fração, enquanto número  inteiro. Retorna
erros se <code>x</code> não for um número, e também se não for uma fração.
</p>

<p>
A função sempre considera a fração passada após sua simplificação.
</p>

<pre class="example" id="org30981df">
&gt; (numer 1/2)
1

&gt; (numer 6/4)
3

&gt; (numer 2)
(lit error "{} is not a fraction" 2)

&gt; (numer nil)
(lit error "{} is not a number" nil)
</pre>
</div>
</li>

<li><a id="org0c94e56"></a><code>(denom x)</code><br />
<div class="outline-text-5" id="text-11-5-1-5">
<p>
Retorna o denominador de uma  fração, enquanto número inteiro. Retorna
erros se <code>x</code> não for um número, e também se não for uma fração.
</p>

<p>
A função sempre considera a fração passada após sua simplificação.
</p>

<pre class="example" id="orga11adfd">
&gt; (denom 1/2)
2

&gt; (denom 6/4)
2

&gt; (denom 2)
(lit error "{} is not a fraction" 2)

&gt; (denom nil)
(lit error "{} is not a number" nil)
</pre>
</div>
</li>
