A-especificacao.org
**** ~(richest-number-type x y)~

Retorna um símbolo indicando o tipo  mais rico em informação entre ~x~ e
~y~. Caso ~x~ ou ~y~ não sejam números, retorna um erro.

Essa  função é  essencial  para  o emprego  de  coerções numéricas  em
operações primitivas.  Ao deduzirmos o  tipo, entre outros  dois, onde
menos se perde informação, podemos realizar coerções em ~x~ e ~y~ para que
operações primitivas sejam feitas nos mesmos, de forma subsequente.

Esta  função   segue  estritamente  as  regras   de  coerção  numérica
mencionadas na especificação de números anteriormente citada.

Esta função também *não aborda* casos individuais relacionados a números
compostos (~fraction~ e ~complex~, quando  o primeiro possui denominador ~1~
e o  segundo possui  parte imaginária  igual a  ~0~). Para  estes casos,
espera-se  que   a  operação  em   questão  realize  um   processo  de
/simplificação/ do resultado, onde uma nova coerção poderá ocorrer.

#+begin_example
> (richest-number-type 5 2.0)
float

> (richest-number-type 2 2/3)
fraction

> (richest-number-type 2J3 9)
complex

> (richest-number-type 2/3J-9 2.0)
complex

> (richest-number-type 2/3J-9 t)
(lit error "{} is not a number" t)
#+end_example

**** ~(rich-number-coerce x y)~

Realiza uma coerção rica entre ~x~ e ~y~.

Uma  coerção rica  toma  o subtipo  numérico  mais rico  entre  ~x~ e  ~y~
(através   de  ~richest-number-type~)   e  utiliza   ~number-coerce~  para
transformar ambos ~x~ e ~y~ em números dos subtipos designados.

#+begin_example
(defn rich-number-coerce (x y)
  (let ((best-type (richest-number-type x y)))
    (list (number-coerce best-type x)
          (number-coerce best-type y))))
#+end_example

Esta função retorna uma lista contendo as versões transformadas de ~x~ e
~y~. Caso  um desses parâmetros  não seja  um número, será  retornado um
erro,    normalmente    sendo    o   mesmo    erro    retornado    por
~richest-number-type~.

#+begin_example
> (rich-number-coerce 2J3 2/5)
(2J3 2/5J0.0)

> (rich-number-coerce 1.5 5/2)
(3/2 5/2)

> (rich-number-coerce 2 t)
(lit error "{} is not a number" t)
#+end_example

*** Operações aritméticas

As operações básicas de Majestic  dependem da quantidade de argumentos
passados para as funções. Em geral, há comportamentos para zero, um ou
mais argumentos.

Caso algum dos argumentos não seja um número, retorna um erro.

As  operações podem  precisar  de algumas  coerções implícitas.  Essas
coerções  estão   definidas  na  discussão  anterior   a  respeito  da
especificação dos números.

**** ~(+ . rest)~

*Nenhum argumento:* Retorna o elemento neutro da soma (~1~).

*Um argumento:* Conjugado  -- retorna o conjugado do  número atual, caso
seja  um  número   complexo;  do  contrário,  retorna   o  número  sem
alterações.

*Mais argumentos:* Retorna o somatório dos argumentos.

#+begin_example
> (+)
1

> (+ 2J3)
2J-3

> (+ 1 2 3)
6

> (+ 'a)
(lit error "{} is not a number" a)
#+end_example

**** ~(- . rest)~

*Nenhum argumento:* Retorna o elemento neutro da subtração (~0~).

*Um argumento:* Retorna a negação do número.

*Mais argumentos:* Retorna a subtração sucessiva dos argumentos.

#+begin_example
> (-)
0

> (- 1)
-1

> (- 1 2 3)
-4

> (- 'a)
(lit error "{} is not a number" a)
#+end_example

**** ~(* . rest)~

*Nenhum argumento:* Retorna o elemento neutro da multiplicação (~1~).

*Um  argumento:* Retorna  o  sinal do  número.  Para números  positivos,
retorna  ~1~; para  negativos,  retorna  ~-1~. Caso  o  número seja  zero,
retorna ~0~.

*Mais argumentos:* Retorna o produtório dos argumentos.

#+begin_example
> (*)
1

> (* -50)
-1

> (* 1 2 3)
6

> (* 3J2 1J7)
-11J23.0

> (* 'a)
(lit error "{} is not a number" a)
#+end_example

**** ~(/ . rest)~

*Nenhum argumento:* Retorna o elemento neutro da divisão (~1~).

*Um argumento:* Retorna o /recíproco/ do número. Os números podem precisar
de coerção para que o recíproco seja calculado.

*Mais argumentos:* Retorna a divisão sucessiva dos argumentos.

Exclusivamente  para esta  operação,  nenhum dos  argumentos pode  ser
/zero/. Se for, será gerado um erro de divisão por zero.

#+begin_example
> (/)
1

> (/ 3)
1/3

> (/ 0.5)
2

> (/ 3 4)
3/4

> (/ 2 3 0)
(lit error "Division by zero")

> (/ 0)
(lit error "Division by zero")

> (/ 2 'a)
(lit error "{} is not a number" a)
#+end_example

*** Miscelânea
**** ~(zerop x)~

Retorna ~t~ se ~x~ for um número igual a zero.

Esta  função usualmente  utiliza uma  comparação com  zero através  da
operação de  comparação ~=~. Para o  caso de números com  subtipo ~float~,
será utilizada a operação de comparação ~float=~.

#+begin_example
(defn zerop (x)
  (or (and (floatp x)
           (float= x 0.0))
      (= x 0)))
#+end_example

Caso o objeto  em questão não seja um número,  será retornado um erro,
geralmente o mesmo retornado por ~float=~ ou ~=~.

#+begin_example
> (zerop 0.00)
t

> (zerop 0/1)
t

> (zerop 0)
t

> (zerop 5)
nil

> (zerop t)
(lit error "{} is not a number" t)
#+end_example

**** ~(iota n)~

Gera uma lista contendo  números de ~0~ a ~(1- n)~  (~n~ não estará incluído
na lista).

Retorna um erro se ~n~ não for um número inteiro positivo.

#+begin_example
> (iota 0)
nil

> (iota 5)
(0 1 2 3 4)

> (map 1+ (iota 5))
(1 2 3 4 5)

> (iota -1)
(lit error "iota expects a positive integer number")

> (iota 2/3)
(lit error "iota expects a positive integer number")

> (iota 'a)
(lit error "iota expects a positive integer number")
#+end_example

**** ~(1+ x)~

Retorna o número ~x~, acrescido de uma unidade (~1~).

~1+~ pode ser definido da seguinte forma:

#+begin_example
(defn 1+ (x) (+ 1 x))
#+end_example

Caso ~x~ não seja um número, será retornado um erro.

#+begin_example
> (1+ 2)
3

> (map 1+ (iota 2))
(1 2)

> (1+ 'a)
(lit error "{} is not a number" a)
#+end_example

**** ~(1- x)~

Retorna o número ~x~, decrescido de uma unidade (~1~).

~1-~ pode ser definido da seguinte forma:

#+begin_example
(defn 1- (x) (+ -1 x))
#+end_example

Caso ~x~ não seja um número, será retornado um erro.

#+begin_example
> (1- 2)
1

> (map 1- (iota 2))
(-1 0)

> (1- 'a)
(lit error "{} is not a number" a)
#+end_example

** TODO Operações de comparação

