A-especificacao.html

<li><a id="orgc0e462d"></a><code>(richest-number-type x y)</code><br />
<div class="outline-text-5" id="text-11-5-1-6">
<p>
Retorna um símbolo indicando o tipo  mais rico em informação entre <code>x</code> e
<code>y</code>. Caso <code>x</code> ou <code>y</code> não sejam números, retorna um erro.
</p>

<p>
Essa  função é  essencial  para  o emprego  de  coerções numéricas  em
operações primitivas.  Ao deduzirmos o  tipo, entre outros  dois, onde
menos se perde informação, podemos realizar coerções em <code>x</code> e <code>y</code> para que
operações primitivas sejam feitas nos mesmos, de forma subsequente.
</p>

<p>
Esta  função   segue  estritamente  as  regras   de  coerção  numérica
mencionadas na especificação de números anteriormente citada.
</p>

<p>
Esta função também <b>não aborda</b> casos individuais relacionados a números
compostos (<code>fraction</code> e <code>complex</code>, quando  o primeiro possui denominador <code>1</code>
e o  segundo possui  parte imaginária  igual a  <code>0</code>). Para  estes casos,
espera-se  que   a  operação  em   questão  realize  um   processo  de
<i>simplificação</i> do resultado, onde uma nova coerção poderá ocorrer.
</p>

<pre class="example" id="org3621c0b">
&gt; (richest-number-type 5 2.0)
float

&gt; (richest-number-type 2 2/3)
fraction

&gt; (richest-number-type 2J3 9)
complex

&gt; (richest-number-type 2/3J-9 2.0)
complex

&gt; (richest-number-type 2/3J-9 t)
(lit error "{} is not a number" t)
</pre>
</div>
</li>

<li><a id="orga498454"></a><code>(rich-number-coerce x y)</code><br />
<div class="outline-text-5" id="text-11-5-1-7">
<p>
Realiza uma coerção rica entre <code>x</code> e <code>y</code>.
</p>

<p>
Uma  coerção rica  toma  o subtipo  numérico  mais rico  entre  <code>x</code> e  <code>y</code>
(através   de  <code>richest-number-type</code>)   e  utiliza   <code>number-coerce</code>  para
transformar ambos <code>x</code> e <code>y</code> em números dos subtipos designados.
</p>

<pre class="example" id="org9b2776b">
(defn rich-number-coerce (x y)
  (let ((best-type (richest-number-type x y)))
    (list (number-coerce best-type x)
          (number-coerce best-type y))))
</pre>

<p>
Esta função retorna uma lista contendo as versões transformadas de <code>x</code> e
<code>y</code>. Caso  um desses parâmetros  não seja  um número, será  retornado um
erro,    normalmente    sendo    o   mesmo    erro    retornado    por
<code>richest-number-type</code>.
</p>

<pre class="example" id="org7a12300">
&gt; (rich-number-coerce 2J3 2/5)
(2J3 2/5J0.0)

&gt; (rich-number-coerce 1.5 5/2)
(3/2 5/2)

&gt; (rich-number-coerce 2 t)
(lit error "{} is not a number" t)
</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-org18da30a" class="outline-4">
<h4 id="org18da30a"><span class="section-number-4">11.5.2.</span> Operações aritméticas</h4>
<div class="outline-text-4" id="text-11-5-2">
<p>
As operações básicas de Majestic  dependem da quantidade de argumentos
passados para as funções. Em geral, há comportamentos para zero, um ou
mais argumentos.
</p>

<p>
Caso algum dos argumentos não seja um número, retorna um erro.
</p>

<p>
As  operações podem  precisar  de algumas  coerções implícitas.  Essas
coerções  estão   definidas  na  discussão  anterior   a  respeito  da
especificação dos números.
</p>
</div>

<ol class="org-ol">
<li><a id="org51311fd"></a><code>(+ . rest)</code><br />
<div class="outline-text-5" id="text-11-5-2-1">
<p>
<b>Nenhum argumento:</b> Retorna o elemento neutro da soma (<code>1</code>).
</p>

<p>
<b>Um argumento:</b> Conjugado  &#x2013; retorna o conjugado do  número atual, caso
seja  um  número   complexo;  do  contrário,  retorna   o  número  sem
alterações.
</p>

<p>
<b>Mais argumentos:</b> Retorna o somatório dos argumentos.
</p>

<pre class="example" id="org214531d">
&gt; (+)
1

&gt; (+ 2J3)
2J-3

&gt; (+ 1 2 3)
6

&gt; (+ 'a)
(lit error "{} is not a number" a)
</pre>
</div>
</li>

<li><a id="org23b739e"></a><code>(- . rest)</code><br />
<div class="outline-text-5" id="text-11-5-2-2">
<p>
<b>Nenhum argumento:</b> Retorna o elemento neutro da subtração (<code>0</code>).
</p>

<p>
<b>Um argumento:</b> Retorna a negação do número.
</p>

<p>
<b>Mais argumentos:</b> Retorna a subtração sucessiva dos argumentos.
</p>

<pre class="example" id="org3ddacfd">
&gt; (-)
0

&gt; (- 1)
-1

&gt; (- 1 2 3)
-4

&gt; (- 'a)
(lit error "{} is not a number" a)
</pre>
</div>
</li>

<li><a id="org19b6e42"></a><code>(* . rest)</code><br />
<div class="outline-text-5" id="text-11-5-2-3">
<p>
<b>Nenhum argumento:</b> Retorna o elemento neutro da multiplicação (<code>1</code>).
</p>

<p>
<b>Um  argumento:</b> Retorna  o  sinal do  número.  Para números  positivos,
retorna  <code>1</code>; para  negativos,  retorna  <code>-1</code>. Caso  o  número seja  zero,
retorna <code>0</code>.
</p>

<p>
<b>Mais argumentos:</b> Retorna o produtório dos argumentos.
</p>

<pre class="example" id="orgad6aaf6">
&gt; (*)
1

&gt; (* -50)
-1

&gt; (* 1 2 3)
6

&gt; (* 3J2 1J7)
-11J23.0

&gt; (* 'a)
(lit error "{} is not a number" a)
</pre>
</div>
</li>

<li><a id="org2b4947d"></a><code>(/ . rest)</code><br />
<div class="outline-text-5" id="text-11-5-2-4">
<p>
<b>Nenhum argumento:</b> Retorna o elemento neutro da divisão (<code>1</code>).
</p>

<p>
<b>Um argumento:</b> Retorna o <i>recíproco</i> do número. Os números podem precisar
de coerção para que o recíproco seja calculado.
</p>

<p>
<b>Mais argumentos:</b> Retorna a divisão sucessiva dos argumentos.
</p>

<p>
Exclusivamente  para esta  operação,  nenhum dos  argumentos pode  ser
<i>zero</i>. Se for, será gerado um erro de divisão por zero.
</p>

<pre class="example" id="orga12d44d">
&gt; (/)
1

&gt; (/ 3)
1/3

&gt; (/ 0.5)
2

&gt; (/ 3 4)
3/4

&gt; (/ 2 3 0)
(lit error "Division by zero")

&gt; (/ 0)
(lit error "Division by zero")

&gt; (/ 2 'a)
(lit error "{} is not a number" a)
</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-org6699b74" class="outline-4">
<h4 id="org6699b74"><span class="section-number-4">11.5.3.</span> Miscelânea</h4>
<div class="outline-text-4" id="text-11-5-3">
</div>
<ol class="org-ol">
<li><a id="orgca142f2"></a><code>(zerop x)</code><br />
<div class="outline-text-5" id="text-11-5-3-1">
<p>
Retorna <code>t</code> se <code>x</code> for um número igual a zero.
</p>

<p>
Esta  função usualmente  utiliza uma  comparação com  zero através  da
operação de  comparação <code>=</code>. Para o  caso de números com  subtipo <code>float</code>,
será utilizada a operação de comparação <code>float=</code>.
</p>

<pre class="example" id="orga6519e6">
(defn zerop (x)
  (or (and (floatp x)
           (float= x 0.0))
      (= x 0)))
</pre>

<p>
Caso o objeto  em questão não seja um número,  será retornado um erro,
geralmente o mesmo retornado por <code>float=</code> ou <code>=</code>.
</p>

<pre class="example" id="org91e32c4">
&gt; (zerop 0.00)
t

&gt; (zerop 0/1)
t

&gt; (zerop 0)
t

&gt; (zerop 5)
nil

&gt; (zerop t)
(lit error "{} is not a number" t)
</pre>
</div>
</li>

<li><a id="orgb720254"></a><code>(iota n)</code><br />
<div class="outline-text-5" id="text-11-5-3-2">
<p>
Gera uma lista contendo  números de <code>0</code> a <code>(1- n)</code>  (<code>n</code> não estará incluído
na lista).
</p>

<p>
Retorna um erro se <code>n</code> não for um número inteiro positivo.
</p>

<pre class="example" id="org666cea9">
&gt; (iota 0)
nil

&gt; (iota 5)
(0 1 2 3 4)

&gt; (map 1+ (iota 5))
(1 2 3 4 5)

&gt; (iota -1)
(lit error "iota expects a positive integer number")

&gt; (iota 2/3)
(lit error "iota expects a positive integer number")

&gt; (iota 'a)
(lit error "iota expects a positive integer number")
</pre>
</div>
</li>

<li><a id="orga93b4cb"></a><code>(1+ x)</code><br />
<div class="outline-text-5" id="text-11-5-3-3">
<p>
Retorna o número <code>x</code>, acrescido de uma unidade (<code>1</code>).
</p>

<p>
<code>1+</code> pode ser definido da seguinte forma:
</p>

<pre class="example" id="orga4bb5ee">
(defn 1+ (x) (+ 1 x))
</pre>

<p>
Caso <code>x</code> não seja um número, será retornado um erro.
</p>

<pre class="example" id="org3080402">
&gt; (1+ 2)
3

&gt; (map 1+ (iota 2))
(1 2)

&gt; (1+ 'a)
(lit error "{} is not a number" a)
</pre>
</div>
</li>

<li><a id="orgc51e554"></a><code>(1- x)</code><br />
<div class="outline-text-5" id="text-11-5-3-4">
<p>
Retorna o número <code>x</code>, decrescido de uma unidade (<code>1</code>).
</p>

<p>
<code>1-</code> pode ser definido da seguinte forma:
</p>

<pre class="example" id="org2d97350">
(defn 1- (x) (+ -1 x))
</pre>

<p>
Caso <code>x</code> não seja um número, será retornado um erro.
</p>

<pre class="example" id="orgd937484">
&gt; (1- 2)
1

&gt; (map 1- (iota 2))
(-1 0)

&gt; (1- 'a)
(lit error "{} is not a number" a)
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgca17dce" class="outline-3">
<h3 id="orgca17dce"><span class="section-number-3">11.6.</span> <span class="todo TODO">TODO</span> Operações de comparação</h3>
<div class="outline-text-3" id="text-11-6">
</div>
