A-especificacao.org
*** ~(= x y . rest)~

Verifica por igualdade entre dois ou mais números, retornando ~t~ ou ~nil~.

Antes  de efetuar  qualquer  comparação, realiza-se  uma coerção  rica
entre ~x~  e ~y~. Em  seguida, procede-se  à comparação para  cada subtipo
numérico.

A  igualdade numérica  realiza operações  internas de  comparação para
todos os  subtipos numéricos,  exceto o subtipo  ~float~. Nesse  caso, a
função  recorrerá   à  função  ~float=~  para   comparação.  Todavia,  é
importante  salientar  que *comparações  por  igualdade  com ~float~  são
desencorajadas*.

#+begin_example
> (= 4/2 2)
t

> (let ((x 1))
    (= 1 x))
t

> (= 2J3 2/3)
nil

> (= 2.0 2)
t

> (= 2 4/2 2 3 5)
nil

> (= t 2/3)
(lit error "{} is not a number" t)
#+end_example

Para um número de argumentos maior que dois, a função tentará comparar
~x~ e  ~y~ e, caso  a comparação seja  verdadeira, repetirá a  execução da
função, removendo  ~x~ da  lista de argumentos.  Caso a  comparação seja
falsa,  interrompe-se o  processo  recursivo, e  retorna-se ~nil~,  como
esperado.

Em termos práticos, a comparação a seguir desenvolve-se como indicado:

#+begin_example
(= 2 4/2 2 3 5)
(= 4/2 2 3 5)
(= 2 3 5)
nil
#+end_example

*** ~(float= x y)~

# Ver: https://docs.rs/float-cmp/0.8.0/float_cmp/index.html

Verifica por igualdade entre exatamente dois números de subtipo ~float~.

Esta  função   é  utilizada   de  forma  subjacente   nas  comparações
aritméticas  da  função ~=~,  quando  envolvem  a comparação  de  pontos
flutuantes.

Comparar pontos  flutuantes por igualdade é  uma operação notavelmente
dificultosa,  posto que  valores decimais  não possuem  representações
precisas quando lidamos com pontos flutuantes. Como exemplo, vejamos o
código a seguir,  como executado em um interpretador  de Majestic Lisp
feito como referência:

#+begin_example
> (def f 0.1)
f

> (def sum 0.0)
sum

> (repeat 10 (set sum (+ sum f)))
sum

> (def product (* f 10))
product

> (print "sum = {}, product = {}" sum product)
; sum = 0.9999999999999999, product = 1.0
; 
nil

> (float= sum product)
t
#+end_example

Os  valores de  ~sum~ e  ~product~ neste  exemplo variam  de acordo  com a
máquina,  a  implementação e  a  representação  utilizada para  pontos
flutuantes. Justamente por isso, pode-se  observar a ocorrência de uma
anomalia: ambos  ~sum~ e ~product~ calculam  a multiplicação de ~f~  por ~10~,
porém  de   maneiras  diferentes;  enquanto   ~sum~  usa  o   método  de
multiplicações  sucessivas,   ~product~  envolve  o  uso   da  função  ~*~
diretamente.

Isto ocorre  devido à  natureza da  representação de  ~float~'s enquanto
arredondamentos dos números aos  quais queremos representar. Por isso,
a melhor opção para uma comparação  direta entre ~float~'s é comparar se
dois números são suficientemente próximos um do outro.

Normalmente seria interessante considerar  um valor pequeno $\epsilon$
que representasse  a distância entre dois  números representáveis como
~float~, todavia,  a própria forma  de representação desses  números faz
com que uma  constante $\epsilon$ possa se tornar  inefetiva em alguns
casos,  especialmente  quando  o  número aumenta.  Assim,  o  ideal  é
considerar  $\epsilon$  como  uma  medida variável  e  dependente  dos
números comparados.

Para tanto, é possível tomar  a representação binária dos ~float~'s como
se fossem  representações binárias de números  inteiros (~integer~), que
conservam a  propriedade de serem  adjacentes, quando os  dois ~float~'s
o são.  Assim, uma mera  subtração destes  números, em seu  formato de
números  inteiros, dizem-nos  quão longe  um  do outro  eles estão  no
espaço dos ~float~'s.

Mais especificamente, dados $a$ e $b$  que possuem o mesmo sinal e são
do subtipo numérico ~float~, temos que:

\begin{equation}
a_\textrm{integer} - b_{integer} = 1 + p
\end{equation}

onde $p$ é  a quantidade de números  possivelmente representáveis como
~float~ entre $a$ e $b$[fn:3].

A partir deste  método, sabemos agora que ~float=~  envolve realizar tal
comparação entre ~float~'s  de forma que a operação acima  não exceda um
certo  número  $p$,  também  conhecido   como  ULPs  (/units  of  least
precision/, ou /units in the last place/).

Em Majestic Lisp, ULPs é  uma constante global armazenada como ~*ulps*~,
que  pode  ser temporariamente  modificada  através  de uma  definição
dinâmica.

Em  geral, recomenda-se  não realizar  comparação direta  entre pontos
flutuantes,  pela  natureza imprecisa  de  seus  possíveis métodos  de
comparação.   Todavia,   para  as  situações  onde   for  extremamente
necessário,  será  possível  delegar  esta  atividade  para  a  função
~float=~.

Finalmente,  ao  tratarmos do  uso  conceitual  da linguagem,  onde  a
limitação de ~float~'s não existiria,  ~float=~ seria meramente uma versão
mais específica de ~=~.

*** ~(> x y . rest)~

Compara consecutivamente se um número  é maior que outro, retornando ~t~
ou ~nil~.

Antes  de efetuar  qualquer  comparação, realiza-se  uma coerção  rica
entre ~x~  e ~y~. Em  seguida, procede-se  à comparação para  cada subtipo
numérico.

A  função numérica  de maior-que  realiza comparações  entre todos  os
subtipos numéricos, exceto para números  ~complex~, posto que o conjunto
$\mathbb{C}$  não pode  ser um  campo ordenado[fn:4].  Para o  caso de
números  de  subtipo  ~fraction~,   realiza-se  uma  conversão  para  um
denominador comum e compara-se os números inteiros do numerador.

Realizar uma  comparação usando ~>~,  de forma  a envolver um  número de
subtipo ~complex~, gerará um erro.

#+begin_example
> (> 5/2 2)
t

> (let ((x 1))
    (> 1 x))
nil

> (> 10 5 3 1)
t

> (> 1 2 3)
nil

> (> 2J3 2/3)
(lit error "The set of complex numbers can't be an ordered field")

> (> 3 t)
(lit error "{} is not a number" t)
#+end_example

Para um número de argumentos maior que dois, a função tentará comparar
~x~ e  ~y~ e, caso  a comparação seja  verdadeira, repetirá a  execução da
função, removendo  ~x~ da  lista de argumentos.  Caso a  comparação seja
falsa,  interrompe-se o  processo  recursivo, e  retorna-se ~nil~,  como
esperado.

Em termos práticos, a comparação a seguir desenvolve-se como indicado:

#+begin_example
(> 3 2 1)
(> 2 1)
t
#+end_example

*** ~(< x y . rest)~

Compara consecutivamente se um número  é menor que outro, retornando ~t~
ou ~nil~.

Antes  de efetuar  qualquer  comparação, realiza-se  uma coerção  rica
entre ~x~  e ~y~. Em  seguida, procede-se  à comparação para  cada subtipo
numérico.

A  função numérica  de menor-que  realiza comparações  entre todos  os
subtipos numéricos, exceto para números  ~complex~, posto que o conjunto
$\mathbb{C}$ não pode  ser um campo ordenado.  Para o  caso de números
de  subtipo ~fraction~,  realiza-se  uma conversão  para um  denominador
comum e compara-se os números inteiros do numerador.

Realizar uma  comparação usando ~<~,  de forma  a envolver um  número de
subtipo ~complex~, gerará um erro.

#+begin_example
> (< 2 5/2)
t

> (let ((x 1))
    (< 1 x))
nil

> (< 1 3 5 10)
t

> (< 3 2 1)
nil

> (< 2J3 2/3)
(lit error "The set of complex numbers can't be an ordered field")

> (< 3 t)
(lit error "{} is not a number" t)
#+end_example

Para um número de argumentos maior que dois, a função tentará comparar
~x~ e  ~y~ e, caso  a comparação seja  verdadeira, repetirá a  execução da
função, removendo  ~x~ da  lista de argumentos.  Caso a  comparação seja
falsa,  interrompe-se o  processo  recursivo, e  retorna-se ~nil~,  como
esperado.

Em termos práticos, a comparação a seguir desenvolve-se como indicado:

#+begin_example
(< 1 2 3)
(< 2 3)
t
#+end_example

*** ~(>= x y . rest)~

Compara  consecutivamente se  um  número  é maior  ou  igual a  outro,
retornando ~t~ ou ~nil~.

Esta  função não  é capaz  de  realizar comparações  para números  com
subtipo ~complex~,  posto que  o conjunto $\mathbb{C}$  não pode  ser um
campo ordenado.  Realizar uma comparação envolvendo  um numero ~complex~
retornará um erro.

Uma possível definição para essa função seria:

#+begin_example
(defn >= args
  (or (apply > args)
      (apply = args)))
#+end_example

Esta função  pode portanto ser  definida com base  em ~>~ e  ~=~, herdando
portanto o comportamento e as limitações subjacentes dessas funções.

#+begin_example
> (>= 5/2 2)
t

> (>= 2.0 2)
t

> (>= 1 2 3)
nil

> (>= 3 3 1)
t

> (>= 5J9 6J9)
(lit error "The set of complex numbers can't be an ordered field")

> (>= 3 t)
(lit error "{} is not a number" t)
#+end_example

*** ~(<= x y . rest)~

Compara  consecutivamente se  um  número  é menor  ou  igual a  outro,
retornando ~t~ ou ~nil~.

Esta  função não  é capaz  de  realizar comparações  para números  com
subtipo ~complex~,  posto que  o conjunto $\mathbb{C}$  não pode  ser um
campo ordenado.  Realizar uma comparação envolvendo  um numero ~complex~
retornará um erro.

Uma possível definição para essa função seria:

#+begin_example
(defn <= args
  (or (apply < args)
      (apply = args)))
#+end_example

Esta função  pode portanto ser  definida com base  em ~>~ e  ~=~, herdando
portanto o comportamento e as limitações subjacentes dessas funções.

#+begin_example
> (<= 5/2 2)
nil

> (<= 2.0 2)
t

> (<= 1 2 3)
t

> (<= 3 3 1)
nil

> (<= 5J9 6J9)
(lit error "The set of complex numbers can't be an ordered field")

> (<= 3 t)
(lit error "{} is not a number" t)
#+end_example

*** TODO ~(abs x)~ :noexport:
*** TODO ~(div x y)~ :noexport:
*** TODO ~(expt x y)~ :noexport:
