A-especificacao.html
<div id="outline-container-org07f161d" class="outline-4">
<h4 id="org07f161d"><span class="section-number-4">11.6.1.</span> <code>(= x y . rest)</code></h4>
<div class="outline-text-4" id="text-11-6-1">
<p>
Verifica por igualdade entre dois ou mais números, retornando <code>t</code> ou <code>nil</code>.
</p>

<p>
Antes  de efetuar  qualquer  comparação, realiza-se  uma coerção  rica
entre <code>x</code>  e <code>y</code>. Em  seguida, procede-se  à comparação para  cada subtipo
numérico.
</p>

<p>
A  igualdade numérica  realiza operações  internas de  comparação para
todos os  subtipos numéricos,  exceto o subtipo  <code>float</code>. Nesse  caso, a
função  recorrerá   à  função  <code>float=</code>  para   comparação.  Todavia,  é
importante  salientar  que <b>comparações  por  igualdade  com <code>float</code>  são
desencorajadas</b>.
</p>

<pre class="example" id="orgaba56d6">
&gt; (= 4/2 2)
t

&gt; (let ((x 1))
    (= 1 x))
t

&gt; (= 2J3 2/3)
nil

&gt; (= 2.0 2)
t

&gt; (= 2 4/2 2 3 5)
nil

&gt; (= t 2/3)
(lit error "{} is not a number" t)
</pre>

<p>
Para um número de argumentos maior que dois, a função tentará comparar
<code>x</code> e  <code>y</code> e, caso  a comparação seja  verdadeira, repetirá a  execução da
função, removendo  <code>x</code> da  lista de argumentos.  Caso a  comparação seja
falsa,  interrompe-se o  processo  recursivo, e  retorna-se <code>nil</code>,  como
esperado.
</p>

<p>
Em termos práticos, a comparação a seguir desenvolve-se como indicado:
</p>

<pre class="example" id="org5e716a4">
(= 2 4/2 2 3 5)
(= 4/2 2 3 5)
(= 2 3 5)
nil
</pre>
</div>
</div>

<div id="outline-container-orgf67bf6c" class="outline-4">
<h4 id="orgf67bf6c"><span class="section-number-4">11.6.2.</span> <code>(float= x y)</code></h4>
<div class="outline-text-4" id="text-11-6-2">
<p>
Verifica por igualdade entre exatamente dois números de subtipo <code>float</code>.
</p>

<p>
Esta  função   é  utilizada   de  forma  subjacente   nas  comparações
aritméticas  da  função <code>=</code>,  quando  envolvem  a comparação  de  pontos
flutuantes.
</p>

<p>
Comparar pontos  flutuantes por igualdade é  uma operação notavelmente
dificultosa,  posto que  valores decimais  não possuem  representações
precisas quando lidamos com pontos flutuantes. Como exemplo, vejamos o
código a seguir,  como executado em um interpretador  de Majestic Lisp
feito como referência:
</p>

<pre class="example" id="orgbbd84f8">
&gt; (def f 0.1)
f

&gt; (def sum 0.0)
sum

&gt; (repeat 10 (set sum (+ sum f)))
sum

&gt; (def product (* f 10))
product

&gt; (print "sum = {}, product = {}" sum product)
; sum = 0.9999999999999999, product = 1.0
; 
nil

&gt; (float= sum product)
t
</pre>

<p>
Os  valores de  <code>sum</code> e  <code>product</code> neste  exemplo variam  de acordo  com a
máquina,  a  implementação e  a  representação  utilizada para  pontos
flutuantes. Justamente por isso, pode-se  observar a ocorrência de uma
anomalia: ambos  <code>sum</code> e <code>product</code> calculam  a multiplicação de <code>f</code>  por <code>10</code>,
porém  de   maneiras  diferentes;  enquanto   <code>sum</code>  usa  o   método  de
multiplicações  sucessivas,   <code>product</code>  envolve  o  uso   da  função  <code>*</code>
diretamente.
</p>

<p>
Isto ocorre  devido à  natureza da  representação de  <code>float</code>'s enquanto
arredondamentos dos números aos  quais queremos representar. Por isso,
a melhor opção para uma comparação  direta entre <code>float</code>'s é comparar se
dois números são suficientemente próximos um do outro.
</p>

<p>
Normalmente seria interessante considerar  um valor pequeno \(\epsilon\)
que representasse  a distância entre dois  números representáveis como
<code>float</code>, todavia,  a própria forma  de representação desses  números faz
com que uma  constante \(\epsilon\) possa se tornar  inefetiva em alguns
casos,  especialmente  quando  o  número aumenta.  Assim,  o  ideal  é
considerar  \(\epsilon\)  como  uma  medida variável  e  dependente  dos
números comparados.
</p>

<p>
Para tanto, é possível tomar  a representação binária dos <code>float</code>'s como
se fossem  representações binárias de números  inteiros (<code>integer</code>), que
conservam a  propriedade de serem  adjacentes, quando os  dois <code>float</code>'s
o são.  Assim, uma mera  subtração destes  números, em seu  formato de
números  inteiros, dizem-nos  quão longe  um  do outro  eles estão  no
espaço dos <code>float</code>'s.
</p>

<p>
Mais especificamente, dados \(a\) e \(b\)  que possuem o mesmo sinal e são
do subtipo numérico <code>float</code>, temos que:
</p>

\begin{equation}
a_\textrm{integer} - b_{integer} = 1 + p
\end{equation}

<p>
onde \(p\) é  a quantidade de números  possivelmente representáveis como
<code>float</code> entre \(a\) e \(b\)<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>.
</p>

<p>
A partir deste  método, sabemos agora que <code>float=</code>  envolve realizar tal
comparação entre <code>float</code>'s  de forma que a operação acima  não exceda um
certo  número  \(p\),  também  conhecido   como  ULPs  (<i>units  of  least
precision</i>, ou <i>units in the last place</i>).
</p>

<p>
Em Majestic Lisp, ULPs é  uma constante global armazenada como <code>*ulps*</code>,
que  pode  ser temporariamente  modificada  através  de uma  definição
dinâmica.
</p>

<p>
Em  geral, recomenda-se  não realizar  comparação direta  entre pontos
flutuantes,  pela  natureza imprecisa  de  seus  possíveis métodos  de
comparação.   Todavia,   para  as  situações  onde   for  extremamente
necessário,  será  possível  delegar  esta  atividade  para  a  função
<code>float=</code>.
</p>

<p>
Finalmente,  ao  tratarmos do  uso  conceitual  da linguagem,  onde  a
limitação de <code>float</code>'s não existiria,  <code>float=</code> seria meramente uma versão
mais específica de <code>=</code>.
</p>
</div>
</div>
