A-especificacao.org
**** ~(read stream)~

Lê um objeto  no stream de entrada informado, avançando  o ponteiro de
leitura do stream até onde for possível.

O texto lido  passa pelo processo de /parsing/ da  própria linguagem, de
forma que uma única expressão válida  seja lida a partir do arquivo, e
então  retornada  sem passar  pelo  processo  de interpretação.  Sendo
assim,  ~read~ pode  ser considerado  o ponto  de entrada  do /parser/  de
Majestic Lisp.

Caso  haja um  erro no  processo de  /parsing/, será  retornado um  erro
correspondente ao problema em tal processo.

Caso  o stream  não seja  de  entrada, ou  caso seja  o stream  esteja
fechado,   ou   caso  ~stream~   não   seja   um  stream,   retorna   um
erro.

Contrariamente,   será   retornado   um  objeto   de   Majestic   Lisp
correspondente à expressão lida ou, caso  o stream de entrada tenha se
esgotado, será retornado o símbolo ~eof~.

Se houver  algum outro  problema no processo  de leitura,  essa função
poderá também retornar um erro indicando o problema em questão.

Supondo um  arquivo-texto ~teste.txt~  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final...

#+begin_example
(foo bar baz) (1 2 3)
#+end_example

...os exemplos a seguir utilizam-se de tal arquivo.

#+begin_example
> (def *my-stream* (open-stream 'in "teste.txt"))
*my-stream*

> *my-stream*
#<stream (in) {...}>

> (read *my-stream*)
(foo bar baz)

> (read *my-stream*)
(1 2 3)

> (read *my-stream*)
eof

> (read *stdout*)
(lit error "{} is not an input stream" #<stream (out) {...}>)

> (close-stream *my-stream*)
t

> (read *my-stream*)
(lit error "The stream {} is closed" #<stream (in) {...}>)

> (read 2/3)
(lit error "{} is not a stream" 2/3)
#+end_example

**** ~(read-char stream)~

Lê  um único  caractere no  stream de  entrada informado,  avançando o
ponteiro de leitura do stream, caso seja possível.

Caso  o stream  não seja  de  entrada, ou  caso seja  o stream  esteja
fechado,   ou   caso  ~stream~   não   seja   um  stream,   retorna   um
erro.

Contrariamente, será retornado  o caractere lido ou, caso  o stream de
entrada tenha se esgotado, será retornado o símbolo ~eof~.

Se houver  algum outro  problema no processo  de leitura,  essa função
poderá também retornar um erro indicando o problema em questão.

Supondo um  arquivo-texto ~teste.txt~  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final...

#+begin_example
Teste
#+end_example

...os exemplos a seguir utilizam-se de tal arquivo.

#+begin_example
> (def *my-stream* (open-stream 'in "teste.txt"))
*my-stream*

> *my-stream*
#<stream (in) {...}>

> (read-char *my-stream*)
#\T

> (read-char *my-stream*)
#\e

> (do (until (eq 'eof (peek-char *my-stream*))
        (display (read-char *my-stream*)))
      (terpri)
      (read-char *my-stream*))
; ste
;
eof

> (close-stream *my-stream*)
t

> (read-char *stdout*)
(lit error "{} is not an input stream" #<stream (out) {...}>)

> (read-char *my-stream*)
(lit error "The stream {} is closed" #<stream (in) {...}>)

> (read-char 2/3)
(lit error "{} is not a stream" 2/3)
#+end_example

**** ~(peek-char stream)~

Lê um  único caractere no stream  de entrada informado, sem  avançar o
ponteiro de leitura do stream.

Caso  o stream  não seja  de  entrada, ou  caso seja  o stream  esteja
fechado,   ou   caso  ~stream~   não   seja   um  stream,   retorna   um
erro.

Contrariamente, será retornado  o caractere lido ou, caso  o stream de
entrada tenha se esgotado, será retornado o símbolo ~eof~.

Se houver  algum outro  problema no processo  de leitura,  essa função
poderá também retornar um erro indicando o problema em questão.

Supondo um  arquivo-texto ~teste.txt~  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final...

#+begin_example
Teste
#+end_example

...os exemplos a seguir utilizam-se de tal arquivo.

#+begin_example
> (def *my-stream* (open-stream 'in "teste.txt"))
*my-stream*

> *my-stream*
#<stream (in) {...}>

> (peek-char *my-stream*)
#\T

> (peek-char *my-stream*)
#\T

> (do (until (eq 'eof (peek-char *my-stream*))
        (display (read-char *my-stream*)))
      (terpri)
      (peek-char *my-stream*))
; Teste
;
eof

> (close-stream *my-stream*)
t

> (peek-char *stdout*)
(lit error "{} is not an input stream" #<stream (out) {...}>)

> (peek-char *my-stream*)
(lit error "The stream {} is closed" #<stream (in) {...}>)

> (peek-char 2/3)
(lit error "{} is not a stream" 2/3)
#+end_example

**** ~(write-char c stream)~

Escreve o  caractere ~c~  no stream  de saída  informado, sem  espaço em
branco ao final.

Caso o stream não  seja de saída, ou caso o  stream esteja fechado, ou
caso  ~stream~ não  seja  um stream,  retorna  um erro.  Contrariamente,
retorna ~nil~.

Se houver  algum outro  problema no processo  de escrita,  essa função
poderá também retornar um erro indicando o problema em questão.

#+begin_example
> (let ((stream *stdout*))
    (write-char #\a stream))
; a
nil

> (let ((stream (open-stream 'out "teste.txt")))
    (close-stream stream)
    (write-char #\a stream))
(lit error "The stream {} is closed" #<stream (out) {...}>)

> (let ((stream *stdin*))
    (write-char #\a stream))
(lit error "{} is not an output stream" #<stream (in) {...}>)

> (write-char #\a 5)
(lit error "{} is not a stream" 5)

> (write-char 5 *stdout*)
(lit error "{} is not a character" 5)
#+end_example

**** ~(write-string str stream)~

Escreve  a string  ~str~ no  stream de  saída informado,  sem espaço  em
branco ao final.

A string escrita no stream, após  sua formatação, não deverá ter aspas
duplas (~"~) ao início, e nem ao final.

Caso o stream não  seja de saída, ou caso o  stream esteja fechado, ou
caso  ~stream~ não  seja  um stream,  retorna  um erro.  Contrariamente,
retorna ~nil~.

Se houver  algum outro  problema no processo  de escrita,  essa função
poderá também retornar um erro indicando o problema em questão.

#+begin_example
> (let ((stream *stdout*))
    (write-string "Hello" stream))
; Hello
nil

> (let ((stream (open-stream 'out "teste.txt")))
    (close-stream stream)
    (write-string "Hello" stream))
(lit error "The stream {} is closed" #<stream (out) {...}>)

> (let ((stream *stdin*))
    (write-string "Hello" stream))
(lit error "{} is not an output stream" #<stream (in) {...}>)

> (write-string "Hello" 5)
(lit error "{} is not a stream" 5)

> (write-string 5 *stdout*)
(lit error "{} is not a string" 5)
#+end_example

** TODO Formas Especiais
*** ~(quote x)~

Toma ~x~ como um valor, isto é, sem que ~x~ seja interpretado.

#+begin_example
> (quote x)
x

> (quote (1 2 3))
(1 2 3)

> (quote (+ 5 6))
(+ 5 6)
#+end_example

