A-especificacao.html

<li><a id="orgb2524f9"></a><code>(read stream)</code><br />
<div class="outline-text-5" id="text-11-7-2-2">
<p>
Lê um objeto  no stream de entrada informado, avançando  o ponteiro de
leitura do stream até onde for possível.
</p>

<p>
O texto lido  passa pelo processo de <i>parsing</i> da  própria linguagem, de
forma que uma única expressão válida  seja lida a partir do arquivo, e
então  retornada  sem passar  pelo  processo  de interpretação.  Sendo
assim,  <code>read</code> pode  ser considerado  o ponto  de entrada  do <i>parser</i>  de
Majestic Lisp.
</p>

<p>
Caso  haja um  erro no  processo de  <i>parsing</i>, será  retornado um  erro
correspondente ao problema em tal processo.
</p>

<p>
Caso  o stream  não seja  de  entrada, ou  caso seja  o stream  esteja
fechado,   ou   caso  <code>stream</code>   não   seja   um  stream,   retorna   um
erro.
</p>

<p>
Contrariamente,   será   retornado   um  objeto   de   Majestic   Lisp
correspondente à expressão lida ou, caso  o stream de entrada tenha se
esgotado, será retornado o símbolo <code>eof</code>.
</p>

<p>
Se houver  algum outro  problema no processo  de leitura,  essa função
poderá também retornar um erro indicando o problema em questão.
</p>

<p>
Supondo um  arquivo-texto <code>teste.txt</code>  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final&#x2026;
</p>

<pre class="example" id="org7c279a9">
(foo bar baz) (1 2 3)
</pre>

<p>
&#x2026;os exemplos a seguir utilizam-se de tal arquivo.
</p>

<pre class="example" id="orgff98428">
&gt; (def *my-stream* (open-stream 'in "teste.txt"))
*my-stream*

&gt; *my-stream*
#&lt;stream (in) {...}&gt;

&gt; (read *my-stream*)
(foo bar baz)

&gt; (read *my-stream*)
(1 2 3)

&gt; (read *my-stream*)
eof

&gt; (read *stdout*)
(lit error "{} is not an input stream" #&lt;stream (out) {...}&gt;)

&gt; (close-stream *my-stream*)
t

&gt; (read *my-stream*)
(lit error "The stream {} is closed" #&lt;stream (in) {...}&gt;)

&gt; (read 2/3)
(lit error "{} is not a stream" 2/3)
</pre>
</div>
</li>

<li><a id="orgd5c0976"></a><code>(read-char stream)</code><br />
<div class="outline-text-5" id="text-11-7-2-3">
<p>
Lê  um único  caractere no  stream de  entrada informado,  avançando o
ponteiro de leitura do stream, caso seja possível.
</p>

<p>
Caso  o stream  não seja  de  entrada, ou  caso seja  o stream  esteja
fechado,   ou   caso  <code>stream</code>   não   seja   um  stream,   retorna   um
erro.
</p>

<p>
Contrariamente, será retornado  o caractere lido ou, caso  o stream de
entrada tenha se esgotado, será retornado o símbolo <code>eof</code>.
</p>

<p>
Se houver  algum outro  problema no processo  de leitura,  essa função
poderá também retornar um erro indicando o problema em questão.
</p>

<p>
Supondo um  arquivo-texto <code>teste.txt</code>  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final&#x2026;
</p>

<pre class="example" id="org8a79360">
Teste
</pre>

<p>
&#x2026;os exemplos a seguir utilizam-se de tal arquivo.
</p>

<pre class="example" id="org74847f8">
&gt; (def *my-stream* (open-stream 'in "teste.txt"))
*my-stream*

&gt; *my-stream*
#&lt;stream (in) {...}&gt;

&gt; (read-char *my-stream*)
#\T

&gt; (read-char *my-stream*)
#\e

&gt; (do (until (eq 'eof (peek-char *my-stream*))
        (display (read-char *my-stream*)))
      (terpri)
      (read-char *my-stream*))
; ste
;
eof

&gt; (close-stream *my-stream*)
t

&gt; (read-char *stdout*)
(lit error "{} is not an input stream" #&lt;stream (out) {...}&gt;)

&gt; (read-char *my-stream*)
(lit error "The stream {} is closed" #&lt;stream (in) {...}&gt;)

&gt; (read-char 2/3)
(lit error "{} is not a stream" 2/3)
</pre>
</div>
</li>

<li><a id="org113b196"></a><code>(peek-char stream)</code><br />
<div class="outline-text-5" id="text-11-7-2-4">
<p>
Lê um  único caractere no stream  de entrada informado, sem  avançar o
ponteiro de leitura do stream.
</p>

<p>
Caso  o stream  não seja  de  entrada, ou  caso seja  o stream  esteja
fechado,   ou   caso  <code>stream</code>   não   seja   um  stream,   retorna   um
erro.
</p>

<p>
Contrariamente, será retornado  o caractere lido ou, caso  o stream de
entrada tenha se esgotado, será retornado o símbolo <code>eof</code>.
</p>

<p>
Se houver  algum outro  problema no processo  de leitura,  essa função
poderá também retornar um erro indicando o problema em questão.
</p>

<p>
Supondo um  arquivo-texto <code>teste.txt</code>  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final&#x2026;
</p>

<pre class="example" id="org6302d1a">
Teste
</pre>

<p>
&#x2026;os exemplos a seguir utilizam-se de tal arquivo.
</p>

<pre class="example" id="org65520ee">
&gt; (def *my-stream* (open-stream 'in "teste.txt"))
*my-stream*

&gt; *my-stream*
#&lt;stream (in) {...}&gt;

&gt; (peek-char *my-stream*)
#\T

&gt; (peek-char *my-stream*)
#\T

&gt; (do (until (eq 'eof (peek-char *my-stream*))
        (display (read-char *my-stream*)))
      (terpri)
      (peek-char *my-stream*))
; Teste
;
eof

&gt; (close-stream *my-stream*)
t

&gt; (peek-char *stdout*)
(lit error "{} is not an input stream" #&lt;stream (out) {...}&gt;)

&gt; (peek-char *my-stream*)
(lit error "The stream {} is closed" #&lt;stream (in) {...}&gt;)

&gt; (peek-char 2/3)
(lit error "{} is not a stream" 2/3)
</pre>
</div>
</li>

<li><a id="orgdbc601d"></a><code>(write-char c stream)</code><br />
<div class="outline-text-5" id="text-11-7-2-5">
<p>
Escreve o  caractere <code>c</code>  no stream  de saída  informado, sem  espaço em
branco ao final.
</p>

<p>
Caso o stream não  seja de saída, ou caso o  stream esteja fechado, ou
caso  <code>stream</code> não  seja  um stream,  retorna  um erro.  Contrariamente,
retorna <code>nil</code>.
</p>

<p>
Se houver  algum outro  problema no processo  de escrita,  essa função
poderá também retornar um erro indicando o problema em questão.
</p>

<pre class="example" id="orgb975866">
&gt; (let ((stream *stdout*))
    (write-char #\a stream))
; a
nil

&gt; (let ((stream (open-stream 'out "teste.txt")))
    (close-stream stream)
    (write-char #\a stream))
(lit error "The stream {} is closed" #&lt;stream (out) {...}&gt;)

&gt; (let ((stream *stdin*))
    (write-char #\a stream))
(lit error "{} is not an output stream" #&lt;stream (in) {...}&gt;)

&gt; (write-char #\a 5)
(lit error "{} is not a stream" 5)

&gt; (write-char 5 *stdout*)
(lit error "{} is not a character" 5)
</pre>
</div>
</li>

<li><a id="org48dde3f"></a><code>(write-string str stream)</code><br />
<div class="outline-text-5" id="text-11-7-2-6">
<p>
Escreve  a string  <code>str</code> no  stream de  saída informado,  sem espaço  em
branco ao final.
</p>

<p>
A string escrita no stream, após  sua formatação, não deverá ter aspas
duplas (<code>"</code>) ao início, e nem ao final.
</p>

<p>
Caso o stream não  seja de saída, ou caso o  stream esteja fechado, ou
caso  <code>stream</code> não  seja  um stream,  retorna  um erro.  Contrariamente,
retorna <code>nil</code>.
</p>

<p>
Se houver  algum outro  problema no processo  de escrita,  essa função
poderá também retornar um erro indicando o problema em questão.
</p>

<pre class="example" id="org20cefc2">
&gt; (let ((stream *stdout*))
    (write-string "Hello" stream))
; Hello
nil

&gt; (let ((stream (open-stream 'out "teste.txt")))
    (close-stream stream)
    (write-string "Hello" stream))
(lit error "The stream {} is closed" #&lt;stream (out) {...}&gt;)

&gt; (let ((stream *stdin*))
    (write-string "Hello" stream))
(lit error "{} is not an output stream" #&lt;stream (in) {...}&gt;)

&gt; (write-string "Hello" 5)
(lit error "{} is not a stream" 5)

&gt; (write-string 5 *stdout*)
(lit error "{} is not a string" 5)
</pre>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orge549ebd" class="outline-3">
<h3 id="orge549ebd"><span class="section-number-3">11.8.</span> <span class="todo TODO">TODO</span> Formas Especiais</h3>
<div class="outline-text-3" id="text-11-8">
</div>
<div id="outline-container-orgbf4e46d" class="outline-4">
<h4 id="orgbf4e46d"><span class="section-number-4">11.8.1.</span> <code>(quote x)</code></h4>
<div class="outline-text-4" id="text-11-8-1">
<p>
Toma <code>x</code> como um valor, isto é, sem que <code>x</code> seja interpretado.
</p>

<pre class="example" id="orga330213">
&gt; (quote x)
x

&gt; (quote (1 2 3))
(1 2 3)

&gt; (quote (+ 5 6))
(+ 5 6)
</pre>
</div>
</div>
