A-especificacao.org
*** ~(def sym val)~

Associa o  valor ~val~ ao  símbolo ~sym~ no  contexto global, e  retorna o
símbolo ao qual ~val~ foi atribuído.

O objeto ~sym~ não será interpretado, mas deverá ser obrigatoriamente um
símbolo. ~val~ será interpretado antes de ser atribuído.

Caso ~sym~ não seja um símbolo, um erro será levantado.

Caso  ~val~ tenha  problemas  em  sua interpretação,  o  erro gerado  na
interpretação será retornado, e ~sym~ não será atribuído a valor algum.

#+begin_example
> (def x 5)
x

> (def (foo bar) 5)
(lit error "{} is not a symbol" (foo bar))

> (def y (length x))
(lit error "{} is not a proper list" 5)
#+end_example

*** ~(set sym val)~

Redefine o valor associado ao símbolo ~sym~, inserindo ~val~ em seu lugar,
e retorna o símbolo ao qual ~val~ foi atribuído.

O objeto ~sym~ não será interpretado, mas deverá ser obrigatoriamente um
símbolo. ~val~ será interpretado antes de ser atribuído.

Caso ~sym~ não seja um símbolo, um erro será levantado.

Caso  ~val~ tenha  problemas  em  sua interpretação,  o  erro gerado  na
interpretação  será retornado,  e o  valor  associado a  ~sym~ não  será
modificado.

Durante o processo de atribuição,  ~set~ procura o símbolo definido mais
próximo  do escopo  em que  foi  invocado. Sendo  assim, ~set~  primeiro
tentará encontrar o símbolo no escopo léxico atual; caso não encontre,
~set~   procurará   pelo  símbolo   no   escopo   léxico  em   que   foi
invocado. Subsequentemente, caso o  símbolo ainda não seja encontrado,
~set~ procurará tal símbolo no escopo global.

Se  ~sym~  não for  encontrado  em  nenhum  dos  escopos, um  erro  será
retornado.

#+begin_example
> (set x 5)
(lit error "{} is unbound" x)

> (def x 1)
x

> x
1

> (set x 5)
x

> x
5

> (let ((x 6))
    (print "x = {}" x)
    (set x 9)
    (print "x = {}" x))
; x = 6
; x = 9
;
nil

> x
5
#+end_example

*** ~(set-car x val)~

Redefine o /car/ da célula /cons/ ~x~ pelo valor ~val~.

~x~ sempre será interpretado. Portanto, espera-se que o resultado de sua
interpretação  seja  uma  célula  /cons/   (seja  ligada  a  um  símbolo
informado, seja criada através da função ~cons~, ou mesmo criada através
de /quotation/ ou /quasiquotation/).

Caso o resultado da interpretação de  ~x~ não seja uma célula /cons/, será
retornado um  erro. Igualmente, erros na  interpretação de ~x~ e  de ~val~
serão retornados antes que a modificação seja realizada.

Após a modificação, será retornada a célula /cons/ modificada.

É  importante  prestar  atenção  a qual  célula  /cons/,  exatamente,  ~x~
referencia.  Pode ser  interessante copiar  a lista  ou a  célula /cons/
modificada antes que a operação seja realizada.

#+begin_example
> (def x '(1 . 2))
x

> (set-car x 3)
(3 . 2)

> (set-car '(9 . 0) 'f)
(f . 0)

> (let ((x '(4 . 5)))
    (set-car x 9))
(9 . 5)

> x
(3 . 2)

> (let ((a x))
    (set-car a 4))
(4 . 2)

> x
(4 . 2)

> (let ((a (copy x)))
    (set-car a 5))
(5 . 2)

> x
(4 . 2)
#+end_example

*** ~(set-cdr x val)~

Redefine o /cdr/ da célula /cons/ ~x~ pelo valor ~val~.

~x~ sempre será interpretado. Portanto, espera-se que o resultado de sua
interpretação  seja  uma  célula  /cons/   (seja  ligada  a  um  símbolo
informado, seja criada através da função ~cons~, ou mesmo criada através
de /quotation/ ou /quasiquotation/).

Caso o resultado da interpretação de  ~x~ não seja uma célula /cons/, será
retornado um  erro. Igualmente, erros na  interpretação de ~x~ e  de ~val~
serão retornados antes que a modificação seja realizada.

Após a modificação, será retornada a célula /cons/ modificada.

É  importante  prestar  atenção  a qual  célula  /cons/,  exatamente,  ~x~
referencia.  Pode ser  interessante copiar  a lista  ou a  célula /cons/
modificada antes que a operação seja realizada.

#+begin_example
> (def x '(1 . 2))
x

> (set-cdr x 3)
(1 . 3)

> (set-cdr '(9 . 0) 'f)
(9 . f)

> (let ((x '(4 . 5)))
    (set-cdr x 9))
(4 . 9)

> x
(1 . 3)

> (let ((a x))
    (set-cdr a 4))
(1 . 4)

> x
(1 . 4)

> (let ((a (copy x)))
    (set-cdr a 5))
(1 . 5)

> x
(1 . 4)
#+end_example

*** ~(if pred conseq altern)~

Realiza  a  interpretação  de uma  condicional  simples,  efetivamente
realizando controle de fluxo.

A forma  ~pred~ é, inicialmente, interpretada,  constituindo portanto um
/predicado/. Caso o  resultado desse predicado seja  um valor /verdadeiro/
(ou seja, qualquer  valor que não seja o símbolo  ~nil~), a forma ~conseq~
será interpretada, e seu valor será retornado.

Caso contrário,  a forma  ~altern~ será interpretada,  e seu  valor será
retornado.

#+begin_example
> (if (nilp 'a)
      'is-nil
      'is-not-nil)
is-not-nil

> (if (nilp nil)
      'is-nil
      'is-not-nil)
is-nil
#+end_example

Caso  seja necessário  interpretar mais  de uma  forma nos  lugares de
~conseq~ e/ou  ~altern~, recomenda-se associá-las usando  a forma especial
~do~.

*** ~(fn lambda-list . body)~

Gera um /literal/ para uma clausura.  Esta forma especial é similar a um
macro, porém realiza explicitamente a captura do escopo léxico atual.

Uma forma como

#+begin_example
(fn (x) (* x x))
#+end_example

gera um literal

#+begin_example
(lit closure <env> (x) ((* x x)))
#+end_example

onde ~<env>~ é  o contexto léxico no qual a clausura foi declarada.

O corpo  de uma  clausura é  armazenado em  uma lista  com um  ou mais
elementos, onde  cada elemento é  uma expressão individual.  Durante a
aplicação da mesma,  os elementos são avaliados em  sequência (como se
houvesse uma  forma especial  ~do~ implícita),  tendo em  consideração o
contexto léxico ~<env>~ que foi  capturado, extendido com ligações entre
os elementos  da /lambda list/  e os  valores passados como  parâmetro à
clausura.

O literal gerado  pode ser representado, durante a  impressão, como um
objeto que não possa ser lido pelo interpretador.

Para maiores informações, veja /Aplicação/ e /Interpretação/.

#+begin_example
> (fn (x) (* x x))
#<function (fn (x)) {...}>

> (fn (x . rest) (list x rest))
#<function (fn (x . rest)) {...}>

> ((fn (x) (* x x)) 5)
25

> (def square (fn (x) (* x x)))
square

> (square 5)
25
#+end_example

