A-especificacao.html

<div id="outline-container-org535dfd5" class="outline-4">
<h4 id="org535dfd5"><span class="section-number-4">11.8.2.</span> <code>(def sym val)</code></h4>
<div class="outline-text-4" id="text-11-8-2">
<p>
Associa o  valor <code>val</code> ao  símbolo <code>sym</code> no  contexto global, e  retorna o
símbolo ao qual <code>val</code> foi atribuído.
</p>

<p>
O objeto <code>sym</code> não será interpretado, mas deverá ser obrigatoriamente um
símbolo. <code>val</code> será interpretado antes de ser atribuído.
</p>

<p>
Caso <code>sym</code> não seja um símbolo, um erro será levantado.
</p>

<p>
Caso  <code>val</code> tenha  problemas  em  sua interpretação,  o  erro gerado  na
interpretação será retornado, e <code>sym</code> não será atribuído a valor algum.
</p>

<pre class="example" id="org5dc4d2d">
&gt; (def x 5)
x

&gt; (def (foo bar) 5)
(lit error "{} is not a symbol" (foo bar))

&gt; (def y (length x))
(lit error "{} is not a proper list" 5)
</pre>
</div>
</div>

<div id="outline-container-orgef8f555" class="outline-4">
<h4 id="orgef8f555"><span class="section-number-4">11.8.3.</span> <code>(set sym val)</code></h4>
<div class="outline-text-4" id="text-11-8-3">
<p>
Redefine o valor associado ao símbolo <code>sym</code>, inserindo <code>val</code> em seu lugar,
e retorna o símbolo ao qual <code>val</code> foi atribuído.
</p>

<p>
O objeto <code>sym</code> não será interpretado, mas deverá ser obrigatoriamente um
símbolo. <code>val</code> será interpretado antes de ser atribuído.
</p>

<p>
Caso <code>sym</code> não seja um símbolo, um erro será levantado.
</p>

<p>
Caso  <code>val</code> tenha  problemas  em  sua interpretação,  o  erro gerado  na
interpretação  será retornado,  e o  valor  associado a  <code>sym</code> não  será
modificado.
</p>

<p>
Durante o processo de atribuição,  <code>set</code> procura o símbolo definido mais
próximo  do escopo  em que  foi  invocado. Sendo  assim, <code>set</code>  primeiro
tentará encontrar o símbolo no escopo léxico atual; caso não encontre,
<code>set</code>   procurará   pelo  símbolo   no   escopo   léxico  em   que   foi
invocado. Subsequentemente, caso o  símbolo ainda não seja encontrado,
<code>set</code> procurará tal símbolo no escopo global.
</p>

<p>
Se  <code>sym</code>  não for  encontrado  em  nenhum  dos  escopos, um  erro  será
retornado.
</p>

<pre class="example" id="orgacbdda8">
&gt; (set x 5)
(lit error "{} is unbound" x)

&gt; (def x 1)
x

&gt; x
1

&gt; (set x 5)
x

&gt; x
5

&gt; (let ((x 6))
    (print "x = {}" x)
    (set x 9)
    (print "x = {}" x))
; x = 6
; x = 9
;
nil

&gt; x
5
</pre>
</div>
</div>

<div id="outline-container-org9312d62" class="outline-4">
<h4 id="org9312d62"><span class="section-number-4">11.8.4.</span> <code>(set-car x val)</code></h4>
<div class="outline-text-4" id="text-11-8-4">
<p>
Redefine o <i>car</i> da célula <i>cons</i> <code>x</code> pelo valor <code>val</code>.
</p>

<p>
<code>x</code> sempre será interpretado. Portanto, espera-se que o resultado de sua
interpretação  seja  uma  célula  <i>cons</i>   (seja  ligada  a  um  símbolo
informado, seja criada através da função <code>cons</code>, ou mesmo criada através
de <i>quotation</i> ou <i>quasiquotation</i>).
</p>

<p>
Caso o resultado da interpretação de  <code>x</code> não seja uma célula <i>cons</i>, será
retornado um  erro. Igualmente, erros na  interpretação de <code>x</code> e  de <code>val</code>
serão retornados antes que a modificação seja realizada.
</p>

<p>
Após a modificação, será retornada a célula <i>cons</i> modificada.
</p>

<p>
É  importante  prestar  atenção  a qual  célula  <i>cons</i>,  exatamente,  <code>x</code>
referencia.  Pode ser  interessante copiar  a lista  ou a  célula <i>cons</i>
modificada antes que a operação seja realizada.
</p>

<pre class="example" id="org2a6f732">
&gt; (def x '(1 . 2))
x

&gt; (set-car x 3)
(3 . 2)

&gt; (set-car '(9 . 0) 'f)
(f . 0)

&gt; (let ((x '(4 . 5)))
    (set-car x 9))
(9 . 5)

&gt; x
(3 . 2)

&gt; (let ((a x))
    (set-car a 4))
(4 . 2)

&gt; x
(4 . 2)

&gt; (let ((a (copy x)))
    (set-car a 5))
(5 . 2)

&gt; x
(4 . 2)
</pre>
</div>
</div>

<div id="outline-container-orgfc7b2ac" class="outline-4">
<h4 id="orgfc7b2ac"><span class="section-number-4">11.8.5.</span> <code>(set-cdr x val)</code></h4>
<div class="outline-text-4" id="text-11-8-5">
<p>
Redefine o <i>cdr</i> da célula <i>cons</i> <code>x</code> pelo valor <code>val</code>.
</p>

<p>
<code>x</code> sempre será interpretado. Portanto, espera-se que o resultado de sua
interpretação  seja  uma  célula  <i>cons</i>   (seja  ligada  a  um  símbolo
informado, seja criada através da função <code>cons</code>, ou mesmo criada através
de <i>quotation</i> ou <i>quasiquotation</i>).
</p>

<p>
Caso o resultado da interpretação de  <code>x</code> não seja uma célula <i>cons</i>, será
retornado um  erro. Igualmente, erros na  interpretação de <code>x</code> e  de <code>val</code>
serão retornados antes que a modificação seja realizada.
</p>

<p>
Após a modificação, será retornada a célula <i>cons</i> modificada.
</p>

<p>
É  importante  prestar  atenção  a qual  célula  <i>cons</i>,  exatamente,  <code>x</code>
referencia.  Pode ser  interessante copiar  a lista  ou a  célula <i>cons</i>
modificada antes que a operação seja realizada.
</p>

<pre class="example" id="orgef7c730">
&gt; (def x '(1 . 2))
x

&gt; (set-cdr x 3)
(1 . 3)

&gt; (set-cdr '(9 . 0) 'f)
(9 . f)

&gt; (let ((x '(4 . 5)))
    (set-cdr x 9))
(4 . 9)

&gt; x
(1 . 3)

&gt; (let ((a x))
    (set-cdr a 4))
(1 . 4)

&gt; x
(1 . 4)

&gt; (let ((a (copy x)))
    (set-cdr a 5))
(1 . 5)

&gt; x
(1 . 4)
</pre>
</div>
</div>

<div id="outline-container-org32a89e2" class="outline-4">
<h4 id="org32a89e2"><span class="section-number-4">11.8.6.</span> <code>(if pred conseq altern)</code></h4>
<div class="outline-text-4" id="text-11-8-6">
<p>
Realiza  a  interpretação  de uma  condicional  simples,  efetivamente
realizando controle de fluxo.
</p>

<p>
A forma  <code>pred</code> é, inicialmente, interpretada,  constituindo portanto um
<i>predicado</i>. Caso o  resultado desse predicado seja  um valor <i>verdadeiro</i>
(ou seja, qualquer  valor que não seja o símbolo  <code>nil</code>), a forma <code>conseq</code>
será interpretada, e seu valor será retornado.
</p>

<p>
Caso contrário,  a forma  <code>altern</code> será interpretada,  e seu  valor será
retornado.
</p>

<pre class="example" id="orgcfc2ed4">
&gt; (if (nilp 'a)
      'is-nil
      'is-not-nil)
is-not-nil

&gt; (if (nilp nil)
      'is-nil
      'is-not-nil)
is-nil
</pre>

<p>
Caso  seja necessário  interpretar mais  de uma  forma nos  lugares de
<code>conseq</code> e/ou  <code>altern</code>, recomenda-se associá-las usando  a forma especial
<code>do</code>.
</p>
</div>
</div>

<div id="outline-container-org4c27129" class="outline-4">
<h4 id="org4c27129"><span class="section-number-4">11.8.7.</span> <code>(fn lambda-list . body)</code></h4>
<div class="outline-text-4" id="text-11-8-7">
<p>
Gera um <i>literal</i> para uma clausura.  Esta forma especial é similar a um
macro, porém realiza explicitamente a captura do escopo léxico atual.
</p>

<p>
Uma forma como
</p>

<pre class="example" id="org3b5f601">
(fn (x) (* x x))
</pre>

<p>
gera um literal
</p>

<pre class="example" id="org82b26ef">
(lit closure &lt;env&gt; (x) ((* x x)))
</pre>

<p>
onde <code>&lt;env&gt;</code> é  o contexto léxico no qual a clausura foi declarada.
</p>

<p>
O corpo  de uma  clausura é  armazenado em  uma lista  com um  ou mais
elementos, onde  cada elemento é  uma expressão individual.  Durante a
aplicação da mesma,  os elementos são avaliados em  sequência (como se
houvesse uma  forma especial  <code>do</code> implícita),  tendo em  consideração o
contexto léxico <code>&lt;env&gt;</code> que foi  capturado, extendido com ligações entre
os elementos  da <i>lambda list</i>  e os  valores passados como  parâmetro à
clausura.
</p>

<p>
O literal gerado  pode ser representado, durante a  impressão, como um
objeto que não possa ser lido pelo interpretador.
</p>

<p>
Para maiores informações, veja <i>Aplicação</i> e <i>Interpretação</i>.
</p>

<pre class="example" id="orge2dbaf6">
&gt; (fn (x) (* x x))
#&lt;function (fn (x)) {...}&gt;

&gt; (fn (x . rest) (list x rest))
#&lt;function (fn (x . rest)) {...}&gt;

&gt; ((fn (x) (* x x)) 5)
25

&gt; (def square (fn (x) (* x x)))
square

&gt; (square 5)
25
</pre>
</div>
</div>
