A-especificacao.org
*** ~(mac lambda-list . body)~

Gera um literal para um macro. Esta forma especial, na realidade, gera
internamente  uma  clausura  que,  quando  aplicada  a  uma  lista  de
argumentos, transforma essa lista de argumentos em uma nova lista, que
poderá então ser interpretada, de forma subsequente.

Assim,  um macro  também é  capaz  de capturar  o contexto  no qual  é
declarado.

Uma forma como

#+begin_example
(mac (x) `(list ,x))
#+end_example

gera um literal

#+begin_example
(lit macro (lit closure <env> (x) (`(list ,x))))
#+end_example

onde ~<env>~ é  o contexto léxico no qual o macro foi declarado.

As regras  sintáticas da  forma especial  ~mac~ acabam  sendo exatamente
iguais às da forma ~fn~, pela  definição de que um /macro/ constitui-se de
uma clausura subjacente.

Um /macro/ não pode ser aplicado  através da forma ~apply~, porém pode ser
aplicado  como se  fosse  uma  clausura comum.  Neste  caso, o  objeto
aplicado gera uma nova expressão que será imediatamente interpretada.

O uso do macro poderá ser verificado através de atribuí-lo a um nome e
então realizar apenas a expansão do  mesmo, através de uma função como
~macroexpand-1~.

O literal gerado  pode ser representado, durante a  impressão, como um
objeto que não possa ser lido pelo interpretador.

#+begin_example
> (mac (x) `(list ,x))
#<macro (mac (x)) {...}>

> ((mac (x) `(list ,x)) 5)
(5)

> (def encapsulate (mac (x) `(list ,x)))
encapsulate

> (macroexpand-1 '(encapsulate 5))
(list 5)

> (encapsulate 5)
(5)
#+end_example

*** ~(quasiquote x)~, ~(unquote x)~, ~(unquote-splice x)~

Percorre recursivamente ~x~, alternando todas  as formas iniciadas com o
símbolo ~unquote~ por  sua interpretação no contexto atual.
Caso ~x~ seja meramente um símbolo ou uma lista sem ~unquote~, o resultado
será o mesmo de ~quote~:

#+begin_example
> (quote a)
a

> (quasiquote a)
a
#+end_example

Caso não o seja, o resultado será uma nova lista ou objeto, tal que os
elementos sob ~unquote~ sejam trocados em seus lugares corretos.

#+begin_example
> (let ((x 5)  (y 6))
    (quasiquote (1 (unquote x) (unquote y))))
(1 5 6)
#+end_example

Caso queiramos  anexar os  elementos de uma  lista diretamente  em uma
lista atual, podemos usar ~unquote-splice~ para fazê-lo.

#+begin_example
> (let ((lst (list 1 2 3)))
    (quasiquote (0 (unquote lst))))
(0 (1 2 3))

> (let ((lst (list 1 2 3)))
    (quasiquote (0 (unquote-splice lst))))
(0 1 2 3)
#+end_example

*** ~(do . rest)~

Interpreta os  valores de  cada uma das  expressões contidas  na lista
~rest~, e então retorna o valor da última expressões.

Se alguma expressão emitir um  erro, a interpretação será interrompida
e o erro será retornado.

Caso não haja expressões disponíveis, retorna ~nil~.

#+begin_example
> (do 'a 'b (list 'c 'd 'e))
(c d e)

> (do)
nil
#+end_example

Alguns  macros  e  formas  especiais  utilizam  ~do~'s  implícitos  para
possibilitar declarações menos  redundantes. Para maiores informações,
veja as formas  especiais ~fn~, ~mac~ e ~letrec~, e  os macros ~defn~, ~defmac~,
~let~, ~let*~, ~letfn~, ~letfn*~, ~when~, ~unless~ e ~cond~.

*** TODO ~(apply fun args)~

# TODO:  Se fun  e args  serão  interpretados, apply  não deveria  ser
# apenas uma função primitiva?

Aplica a função ~fun~ à lista de argumentos ~args~. Ambos ~fun~ e ~args~ serão
interpretados antes de serem apropriadamente aplicados.

~fun~  não  pode ser  um  macro.  Macros  possuem uso  especialmente  em
situações de reescrita de código, o  que constitui um tipo especial de
aplicação, a ser feita antes de uma interpretação propriamente dita.

Esta operação equivale  a interpretar o resultado de  ~(cons fun args)~,
portanto,  a  função  ~fun~  e  cada um  dos  argumentos  em  ~args~  será
devidamente interpretado antes de realizar a aplicação.

#+begin_example
> (let ((fun (fn (x y) (+ x y))))
    (apply fun '(1 2)))
3

> (apply cond '((t 1)))
(lit error "Macros cannot be applied")

> (apply 1 '(2))
(lit error "Cannot apply {} to args {}" 1 (2))
#+end_example

*** ~(while pred . body)~

Executa  sequencialmente o  conjunto  de expressões  contidas em  ~body~
enquanto o predicado ~pred~ retornar um valor verdadeiro.

A forma ~while~ permite executar  código iterativamente, com garantia de
que o processo de iteração em si  não faça com que a pilha de chamadas
do sistema chegue à exaustão.

O valor  retornado pela forma  especial ~while~  será o valor  da última
expressão de ~body~,  ao ser executada na última  iteração. Caso nenhuma
iteração tenha ainda ocorrido, será retornado o símbolo ~nil~.

~body~  também poderá  ser uma  expressão vazia,  o que  configuraria um
/spinlock/ na duração da validade do predicado.

Caso o  predicado ~pred~ ou alguma  expressão de ~body~ retornem  erros, o
laço de ~while~ será imediatamente quebrado e o erro será retornado.

#+begin_example
> (let ((x 0))
    (while (< x 5)
      (print "x = {}" x)
      (set x (1+ x))))
; x = 0
; x = 1
; x = 2
; x = 3
; x = 4
;
x

> (let ((lst '(1 2 3 a 5)))
    (while (not (nilp lst))
      (let (((num . rest) lst))
        (print "2 = {}? {}"
               num
               (= 2 num))
        (set lst rest))))
; 2 = 1? nil
; 2 = 2? t
; 2 = 3? nil
;
(lit error "{} is not a number" a)

> (let ((lst '(1 2 3 NaN 5)))
    (while (< (car lst) 5)
      (let (((num . rest) lst))
        (print "{}" num)
        (set lst rest))))
; 1
; 2
; 3
;
(lit error "{} is not a number" NaN)
#+end_example

*** ~(and . rest)~

Interpreta os  valores de  cada uma das  expressões contidas  na lista
~rest~,  enquanto as  interpretações  resultarem em  valores não-~nil~,  e
então retorna o valor da última expressão.

Quando  uma  expressão  gera  um  resultado  ~nil~,  a  interpretação  é
interrompida, como anteriormente citado, e ~nil~ é retornado.

Se alguma expressão emitir um  erro, a interpretação será interrompida
e o erro será retornado.

Caso não haja expressões disponíveis, retorna ~t~.

#+begin_example
> (and (= 1 1) (= 0.5 1/2) 'ok)
ok

> (and (= 1 1) (< 0.5 1/2) 'ok)
nil

> (and)
t
#+end_example

*** ~(or . rest)~

Interpreta os  valores de  cada uma das  expressões contidas  na lista
~rest~, enquanto as interpretações resultarem no valor ~nil~.

Quando  uma expressão  gera um  resultado não-~nil~,  a interpretação  é
interrompida, como anteriormente citado, e o valor da interpretação da
expressão em questão é retornado.

Se alguma expressão emitir um  erro, a interpretação será interrompida
e o erro será retornado.

Caso não haja expressões disponíveis, retorna ~nil~.

#+begin_example
> (or (not (= 1 1)) (< 0.5 1/2) 'ok)
ok

> (or (= 1 1) (< 0.5 1/2))
t

> (or)
nil
#+end_example

