A-especificacao.html

<div id="outline-container-org98fe1ff" class="outline-4">
<h4 id="org98fe1ff"><span class="section-number-4">11.8.8.</span> <code>(mac lambda-list . body)</code></h4>
<div class="outline-text-4" id="text-11-8-8">
<p>
Gera um literal para um macro. Esta forma especial, na realidade, gera
internamente  uma  clausura  que,  quando  aplicada  a  uma  lista  de
argumentos, transforma essa lista de argumentos em uma nova lista, que
poderá então ser interpretada, de forma subsequente.
</p>

<p>
Assim,  um macro  também é  capaz  de capturar  o contexto  no qual  é
declarado.
</p>

<p>
Uma forma como
</p>

<pre class="example" id="orgfe4cd9a">
(mac (x) `(list ,x))
</pre>

<p>
gera um literal
</p>

<pre class="example" id="orgc780041">
(lit macro (lit closure &lt;env&gt; (x) (`(list ,x))))
</pre>

<p>
onde <code>&lt;env&gt;</code> é  o contexto léxico no qual o macro foi declarado.
</p>

<p>
As regras  sintáticas da  forma especial  <code>mac</code> acabam  sendo exatamente
iguais às da forma <code>fn</code>, pela  definição de que um <i>macro</i> constitui-se de
uma clausura subjacente.
</p>

<p>
Um <i>macro</i> não pode ser aplicado  através da forma <code>apply</code>, porém pode ser
aplicado  como se  fosse  uma  clausura comum.  Neste  caso, o  objeto
aplicado gera uma nova expressão que será imediatamente interpretada.
</p>

<p>
O uso do macro poderá ser verificado através de atribuí-lo a um nome e
então realizar apenas a expansão do  mesmo, através de uma função como
<code>macroexpand-1</code>.
</p>

<p>
O literal gerado  pode ser representado, durante a  impressão, como um
objeto que não possa ser lido pelo interpretador.
</p>

<pre class="example" id="org0193459">
&gt; (mac (x) `(list ,x))
#&lt;macro (mac (x)) {...}&gt;

&gt; ((mac (x) `(list ,x)) 5)
(5)

&gt; (def encapsulate (mac (x) `(list ,x)))
encapsulate

&gt; (macroexpand-1 '(encapsulate 5))
(list 5)

&gt; (encapsulate 5)
(5)
</pre>
</div>
</div>

<div id="outline-container-org84551ca" class="outline-4">
<h4 id="org84551ca"><span class="section-number-4">11.8.9.</span> <code>(quasiquote x)</code>, <code>(unquote x)</code>, <code>(unquote-splice x)</code></h4>
<div class="outline-text-4" id="text-11-8-9">
<p>
Percorre recursivamente <code>x</code>, alternando todas  as formas iniciadas com o
símbolo <code>unquote</code> por  sua interpretação no contexto atual.
Caso <code>x</code> seja meramente um símbolo ou uma lista sem <code>unquote</code>, o resultado
será o mesmo de <code>quote</code>:
</p>

<pre class="example" id="orgf17310e">
&gt; (quote a)
a

&gt; (quasiquote a)
a
</pre>

<p>
Caso não o seja, o resultado será uma nova lista ou objeto, tal que os
elementos sob <code>unquote</code> sejam trocados em seus lugares corretos.
</p>

<pre class="example" id="org3e6b2b6">
&gt; (let ((x 5)  (y 6))
    (quasiquote (1 (unquote x) (unquote y))))
(1 5 6)
</pre>

<p>
Caso queiramos  anexar os  elementos de uma  lista diretamente  em uma
lista atual, podemos usar <code>unquote-splice</code> para fazê-lo.
</p>

<pre class="example" id="org6f4df1e">
&gt; (let ((lst (list 1 2 3)))
    (quasiquote (0 (unquote lst))))
(0 (1 2 3))

&gt; (let ((lst (list 1 2 3)))
    (quasiquote (0 (unquote-splice lst))))
(0 1 2 3)
</pre>
</div>
</div>

<div id="outline-container-org726a052" class="outline-4">
<h4 id="org726a052"><span class="section-number-4">11.8.10.</span> <code>(do . rest)</code></h4>
<div class="outline-text-4" id="text-11-8-10">
<p>
Interpreta os  valores de  cada uma das  expressões contidas  na lista
<code>rest</code>, e então retorna o valor da última expressões.
</p>

<p>
Se alguma expressão emitir um  erro, a interpretação será interrompida
e o erro será retornado.
</p>

<p>
Caso não haja expressões disponíveis, retorna <code>nil</code>.
</p>

<pre class="example" id="org2220873">
&gt; (do 'a 'b (list 'c 'd 'e))
(c d e)

&gt; (do)
nil
</pre>

<p>
Alguns  macros  e  formas  especiais  utilizam  <code>do</code>'s  implícitos  para
possibilitar declarações menos  redundantes. Para maiores informações,
veja as formas  especiais <code>fn</code>, <code>mac</code> e <code>letrec</code>, e  os macros <code>defn</code>, <code>defmac</code>,
<code>let</code>, <code>let*</code>, <code>letfn</code>, <code>letfn*</code>, <code>when</code>, <code>unless</code> e <code>cond</code>.
</p>
</div>
</div>

<div id="outline-container-org08f2467" class="outline-4">
<h4 id="org08f2467"><span class="section-number-4">11.8.11.</span> <span class="todo TODO">TODO</span> <code>(apply fun args)</code></h4>
<div class="outline-text-4" id="text-11-8-11">
<p>
Aplica a função <code>fun</code> à lista de argumentos <code>args</code>. Ambos <code>fun</code> e <code>args</code> serão
interpretados antes de serem apropriadamente aplicados.
</p>

<p>
<code>fun</code>  não  pode ser  um  macro.  Macros  possuem uso  especialmente  em
situações de reescrita de código, o  que constitui um tipo especial de
aplicação, a ser feita antes de uma interpretação propriamente dita.
</p>

<p>
Esta operação equivale  a interpretar o resultado de  <code>(cons fun args)</code>,
portanto,  a  função  <code>fun</code>  e  cada um  dos  argumentos  em  <code>args</code>  será
devidamente interpretado antes de realizar a aplicação.
</p>

<pre class="example" id="org2b5db6f">
&gt; (let ((fun (fn (x y) (+ x y))))
    (apply fun '(1 2)))
3

&gt; (apply cond '((t 1)))
(lit error "Macros cannot be applied")

&gt; (apply 1 '(2))
(lit error "Cannot apply {} to args {}" 1 (2))
</pre>
</div>
</div>

<div id="outline-container-org60aa373" class="outline-4">
<h4 id="org60aa373"><span class="section-number-4">11.8.12.</span> <code>(while pred . body)</code></h4>
<div class="outline-text-4" id="text-11-8-12">
<p>
Executa  sequencialmente o  conjunto  de expressões  contidas em  <code>body</code>
enquanto o predicado <code>pred</code> retornar um valor verdadeiro.
</p>

<p>
A forma <code>while</code> permite executar  código iterativamente, com garantia de
que o processo de iteração em si  não faça com que a pilha de chamadas
do sistema chegue à exaustão.
</p>

<p>
O valor  retornado pela forma  especial <code>while</code>  será o valor  da última
expressão de <code>body</code>,  ao ser executada na última  iteração. Caso nenhuma
iteração tenha ainda ocorrido, será retornado o símbolo <code>nil</code>.
</p>

<p>
<code>body</code>  também poderá  ser uma  expressão vazia,  o que  configuraria um
<i>spinlock</i> na duração da validade do predicado.
</p>

<p>
Caso o  predicado <code>pred</code> ou alguma  expressão de <code>body</code> retornem  erros, o
laço de <code>while</code> será imediatamente quebrado e o erro será retornado.
</p>

<pre class="example" id="org4ac24e3">
&gt; (let ((x 0))
    (while (&lt; x 5)
      (print "x = {}" x)
      (set x (1+ x))))
; x = 0
; x = 1
; x = 2
; x = 3
; x = 4
;
x

&gt; (let ((lst '(1 2 3 a 5)))
    (while (not (nilp lst))
      (let (((num . rest) lst))
        (print "2 = {}? {}"
               num
               (= 2 num))
        (set lst rest))))
; 2 = 1? nil
; 2 = 2? t
; 2 = 3? nil
;
(lit error "{} is not a number" a)

&gt; (let ((lst '(1 2 3 NaN 5)))
    (while (&lt; (car lst) 5)
      (let (((num . rest) lst))
        (print "{}" num)
        (set lst rest))))
; 1
; 2
; 3
;
(lit error "{} is not a number" NaN)
</pre>
</div>
</div>

<div id="outline-container-orgc06bf0f" class="outline-4">
<h4 id="orgc06bf0f"><span class="section-number-4">11.8.13.</span> <code>(and . rest)</code></h4>
<div class="outline-text-4" id="text-11-8-13">
<p>
Interpreta os  valores de  cada uma das  expressões contidas  na lista
<code>rest</code>,  enquanto as  interpretações  resultarem em  valores não-<code>nil</code>,  e
então retorna o valor da última expressão.
</p>

<p>
Quando  uma  expressão  gera  um  resultado  <code>nil</code>,  a  interpretação  é
interrompida, como anteriormente citado, e <code>nil</code> é retornado.
</p>

<p>
Se alguma expressão emitir um  erro, a interpretação será interrompida
e o erro será retornado.
</p>

<p>
Caso não haja expressões disponíveis, retorna <code>t</code>.
</p>

<pre class="example" id="orgeff689a">
&gt; (and (= 1 1) (= 0.5 1/2) 'ok)
ok

&gt; (and (= 1 1) (&lt; 0.5 1/2) 'ok)
nil

&gt; (and)
t
</pre>
</div>
</div>

<div id="outline-container-org3664058" class="outline-4">
<h4 id="org3664058"><span class="section-number-4">11.8.14.</span> <code>(or . rest)</code></h4>
<div class="outline-text-4" id="text-11-8-14">
<p>
Interpreta os  valores de  cada uma das  expressões contidas  na lista
<code>rest</code>, enquanto as interpretações resultarem no valor <code>nil</code>.
</p>

<p>
Quando  uma expressão  gera um  resultado não-<code>nil</code>,  a interpretação  é
interrompida, como anteriormente citado, e o valor da interpretação da
expressão em questão é retornado.
</p>

<p>
Se alguma expressão emitir um  erro, a interpretação será interrompida
e o erro será retornado.
</p>

<p>
Caso não haja expressões disponíveis, retorna <code>nil</code>.
</p>

<pre class="example" id="org97149ca">
&gt; (or (not (= 1 1)) (&lt; 0.5 1/2) 'ok)
ok

&gt; (or (= 1 1) (&lt; 0.5 1/2))
t

&gt; (or)
nil
</pre>
</div>
</div>
