A-especificacao.org
*** ~(letrec bindings . body)~

Define uma lista de funções que serão bem-definidas durante a execução
da expressão ~body~.

~bindings~  é uma  lista  de  definições de  funções  similares a  ~defn~,
todavia  sem o  símbolo ~defn~  em seu  início. ~letrec~  segue as  mesmas
regras sintáticas de ~letfn~ e ~letfn*~.

O funcionamento de ~letrec~ aproxima-se muito  do uso prático de ~letfn~ e
~letfn*~.  Todavia,  ~letrec~ permite  a declaração de  /funções mutuamente
recursivas/,    *puramente    através     de    um    contexto    léxico
compartilhado*.   Para  tanto,  cada  função ali  declarada  captura  o
próprio contexto criado por ~letrec~ /após a definição/ das mesmas.

Essa característica torna ~letrec~  fundamentalmente diferente de ~letfn~,
uma vez que  todas as funções envolvidas terão  referências às funções
ali  declaradas. Em  outras palavras,  o uso  recursivo de  uma função
declarada com  ~letrec~ não implica em  procura da mesma em  um contexto
"dinâmico" (ou seja, no contexto onde tal função foi chamada).

Um  bloco ~letrec~  pode, portanto,  retornar uma  de suas  clausuras, e
qualquer recursão ou recursão mútua  na mesma não será degenerada pela
procura recursiva de  uma das funções declaradas no  contexto onde for
executada.

Como esse  tipo de operação exige  modificar a forma como  funções são
declaradas  -- mais  precisamente,  modificar a  forma  como ocorre  a
captura  de  contexto  --,  ~letrec~ precisa  ser  uma  forma  especial,
diferente de ~letfn~ e ~let~, que podem ser declarados como macros.

#+begin_example
> (letrec ((foo ()
             (print "Calling foo")
             (bar))
           (bar ()
             (print "Calling bar")
             (baz))
           (baz ()
             (print "Calling baz")))
    (foo))
; Calling foo
; Calling bar
; Calling baz
; 
nil

> (letrec ((iter (x)
             (if (> x 0)
                 (do (print "Recursion #{}" x)
                     (iter (1- x)))
                 'finished)))
    (iter 5))
; Recursion #5
; Recursion #4
; Recursion #3
; Recursion #2
; Recursion #1
; 
finished

> (def my-function
       (letrec ((foo () (bar))
                (bar ()
                  (print "Hello from bar on letrec")))
         foo))
my-function

> (my-function)
; Hello from bar on letrec
; 
nil
#+end_example

*** ~(unwind-protect expr cleanup)~

~unwind-protect~ interpreta  a expressão protegida ~expr~  e, independente
de  tal  interpretação resultar  em  falha,  garante que  a  expressão
~cleanup~ seja sempre interpretada em seguida.

~unwind-protect~ deve retornar a  interpretação de ~expr~, independente de
a mesma ser um erro ou não. O resultado de ~cleanup~ será ignorado.

~unwind-protect~  é uma  forma especial  utilizada para  garantir certos
efeitos colaterais  como forma  de limpeza após  a execução  de certas
expressões[fn:5], e não  realiza prevenções contra falhas  em casos de
terminação anormal do processo de interpretação.

Por exemplo, ~unwind-protect~ não garante que, mediante uma operação que
faça  com que  a aplicação  entre em  um estado  irrecuperável, ocorra
algum  tipo  de limpeza;  neste  tipo  de  situação, espera-se  que  a
aplicação encerre-se imediatamente.

Supondo um  arquivo-texto ~teste.txt~  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final...

#+begin_example
Teste
#+end_example

...os exemplos a seguir utilizam-se de tal arquivo.

#+begin_example
> (def *my-stream* nil)
*my-stream*

> (unwind-protect
      (do (set *my-stream* (open-stream 'in "teste.txt"))
          (read-char *my-stream*))
    (do (close-stream *my-stream*)
        (set *my-stream* nil)))
#\T

> *my-stream*
nil

> (do (set *my-stream* (open-stream 'out "teste.txt"))
      (read-char *my-stream*))
(lit error "{} is not an input stream" #<stream (out) {...}>)

> *my-stream*
#<stream (out) {...}>

> (do (close-stream *my-stream*)
      (set *my-stream* nil))
*my-stream*

> *my-stream*
nil

> (unwind-protect
      (do (set *my-stream* (open-stream 'out "teste.txt"))
          (read-char *my-stream*))
    (do (close-stream *my-stream*)
        (set *my-stream* nil)))
(lit error "{} is not an input stream" #<stream (out) {...}>)

> *my-stream*
nil
#+end_example

** Macros do leitor de expressões

*** Quote (~'~)

O macro de leitor ~'~ aplica a  forma especial ~quote~ ao próximo objeto a
ser lido.

Esse  símbolo deverá  ser apresentado  junto  ao objeto  à direita  do
mesmo, sem espaços separando-os.

Por exemplo, os objetos quotados a seguir

#+begin_example
(quote a)
(quote (1 2 3))
#+end_example

poderão ser reescritos usando o macro de leitor da seguinte forma:

#+begin_example
'a
'(1 2 3)
#+end_example

*** Quasiquote (~`~)

O macro  de leitor ~`~  ajuda a escrever  o processo de  quasiquoting de
forma  sucinta. Em  suma,  o  próximo objeto  a  ser  lido deverá  ser
englobado em uma forma especial de ~quasiquote~.

Esse  símbolo deverá  ser apresentado  junto  ao objeto  à direita  do
mesmo, sem espaços separando-os.

Por exemplo, uma forma como

#+begin_example
(quasiquote (x))
#+end_example

poderá ser escrita, de forma sucinta, como

#+begin_example
`(x)
#+end_example

Veja  que o  objeto quasi-quotado  passa a  ficar em  evidência, sendo
precedido pelo símbolo ~`~, de forma similar a um objeto quotado.

*** Unquote (~,~)

O macro de leitor ~,~ ajuda a  escrever o processo de unquoting de forma
sucinta. Este macro de leitor só  será válido no interior de uma forma
especial de quasiquoting.

Esse  símbolo deverá  ser apresentado  junto  ao objeto  à direita  do
mesmo, sem espaços separando-os.

Por  exemplo, considere  a forma  a seguir,  que faz  uso do  macro de
leitor para quasiquoting:

#+begin_example
`(+ (unquote x) (unquote y))
#+end_example

Podemos reescrevê-la facilmente com o uso do novo macro de leitor para
unquoting:

#+begin_example
`(+ ,x ,y)
#+end_example

*** Unquote-Splice (~,@~)

O  macro de  leitor  ~,@~ é  similar ao  unquote,  todavia representa  o
processo de  unquoting para  os elementos de  uma lista,  que chamamos
~unquote-splice~. Assim, podemos considerá-lo como uma especialização do
macro de leitor de unquote (~,~).

Essa sequência  de símbolos deverá  ser apresentada junto ao  objeto à
direita da mesma, sem espaços para separação.

Por exemplo, considere a forma a seguir, levando em consideração que ~x~
é uma lista adequada:

#+begin_example
`(,y (unquote-splice x))
#+end_example

Para reescrever esta expressão de  forma sucinta, poderemos usar nosso
novo macro de leitor:

#+begin_example
`(,y ,@x)
#+end_example

