A-especificacao.html

<div id="outline-container-org72c097c" class="outline-4">
<h4 id="org72c097c"><span class="section-number-4">11.8.15.</span> <code>(letrec bindings . body)</code></h4>
<div class="outline-text-4" id="text-11-8-15">
<p>
Define uma lista de funções que serão bem-definidas durante a execução
da expressão <code>body</code>.
</p>

<p>
<code>bindings</code>  é uma  lista  de  definições de  funções  similares a  <code>defn</code>,
todavia  sem o  símbolo <code>defn</code>  em seu  início. <code>letrec</code>  segue as  mesmas
regras sintáticas de <code>letfn</code> e <code>letfn*</code>.
</p>

<p>
O funcionamento de <code>letrec</code> aproxima-se muito  do uso prático de <code>letfn</code> e
<code>letfn*</code>.  Todavia,  <code>letrec</code> permite  a declaração de  <i>funções mutuamente
recursivas</i>,    <b>puramente    através     de    um    contexto    léxico
compartilhado</b>.   Para  tanto,  cada  função ali  declarada  captura  o
próprio contexto criado por <code>letrec</code> <i>após a definição</i> das mesmas.
</p>

<p>
Essa característica torna <code>letrec</code>  fundamentalmente diferente de <code>letfn</code>,
uma vez que  todas as funções envolvidas terão  referências às funções
ali  declaradas. Em  outras palavras,  o uso  recursivo de  uma função
declarada com  <code>letrec</code> não implica em  procura da mesma em  um contexto
"dinâmico" (ou seja, no contexto onde tal função foi chamada).
</p>

<p>
Um  bloco <code>letrec</code>  pode, portanto,  retornar uma  de suas  clausuras, e
qualquer recursão ou recursão mútua  na mesma não será degenerada pela
procura recursiva de  uma das funções declaradas no  contexto onde for
executada.
</p>

<p>
Como esse  tipo de operação exige  modificar a forma como  funções são
declaradas  &#x2013; mais  precisamente,  modificar a  forma  como ocorre  a
captura  de  contexto  &#x2013;,  <code>letrec</code> precisa  ser  uma  forma  especial,
diferente de <code>letfn</code> e <code>let</code>, que podem ser declarados como macros.
</p>

<pre class="example" id="orgc9687da">
&gt; (letrec ((foo ()
             (print "Calling foo")
             (bar))
           (bar ()
             (print "Calling bar")
             (baz))
           (baz ()
             (print "Calling baz")))
    (foo))
; Calling foo
; Calling bar
; Calling baz
; 
nil

&gt; (letrec ((iter (x)
             (if (&gt; x 0)
                 (do (print "Recursion #{}" x)
                     (iter (1- x)))
                 'finished)))
    (iter 5))
; Recursion #5
; Recursion #4
; Recursion #3
; Recursion #2
; Recursion #1
; 
finished

&gt; (def my-function
       (letrec ((foo () (bar))
                (bar ()
                  (print "Hello from bar on letrec")))
         foo))
my-function

&gt; (my-function)
; Hello from bar on letrec
; 
nil
</pre>
</div>
</div>

<div id="outline-container-org0190fba" class="outline-4">
<h4 id="org0190fba"><span class="section-number-4">11.8.16.</span> <code>(unwind-protect expr cleanup)</code></h4>
<div class="outline-text-4" id="text-11-8-16">
<p>
<code>unwind-protect</code> interpreta  a expressão protegida <code>expr</code>  e, independente
de  tal  interpretação resultar  em  falha,  garante que  a  expressão
<code>cleanup</code> seja sempre interpretada em seguida.
</p>

<p>
<code>unwind-protect</code> deve retornar a  interpretação de <code>expr</code>, independente de
a mesma ser um erro ou não. O resultado de <code>cleanup</code> será ignorado.
</p>

<p>
<code>unwind-protect</code>  é uma  forma especial  utilizada para  garantir certos
efeitos colaterais  como forma  de limpeza após  a execução  de certas
expressões<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>, e não  realiza prevenções contra falhas  em casos de
terminação anormal do processo de interpretação.
</p>

<p>
Por exemplo, <code>unwind-protect</code> não garante que, mediante uma operação que
faça  com que  a aplicação  entre em  um estado  irrecuperável, ocorra
algum  tipo  de limpeza;  neste  tipo  de  situação, espera-se  que  a
aplicação encerre-se imediatamente.
</p>

<p>
Supondo um  arquivo-texto <code>teste.txt</code>  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final&#x2026;
</p>

<pre class="example" id="org3c39bc9">
Teste
</pre>

<p>
&#x2026;os exemplos a seguir utilizam-se de tal arquivo.
</p>

<pre class="example" id="orgeee3622">
&gt; (def *my-stream* nil)
*my-stream*

&gt; (unwind-protect
      (do (set *my-stream* (open-stream 'in "teste.txt"))
          (read-char *my-stream*))
    (do (close-stream *my-stream*)
        (set *my-stream* nil)))
#\T

&gt; *my-stream*
nil

&gt; (do (set *my-stream* (open-stream 'out "teste.txt"))
      (read-char *my-stream*))
(lit error "{} is not an input stream" #&lt;stream (out) {...}&gt;)

&gt; *my-stream*
#&lt;stream (out) {...}&gt;

&gt; (do (close-stream *my-stream*)
      (set *my-stream* nil))
*my-stream*

&gt; *my-stream*
nil

&gt; (unwind-protect
      (do (set *my-stream* (open-stream 'out "teste.txt"))
          (read-char *my-stream*))
    (do (close-stream *my-stream*)
        (set *my-stream* nil)))
(lit error "{} is not an input stream" #&lt;stream (out) {...}&gt;)

&gt; *my-stream*
nil
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5f4b07" class="outline-3">
<h3 id="orgb5f4b07"><span class="section-number-3">11.9.</span> Macros do leitor de expressões</h3>
<div class="outline-text-3" id="text-11-9">
</div>
<div id="outline-container-org30f5a4a" class="outline-4">
<h4 id="org30f5a4a"><span class="section-number-4">11.9.1.</span> Quote (<code>'</code>)</h4>
<div class="outline-text-4" id="text-11-9-1">
<p>
O macro de leitor <code>'</code> aplica a  forma especial <code>quote</code> ao próximo objeto a
ser lido.
</p>

<p>
Esse  símbolo deverá  ser apresentado  junto  ao objeto  à direita  do
mesmo, sem espaços separando-os.
</p>

<p>
Por exemplo, os objetos quotados a seguir
</p>

<pre class="example" id="org0b9f9d4">
(quote a)
(quote (1 2 3))
</pre>

<p>
poderão ser reescritos usando o macro de leitor da seguinte forma:
</p>

<pre class="example" id="orgba6edd4">
'a
'(1 2 3)
</pre>
</div>
</div>

<div id="outline-container-org3a26282" class="outline-4">
<h4 id="org3a26282"><span class="section-number-4">11.9.2.</span> Quasiquote (<code>`</code>)</h4>
<div class="outline-text-4" id="text-11-9-2">
<p>
O macro  de leitor <code>`</code>  ajuda a escrever  o processo de  quasiquoting de
forma  sucinta. Em  suma,  o  próximo objeto  a  ser  lido deverá  ser
englobado em uma forma especial de <code>quasiquote</code>.
</p>

<p>
Esse  símbolo deverá  ser apresentado  junto  ao objeto  à direita  do
mesmo, sem espaços separando-os.
</p>

<p>
Por exemplo, uma forma como
</p>

<pre class="example" id="org79da43d">
(quasiquote (x))
</pre>

<p>
poderá ser escrita, de forma sucinta, como
</p>

<pre class="example" id="org43be561">
`(x)
</pre>

<p>
Veja  que o  objeto quasi-quotado  passa a  ficar em  evidência, sendo
precedido pelo símbolo <code>`</code>, de forma similar a um objeto quotado.
</p>
</div>
</div>

<div id="outline-container-orgc8e55aa" class="outline-4">
<h4 id="orgc8e55aa"><span class="section-number-4">11.9.3.</span> Unquote (<code>,</code>)</h4>
<div class="outline-text-4" id="text-11-9-3">
<p>
O macro de leitor <code>,</code> ajuda a  escrever o processo de unquoting de forma
sucinta. Este macro de leitor só  será válido no interior de uma forma
especial de quasiquoting.
</p>

<p>
Esse  símbolo deverá  ser apresentado  junto  ao objeto  à direita  do
mesmo, sem espaços separando-os.
</p>

<p>
Por  exemplo, considere  a forma  a seguir,  que faz  uso do  macro de
leitor para quasiquoting:
</p>

<pre class="example" id="org3e3c03a">
`(+ (unquote x) (unquote y))
</pre>

<p>
Podemos reescrevê-la facilmente com o uso do novo macro de leitor para
unquoting:
</p>

<pre class="example" id="orgd96ec8f">
`(+ ,x ,y)
</pre>
</div>
</div>

<div id="outline-container-org98bb2e3" class="outline-4">
<h4 id="org98bb2e3"><span class="section-number-4">11.9.4.</span> Unquote-Splice (<code>,@</code>)</h4>
<div class="outline-text-4" id="text-11-9-4">
<p>
O  macro de  leitor  <code>,@</code> é  similar ao  unquote,  todavia representa  o
processo de  unquoting para  os elementos de  uma lista,  que chamamos
<code>unquote-splice</code>. Assim, podemos considerá-lo como uma especialização do
macro de leitor de unquote (<code>,</code>).
</p>

<p>
Essa sequência  de símbolos deverá  ser apresentada junto ao  objeto à
direita da mesma, sem espaços para separação.
</p>

<p>
Por exemplo, considere a forma a seguir, levando em consideração que <code>x</code>
é uma lista adequada:
</p>

<pre class="example" id="org5850f1b">
`(,y (unquote-splice x))
</pre>

<p>
Para reescrever esta expressão de  forma sucinta, poderemos usar nosso
novo macro de leitor:
</p>

<pre class="example" id="org0fa89cd">
`(,y ,@x)
</pre>
</div>
</div>
