A-especificacao.org
*** Sintaxe de vetores (~[ ]~)

Os macros de leitor  ~[~ e ~]~ delimitam uma sequência  de itens que serão
interpretados  e   transformados  em  um  vetor.   Podemos,  portanto,
considerá-los uma sintaxe alternativa para o uso da função ~vector~.

Por exemplo, considere um vetor declarado da forma a seguir:

#+begin_example
(vector 1 2 'a 3 (+ 2 5))
#+end_example

Esta chamada de  função em específico poderá ser reescrita  da forma a
seguir:

#+begin_example
[1 2 'a 3 (+ 2 5)]
#+end_example

** Macros

Macros  nada mais  são que  funções aplicadas  a expressões  ainda não
interpretadas.  As expressões  são  tratadas  como meras  informações,
processadas  pelo  /macro/, e  seu  resultado  então será  utilizado  na
interpretação em questão.

*** ~(cond . clauses)~

Realiza  a  interpretação  de múltiplas  condicionais  encadeadas,  em
sequência.

~cond~ tira proveito das capabilidades  de ~if~, a estrutura apropriada de
controle de fluxo.  Isso significa que cada cláusula de  ~cond~ deve ser
avaliada como se fosse  o /predicado/ e a /consequência/ de  um ~if~; caso o
/predicado/ não  seja verdadeiro, a  execução continua como se  ~cond~ não
tivesse tal cláusula avaliada.

Uma possível implementação para ~cond~ poderia ser:

#+begin_example
(defmac cond clauses
  (if (nilp clauses)
      nil
      `(if ,(caar clauses)
           ,(car (cdar clauses))
           ,(if (nilp (cdr clauses))
                nil
                (cons 'cond (cdr clauses))))))
#+end_example

Dessa forma, o seguinte uso do macro ~cond~...

#+begin_example
(cond ((zerop x) 0)
      ((< x 1) (- x))
      (t x))
#+end_example

...expande-se completamente para a forma:

#+begin_example
(if (zerop x)
    0
    (if (< x 1)
        (- x)
        (if t x nil)))
#+end_example

Assim, o ~cond~ nada mais é que  a utilização de ~if~'s em sequência, onde
a  escrita  dos mesmos  geraria  indentação  excessiva ou  desconforto
visual.

O uso  do símbolo ~t~  na última cláusula define  ~t~ como sendo  o último
predicado,  ou seja,  fará com  que  a última  comparação seja  sempre
verdadeira, o que idiomaticamente  equipara-se ao uso da palavra-chave
~else~ em  outras linguagens. Se  ~t~ não  for utilizado para  garantir um
valor final de retorno, será retornado sempre o símbolo ~nil~.

#+begin_example
> (let ((x 1))
    (cond ((zerop x) 0)
          ((< x 1) (- x))
          (t x)))
1

> (let ((x 0))   
    (cond ((zerop x) 0)
          ((< x 1) (- x))
          (t x)))
0

> (cond (t 'a))
a

> (cond ((eq 'a 'b) 'ok))
nil
#+end_example

*** ~(defn name lambda-list . body)~

Associa uma literal de clausura ao símbolo ~name~ no contexto global.

Uma possível implementação desse macro seria:

#+begin_example
(defmac defn (label lambda-list . body)
  `(def ,label (fn ,lambda-list ,@body)))
#+end_example

Isto leva à conclusão de que a forma a seguir...

#+begin_example
(defn name lambda-list . body)
#+end_example

...será expandida para a seguinte expressão:

#+begin_example
(def name (fn lambda-list . body))
#+end_example

As demais regras para uso das formas especiais ~def~ e ~fn~ se aplicam.

*** ~(defmac name lambda-list . body)~

Associa uma literal de macro ao símbolo ~name~ no contexto global.

Uma possível implementação desse macro seria:

#+begin_example
(def defmac
  (mac (label lambda-list . body)
       `(def ,label
            (mac ,lambda-list ,@body))))
#+end_example

Isto leva à conclusão de que a forma a seguir...

#+begin_example
(defmac name lambda-list . body)
#+end_example

...será expandida para a seguinte expressão:

#+begin_example
(def name (mac lambda-list . body))
#+end_example

As demais regras para uso das formas especiais ~def~ e ~mac~ se aplicam.

*** ~(let bindings . body)~

Cria  um contexto  léxico onde  valores sejam  bem-definidos, e  então
interpreta uma série de expressões  em sequência delimitadas por ~body~,
retornando o valor da última expressão interpretada.

Caso haja  um erro em  alguma das  interpretações ou na  definição das
variáveis,  a execução  é  interrompida imediatamente  e  o erro  será
retornado.

A  sintaxe para  as  ligações  é dada  pela  lista  de listas  chamada
~bindings~,  onde cada  sublista  possui exatamente  dois elementos,  no
seguinte molde:

#+begin_example
((x1 v1) (x2 v2) (x3 v3) ... (xn vn))
#+end_example

No  exemplo acima,  as expressões  ~x1~, ~x2~,  ..., ~xn~  dizem respeito  a
expressões  às  quais  os  valores  ~v1~,  ~v2~,  ...,  ~vn~  serão  ligados
respectivamente, após suas interpretações.

As expressões  ~x1~, ..., ~xn~  não necessariamente precisam  ser símbolos
únicos,   podendo  ser   listas  adequadas   ou  pontuadas;   o  valor
interpretado a ser atribuído a essas expressões será desestruturado de
acordo com a  forma das expressões ~x1~, ..., ~xn~.  Isso está diretamente
correlacionado com a forma como  funções ligam seus parâmetros formais
aos valores a elas fornecidos.

As definições de variáveis não podem ser dependentes umas das outras.

De fato, por ser um macro, ~let~ pode ser definido da seguinte forma:

#+begin_example
(defmac let (args . body)
  ((fn (sepfn)
     ((fn ((syms vals))
        `((fn ,syms ,@body)
          ,@vals))
      (sepfn args nil nil sepfn)))
   (fn (pairs syms vals recur)
       (if (nilp pairs)
           (list syms vals)
           (recur (cdr pairs)
                  (cons (caar pairs) syms)
                  (cons (car (cdar pairs)) vals)
                  recur)))))
#+end_example

Apesar de  não ser uma implementação  trivial, o /macro/ ~let~  sugere que
uma expressão como...

#+begin_example
(let ((x 1) (y 2))
  (+ x y))
#+end_example

...será transformada na expressão a seguir:

#+begin_example
((fn (y x) (+ x y)) 2 1)
#+end_example

Portanto,  todo  e  qualquer  uso  de  ~let~  corresponderá,  mesmo  que
teoricamente, a uma  aplicação /ad-hoc/ de uma função  anônima, e poderá
usufruir  dos  recursos desse  processo  de  aplicação de  uma  função
(exceto em casos de aplicação parcial).

