A-especificacao.html

<div id="outline-container-orgc471081" class="outline-4">
<h4 id="orgc471081"><span class="section-number-4">11.9.5.</span> Sintaxe de vetores (<code>[ ]</code>)</h4>
<div class="outline-text-4" id="text-11-9-5">
<p>
Os macros de leitor  <code>[</code> e <code>]</code> delimitam uma sequência  de itens que serão
interpretados  e   transformados  em  um  vetor.   Podemos,  portanto,
considerá-los uma sintaxe alternativa para o uso da função <code>vector</code>.
</p>

<p>
Por exemplo, considere um vetor declarado da forma a seguir:
</p>

<pre class="example" id="org4b378af">
(vector 1 2 'a 3 (+ 2 5))
</pre>

<p>
Esta chamada de  função em específico poderá ser reescrita  da forma a
seguir:
</p>

<pre class="example" id="org69b2fa3">
[1 2 'a 3 (+ 2 5)]
</pre>
</div>
</div>
</div>

<div id="outline-container-org52f4cd2" class="outline-3">
<h3 id="org52f4cd2"><span class="section-number-3">11.10.</span> Macros</h3>
<div class="outline-text-3" id="text-11-10">
<p>
Macros  nada mais  são que  funções aplicadas  a expressões  ainda não
interpretadas.  As expressões  são  tratadas  como meras  informações,
processadas  pelo  <i>macro</i>, e  seu  resultado  então será  utilizado  na
interpretação em questão.
</p>
</div>

<div id="outline-container-org7233547" class="outline-4">
<h4 id="org7233547"><span class="section-number-4">11.10.1.</span> <code>(cond . clauses)</code></h4>
<div class="outline-text-4" id="text-11-10-1">
<p>
Realiza  a  interpretação  de múltiplas  condicionais  encadeadas,  em
sequência.
</p>

<p>
<code>cond</code> tira proveito das capabilidades  de <code>if</code>, a estrutura apropriada de
controle de fluxo.  Isso significa que cada cláusula de  <code>cond</code> deve ser
avaliada como se fosse  o <i>predicado</i> e a <i>consequência</i> de  um <code>if</code>; caso o
<i>predicado</i> não  seja verdadeiro, a  execução continua como se  <code>cond</code> não
tivesse tal cláusula avaliada.
</p>

<p>
Uma possível implementação para <code>cond</code> poderia ser:
</p>

<pre class="example" id="orgf055cbc">
(defmac cond clauses
  (if (nilp clauses)
      nil
      `(if ,(caar clauses)
           ,(car (cdar clauses))
           ,(if (nilp (cdr clauses))
                nil
                (cons 'cond (cdr clauses))))))
</pre>

<p>
Dessa forma, o seguinte uso do macro <code>cond</code>&#x2026;
</p>

<pre class="example" id="orgb64fef1">
(cond ((zerop x) 0)
      ((&lt; x 1) (- x))
      (t x))
</pre>

<p>
&#x2026;expande-se completamente para a forma:
</p>

<pre class="example" id="org30369ac">
(if (zerop x)
    0
    (if (&lt; x 1)
        (- x)
        (if t x nil)))
</pre>

<p>
Assim, o <code>cond</code> nada mais é que  a utilização de <code>if</code>'s em sequência, onde
a  escrita  dos mesmos  geraria  indentação  excessiva ou  desconforto
visual.
</p>

<p>
O uso  do símbolo <code>t</code>  na última cláusula define  <code>t</code> como sendo  o último
predicado,  ou seja,  fará com  que  a última  comparação seja  sempre
verdadeira, o que idiomaticamente  equipara-se ao uso da palavra-chave
<code>else</code> em  outras linguagens. Se  <code>t</code> não  for utilizado para  garantir um
valor final de retorno, será retornado sempre o símbolo <code>nil</code>.
</p>

<pre class="example" id="orgf838286">
&gt; (let ((x 1))
    (cond ((zerop x) 0)
          ((&lt; x 1) (- x))
          (t x)))
1

&gt; (let ((x 0))   
    (cond ((zerop x) 0)
          ((&lt; x 1) (- x))
          (t x)))
0

&gt; (cond (t 'a))
a

&gt; (cond ((eq 'a 'b) 'ok))
nil
</pre>
</div>
</div>

<div id="outline-container-org599a342" class="outline-4">
<h4 id="org599a342"><span class="section-number-4">11.10.2.</span> <code>(defn name lambda-list . body)</code></h4>
<div class="outline-text-4" id="text-11-10-2">
<p>
Associa uma literal de clausura ao símbolo <code>name</code> no contexto global.
</p>

<p>
Uma possível implementação desse macro seria:
</p>

<pre class="example" id="org197caad">
(defmac defn (label lambda-list . body)
  `(def ,label (fn ,lambda-list ,@body)))
</pre>

<p>
Isto leva à conclusão de que a forma a seguir&#x2026;
</p>

<pre class="example" id="orgba765bb">
(defn name lambda-list . body)
</pre>

<p>
&#x2026;será expandida para a seguinte expressão:
</p>

<pre class="example" id="org42e7c7b">
(def name (fn lambda-list . body))
</pre>

<p>
As demais regras para uso das formas especiais <code>def</code> e <code>fn</code> se aplicam.
</p>
</div>
</div>

<div id="outline-container-orgc6d426c" class="outline-4">
<h4 id="orgc6d426c"><span class="section-number-4">11.10.3.</span> <code>(defmac name lambda-list . body)</code></h4>
<div class="outline-text-4" id="text-11-10-3">
<p>
Associa uma literal de macro ao símbolo <code>name</code> no contexto global.
</p>

<p>
Uma possível implementação desse macro seria:
</p>

<pre class="example" id="orgb6c2f56">
(def defmac
  (mac (label lambda-list . body)
       `(def ,label
            (mac ,lambda-list ,@body))))
</pre>

<p>
Isto leva à conclusão de que a forma a seguir&#x2026;
</p>

<pre class="example" id="org7119503">
(defmac name lambda-list . body)
</pre>

<p>
&#x2026;será expandida para a seguinte expressão:
</p>

<pre class="example" id="org3378058">
(def name (mac lambda-list . body))
</pre>

<p>
As demais regras para uso das formas especiais <code>def</code> e <code>mac</code> se aplicam.
</p>
</div>
</div>

<div id="outline-container-orgfefcf05" class="outline-4">
<h4 id="orgfefcf05"><span class="section-number-4">11.10.4.</span> <code>(let bindings . body)</code></h4>
<div class="outline-text-4" id="text-11-10-4">
<p>
Cria  um contexto  léxico onde  valores sejam  bem-definidos, e  então
interpreta uma série de expressões  em sequência delimitadas por <code>body</code>,
retornando o valor da última expressão interpretada.
</p>

<p>
Caso haja  um erro em  alguma das  interpretações ou na  definição das
variáveis,  a execução  é  interrompida imediatamente  e  o erro  será
retornado.
</p>

<p>
A  sintaxe para  as  ligações  é dada  pela  lista  de listas  chamada
<code>bindings</code>,  onde cada  sublista  possui exatamente  dois elementos,  no
seguinte molde:
</p>

<pre class="example" id="orgc5ea282">
((x1 v1) (x2 v2) (x3 v3) ... (xn vn))
</pre>

<p>
No  exemplo acima,  as expressões  <code>x1</code>, <code>x2</code>,  &#x2026;, <code>xn</code>  dizem respeito  a
expressões  às  quais  os  valores  <code>v1</code>,  <code>v2</code>,  &#x2026;,  <code>vn</code>  serão  ligados
respectivamente, após suas interpretações.
</p>

<p>
As expressões  <code>x1</code>, &#x2026;, <code>xn</code>  não necessariamente precisam  ser símbolos
únicos,   podendo  ser   listas  adequadas   ou  pontuadas;   o  valor
interpretado a ser atribuído a essas expressões será desestruturado de
acordo com a  forma das expressões <code>x1</code>, &#x2026;, <code>xn</code>.  Isso está diretamente
correlacionado com a forma como  funções ligam seus parâmetros formais
aos valores a elas fornecidos.
</p>

<p>
As definições de variáveis não podem ser dependentes umas das outras.
</p>

<p>
De fato, por ser um macro, <code>let</code> pode ser definido da seguinte forma:
</p>

<pre class="example" id="org8bc8247">
(defmac let (args . body)
  ((fn (sepfn)
     ((fn ((syms vals))
        `((fn ,syms ,@body)
          ,@vals))
      (sepfn args nil nil sepfn)))
   (fn (pairs syms vals recur)
       (if (nilp pairs)
           (list syms vals)
           (recur (cdr pairs)
                  (cons (caar pairs) syms)
                  (cons (car (cdar pairs)) vals)
                  recur)))))
</pre>

<p>
Apesar de  não ser uma implementação  trivial, o <i>macro</i> <code>let</code>  sugere que
uma expressão como&#x2026;
</p>

<pre class="example" id="org49e81d4">
(let ((x 1) (y 2))
  (+ x y))
</pre>

<p>
&#x2026;será transformada na expressão a seguir:
</p>

<pre class="example" id="org977c8b9">
((fn (y x) (+ x y)) 2 1)
</pre>

<p>
Portanto,  todo  e  qualquer  uso  de  <code>let</code>  corresponderá,  mesmo  que
teoricamente, a uma  aplicação <i>ad-hoc</i> de uma função  anônima, e poderá
usufruir  dos  recursos desse  processo  de  aplicação de  uma  função
(exceto em casos de aplicação parcial).
</p>
</div>
</div>
