A-especificacao.org
*** ~(let* bindings . body)~

Cria  contextos léxicos  em  sequência com  valores bem-definidos,  de
forma que uma definição de valores possa depender das definições que a
precedem, e  então interpreta  uma série  de expressões  em sequência,
delimitadas   por  ~body~.   Retorna   o  valor   da  última   expressão
interpretada.

Caso haja  um erro em  alguma das  interpretações ou na  definição das
variáveis,  a execução  é  interrompida imediatamente  e  o erro  será
retornado.

Dessa forma, ~let*~ poderia ser definido como:

#+begin_example
(defmac let* (clauses . body)
  (if (nilp clauses)
      (cons 'do body)
      `(let (,(car clauses))
         ,(if (nilp (cdr clauses))
              (cons 'do body)
              `(let* ,(cdr clauses)
                 ,@body)))))
#+end_example

Em outras  palavras, trata-se de  uma versão  especial de ~let~,  onde a
definição de  uma variável  pode depender das  variáveis anteriormente
definidas.

Considerando a seguinte expressão:

#+begin_example
(let* ((x (* 2 3))
       (y (1+ x))
       (z (+ y 3)))
  (+ x y z))
#+end_example

Ela poderá ser expandida para a forma a seguir:

#+begin_example
(let ((x (* 2 3)))
  (let* ((y (1+ x))
         (z (+ y 3)))
    (+ x y z)))
#+end_example

Como se pode observar, a expansão  de ~let*~ culmina no uso recursivo do
próprio macro, com usos sequenciais do macro ~let~.

Uma expansão  parcial do uso recursivo  de ~let*~ no exemplo  culmina em
algo com uma execução similar à expressão:

#+begin_example
(let ((x (* 2 3)))
  (let ((y (1+ x)))
    (let ((z (+ y 3)))
      (+ x y z))))
#+end_example

Ou, expandindo todos os usos de ~let~:

#+begin_example
((fn (x)
  ((fn (y)
     ((fn (z)
        (+ x y z))
      (+ y 3)))
   (1+ x)))
  (* 2 3))
#+end_example

Dessa  forma, fica  claro  que  cada definição  de  variáveis em  ~let*~
é efetuada  em um contexto  onde as variáveis  anteriormente definidas
estejam bem-definidas.

*** ~(letfn bindings . body)~

Cria um contexto  léxico onde certas funções  estejam bem-definidas, e
então interpreta uma série de expressões em sequência, delimitadas por
~body~. Retorna   o  valor   da  última   expressão interpretada.

Caso haja  um erro em  alguma das  interpretações ou na  definição das
funções,  a  execução  é  interrompida imediatamente  e  o  erro  será
retornado.

~letfn~ é,  na prática,  uma versão  modificada de  ~let~, onde  cada caso
inscrito na lista  ~bindings~ é uma sublista que se  assemelha ao uso de
~defn~.

Sendo assim, ~bindings~ segue uma estrutura similar ao exemplo:

#+begin_example
((function1 () body1) ... (functionN () bodyN))
#+end_example

Dessa   forma,   as   funções  ~function1~,   ...,   ~functionN~   estarão
bem-definidas para a execução das expressões contidas em ~body~.

O macro ~letfn~ poderia ser escrito da seguinte forma:

#+begin_example
(defmac letfn (defs . body)
  ((fn (sepfn)
     ((fn ((syms vals))
        `((fn ,syms ,@body)
          ,@vals))
      (sepfn defs nil nil sepfn)))
   (fn (pairs syms vals recur)
       (if (nilp pairs)
           (list syms vals)
           (recur (cdr pairs)
                  (cons (caar pairs) syms)
                  (cons (cons 'fn (cdar pairs)) vals)
                  recur)))))
#+end_example

Uma expressão envolvendo o uso de ~letfn~ como a expressão a seguir:

#+begin_example
(letfn ((foo (x) (+ 1 2 x)))
  (foo 5))
#+end_example

Tal  expressão acaba  por  expandir-se para  a  aplicação imediata  de
função, que recebe outra(s) como parâmetro:

#+begin_example
((fn (foo) (foo 5))
 (fn (x) (+ 1 2 x)))
#+end_example

É importante  notar que o macro  ~letfn~ *não possibilita a  definição de
funções  recursivas*. Uma  função  recursiva requer  que  a mesma  seja
executada em um  contexto onde a mesma esteja  bem-definida.

Teoricamente, uma função definida via ~letfn~ pode encontrar sua própria
definição durante  a execução  das expressões de  ~body~ através  de uma
consulta ao contexto em que  foi chamada, sendo portanto dependente do
uso de  /contexto dinâmico/.

Todavia, caso a função seja retornada ou atribuída em um contexto fora
do  criado  por  ~letfn~,  esta consulta  falhará,  tendo  comportamento
inesperado do  ponto de  vista do programador.  Um exemplo  deste erro
pode ser observado a seguir.

#+begin_example
> (def my-function
       (letfn ((foo () (bar))
               (bar ()
                 (print "Hello from bar on letfn")))
         foo))
my-function

> (my-function)
(lit error "{} is unbound" bar)
#+end_example

Funções  locais  propriamente  recursivas,   que  capturam  o  próprio
contexto em que estão definidas,  devem ser definidas através da forma
especial ~letrec~.

*** ~(letfn* bindings . body)~

Cria  contextos léxicos  em  sequência com  funções bem-definidas,  de
forma que uma definição de função  possa depender das definições que a
precedem, e  então interpreta  uma série  de expressões  em sequência,
delimitadas   por  ~body~.   Retorna   o  valor   da  última   expressão
interpretada.

Caso haja  um erro em  alguma das  interpretações ou na  definição das
funções,  a  execução  é  interrompida imediatamente  e  o  erro  será
retornado.

~letfn*~ pode ser definido da seguinte forma:

#+begin_example
(defmac letfn* (clauses . body)
  (if (nilp clauses)
      (cons 'do body)
      `(letfn (,(car clauses))
         ,(if (nilp (cdr clauses))
              (cons 'do body)
              `(letfn* ,(cdr clauses)
                 ,@body)))))
#+end_example

Pode-se  observar que  ~letfn*~ define  uma forma  modificada de  ~letfn~,
assim como ~let*~ define uma forma modificada de ~let~. Assim, a definição
de cada função pode depender das funções anteriormente definidas.

Deve-se adicionar  que essa  dependência é dada  a partir  de /capturas
sucessivas de  contexto/ durante  as definições das  funções. Portanto,
uma  função definida  mais posteriormente,  mesmo quando  retornada do
escopo de  ~letfn*~ ou atribuída  a uma  variável em um  escopo externo,
esta  ainda manterá  as referências  capturadas das  funções definidas
antes de si.

O exemplo a seguir demonstra esse comportamento.

#+begin_example
> (def my-function
       (letfn* ((foo ()
                  (print "Executing foo"))
                (bar ()
                  (print "Executing bar")
                  (foo)))
         bar))
my-function

> (letfn ((foo ()
            (print "This is another foo")))
    (my-function))
; Executing bar
; Executing foo
;
nil
#+end_example

