A-especificacao.html

<div id="outline-container-orgbe7d3d7" class="outline-4">
<h4 id="orgbe7d3d7"><span class="section-number-4">11.10.5.</span> <code>(let* bindings . body)</code></h4>
<div class="outline-text-4" id="text-11-10-5">
<p>
Cria  contextos léxicos  em  sequência com  valores bem-definidos,  de
forma que uma definição de valores possa depender das definições que a
precedem, e  então interpreta  uma série  de expressões  em sequência,
delimitadas   por  <code>body</code>.   Retorna   o  valor   da  última   expressão
interpretada.
</p>

<p>
Caso haja  um erro em  alguma das  interpretações ou na  definição das
variáveis,  a execução  é  interrompida imediatamente  e  o erro  será
retornado.
</p>

<p>
Dessa forma, <code>let*</code> poderia ser definido como:
</p>

<pre class="example" id="orgbfc39f2">
(defmac let* (clauses . body)
  (if (nilp clauses)
      (cons 'do body)
      `(let (,(car clauses))
         ,(if (nilp (cdr clauses))
              (cons 'do body)
              `(let* ,(cdr clauses)
                 ,@body)))))
</pre>

<p>
Em outras  palavras, trata-se de  uma versão  especial de <code>let</code>,  onde a
definição de  uma variável  pode depender das  variáveis anteriormente
definidas.
</p>

<p>
Considerando a seguinte expressão:
</p>

<pre class="example" id="org1239439">
(let* ((x (* 2 3))
       (y (1+ x))
       (z (+ y 3)))
  (+ x y z))
</pre>

<p>
Ela poderá ser expandida para a forma a seguir:
</p>

<pre class="example" id="orgabeb8bc">
(let ((x (* 2 3)))
  (let* ((y (1+ x))
         (z (+ y 3)))
    (+ x y z)))
</pre>

<p>
Como se pode observar, a expansão  de <code>let*</code> culmina no uso recursivo do
próprio macro, com usos sequenciais do macro <code>let</code>.
</p>

<p>
Uma expansão  parcial do uso recursivo  de <code>let*</code> no exemplo  culmina em
algo com uma execução similar à expressão:
</p>

<pre class="example" id="org5bfc80e">
(let ((x (* 2 3)))
  (let ((y (1+ x)))
    (let ((z (+ y 3)))
      (+ x y z))))
</pre>

<p>
Ou, expandindo todos os usos de <code>let</code>:
</p>

<pre class="example" id="orgd2af571">
((fn (x)
  ((fn (y)
     ((fn (z)
        (+ x y z))
      (+ y 3)))
   (1+ x)))
  (* 2 3))
</pre>

<p>
Dessa  forma, fica  claro  que  cada definição  de  variáveis em  <code>let*</code>
é efetuada  em um contexto  onde as variáveis  anteriormente definidas
estejam bem-definidas.
</p>
</div>
</div>

<div id="outline-container-org17ee99e" class="outline-4">
<h4 id="org17ee99e"><span class="section-number-4">11.10.6.</span> <code>(letfn bindings . body)</code></h4>
<div class="outline-text-4" id="text-11-10-6">
<p>
Cria um contexto  léxico onde certas funções  estejam bem-definidas, e
então interpreta uma série de expressões em sequência, delimitadas por
<code>body</code>. Retorna   o  valor   da  última   expressão interpretada.
</p>

<p>
Caso haja  um erro em  alguma das  interpretações ou na  definição das
funções,  a  execução  é  interrompida imediatamente  e  o  erro  será
retornado.
</p>

<p>
<code>letfn</code> é,  na prática,  uma versão  modificada de  <code>let</code>, onde  cada caso
inscrito na lista  <code>bindings</code> é uma sublista que se  assemelha ao uso de
<code>defn</code>.
</p>

<p>
Sendo assim, <code>bindings</code> segue uma estrutura similar ao exemplo:
</p>

<pre class="example" id="org92ba06f">
((function1 () body1) ... (functionN () bodyN))
</pre>

<p>
Dessa   forma,   as   funções  <code>function1</code>,   &#x2026;,   <code>functionN</code>   estarão
bem-definidas para a execução das expressões contidas em <code>body</code>.
</p>

<p>
O macro <code>letfn</code> poderia ser escrito da seguinte forma:
</p>

<pre class="example" id="org7d58d2b">
(defmac letfn (defs . body)
  ((fn (sepfn)
     ((fn ((syms vals))
        `((fn ,syms ,@body)
          ,@vals))
      (sepfn defs nil nil sepfn)))
   (fn (pairs syms vals recur)
       (if (nilp pairs)
           (list syms vals)
           (recur (cdr pairs)
                  (cons (caar pairs) syms)
                  (cons (cons 'fn (cdar pairs)) vals)
                  recur)))))
</pre>

<p>
Uma expressão envolvendo o uso de <code>letfn</code> como a expressão a seguir:
</p>

<pre class="example" id="org494fa93">
(letfn ((foo (x) (+ 1 2 x)))
  (foo 5))
</pre>

<p>
Tal  expressão acaba  por  expandir-se para  a  aplicação imediata  de
função, que recebe outra(s) como parâmetro:
</p>

<pre class="example" id="orgeb44740">
((fn (foo) (foo 5))
 (fn (x) (+ 1 2 x)))
</pre>

<p>
É importante  notar que o macro  <code>letfn</code> <b>não possibilita a  definição de
funções  recursivas</b>. Uma  função  recursiva requer  que  a mesma  seja
executada em um  contexto onde a mesma esteja  bem-definida.
</p>

<p>
Teoricamente, uma função definida via <code>letfn</code> pode encontrar sua própria
definição durante  a execução  das expressões de  <code>body</code> através  de uma
consulta ao contexto em que  foi chamada, sendo portanto dependente do
uso de  <i>contexto dinâmico</i>.
</p>

<p>
Todavia, caso a função seja retornada ou atribuída em um contexto fora
do  criado  por  <code>letfn</code>,  esta consulta  falhará,  tendo  comportamento
inesperado do  ponto de  vista do programador.  Um exemplo  deste erro
pode ser observado a seguir.
</p>

<pre class="example" id="org794d15e">
&gt; (def my-function
       (letfn ((foo () (bar))
               (bar ()
                 (print "Hello from bar on letfn")))
         foo))
my-function

&gt; (my-function)
(lit error "{} is unbound" bar)
</pre>

<p>
Funções  locais  propriamente  recursivas,   que  capturam  o  próprio
contexto em que estão definidas,  devem ser definidas através da forma
especial <code>letrec</code>.
</p>
</div>
</div>

<div id="outline-container-org838ea11" class="outline-4">
<h4 id="org838ea11"><span class="section-number-4">11.10.7.</span> <code>(letfn* bindings . body)</code></h4>
<div class="outline-text-4" id="text-11-10-7">
<p>
Cria  contextos léxicos  em  sequência com  funções bem-definidas,  de
forma que uma definição de função  possa depender das definições que a
precedem, e  então interpreta  uma série  de expressões  em sequência,
delimitadas   por  <code>body</code>.   Retorna   o  valor   da  última   expressão
interpretada.
</p>

<p>
Caso haja  um erro em  alguma das  interpretações ou na  definição das
funções,  a  execução  é  interrompida imediatamente  e  o  erro  será
retornado.
</p>

<p>
<code>letfn*</code> pode ser definido da seguinte forma:
</p>

<pre class="example" id="org6635428">
(defmac letfn* (clauses . body)
  (if (nilp clauses)
      (cons 'do body)
      `(letfn (,(car clauses))
         ,(if (nilp (cdr clauses))
              (cons 'do body)
              `(letfn* ,(cdr clauses)
                 ,@body)))))
</pre>

<p>
Pode-se  observar que  <code>letfn*</code> define  uma forma  modificada de  <code>letfn</code>,
assim como <code>let*</code> define uma forma modificada de <code>let</code>. Assim, a definição
de cada função pode depender das funções anteriormente definidas.
</p>

<p>
Deve-se adicionar  que essa  dependência é dada  a partir  de <i>capturas
sucessivas de  contexto</i> durante  as definições das  funções. Portanto,
uma  função definida  mais posteriormente,  mesmo quando  retornada do
escopo de  <code>letfn*</code> ou atribuída  a uma  variável em um  escopo externo,
esta  ainda manterá  as referências  capturadas das  funções definidas
antes de si.
</p>

<p>
O exemplo a seguir demonstra esse comportamento.
</p>

<pre class="example" id="org3b91da9">
&gt; (def my-function
       (letfn* ((foo ()
                  (print "Executing foo"))
                (bar ()
                  (print "Executing bar")
                  (foo)))
         bar))
my-function

&gt; (letfn ((foo ()
            (print "This is another foo")))
    (my-function))
; Executing bar
; Executing foo
;
nil
</pre>
</div>
</div>
