A-especificacao.org
*** ~(when pred . body)~

Realiza  a  interpretação sequencial  das  expressões  de ~body~,  se  e
somente   se  a   interpretação   de  ~pred~   resultar   em  um   valor
verdadeiro. Nesse caso,  retorna o valor da última  expressão de ~body~;
caso contrário, retorna ~nil~.

O macro ~when~  pode ser implementado a partir da  forma especial ~if~, da
seguinte forma:

#+begin_example
(defmac when (pred . body)
  `(if ,pred (do ,@body) nil))
#+end_example

Assim, uma expressão como esta:

#+begin_example
(when t
  (print "Hello")
  (+ 2 3))
#+end_example

Acaba por tornar-se esta expressão:

#+begin_example
(if t
    (do (print "Hello")
        (+ 2 3))
    nil)
#+end_example

O macro ~when~ executa, portanto, controle  de fluxo, assim como a forma
especial ~if~ e o macro ~cond~,  todavia lida apenas com a consequência de
um resultado  verdadeiro para o  predicado, e é  capaz de lidar  com a
execução de várias expressões sem depender da forma especial ~do~.

#+begin_example
> (when (nilp 'a)
    'is-nil)
nil

> (when (nilp nil)
    'is-nil)
is-nil
#+end_example

*** ~(unless pred . body)~

Realiza  a  interpretação sequencial  das  expressões  de ~body~,  se  e
somente  se a  interpretação  de  ~pred~ resultar  em  ~nil~. Nesse  caso,
retorna o  valor a última  expressão de ~body~; caso  contrário, retorna
~nil~.

O macro  ~unless~ pode ser  implementado através da utilização  da forma
especial ~if~:

#+begin_example
(defmac unless (pred . body)
  `(if (not ,pred) (do ,body) nil))
#+end_example

Assim, uma expressão como esta:

#+begin_example
(unless nil
  (print "Hello")
  (+ 2 3))
#+end_example

Acaba por tornar-se esta expressão:

#+begin_example
(if (not nil)
    (do (print "Hello")
        (+ 2 3))
    nil)
#+end_example

O macro ~unless~ age, portanto, como  uma versão /negativa/ de ~when~, sendo
também responsável por controle de fluxo.

#+begin_example
> (unless (nilp 'a)
    'ok)
ok

> (unless (nilp nil)
    'ok)
nil
#+end_example

*** ~(until pred . body)~

Executa  sequencialmente o  conjunto  de expressões  contidas em  ~body~
enquanto o  predicado ~pred~  retornar ~nil~. A  execução da  sequência de
expressões será realizada até que  a condição seja satisfeita.

O  valor retornado  será o  valor  da última  expressão executada,  na
última iteração. Caso nenhuma  iteração tenha ocorrido, será retornado
~nil~.

O macro ~until~ pode ser implementado da seguinte forma:

#+begin_example
(defmac until (pred . body)
  `(while (not ,pred) ,@body))
#+end_example

Assim, uma forma como esta:

#+begin_example
(until (>= x 5)
  (set x (1+ x)))
#+end_example

Será expandida para:

#+begin_example
(while (not (>= x 5)
  (set x (1+ x)))
#+end_example

Como pode-se  observar, o  macro ~until~  é a  forma /negativa/  de ~while~,
assim como ocorre com ~unless~ e ~when~.

#+begin_example
> (let ((x 0))
    (until (>= x 5)
      (print "x = {}" x)
      (set x (1+ x))))
; x = 0
; x = 1
; x = 2
; x = 3
; x = 4
;
x

> (let ((lst '(1 2 3 a 5)))
    (until (nilp lst)
      (let (((num . rest) lst))
        (print "2 = {}? {}"
               num
               (= 2 num))
        (set lst rest))))
; 2 = 1? nil
; 2 = 2? t
; 2 = 3? nil
;
(lit error "{} is not a number" a)

> (let ((lst '(1 2 3 NaN 5)))
    (until (>= (car lst) 5)
      (let (((num . rest) lst))
        (print "{}" num)
        (set lst rest))))
; 1
; 2
; 3
;
(lit error "{} is not a number" NaN)
#+end_example

*** ~(repeat n . body)~

Executa  sequencialmente as  expressões de  ~body~, por  um número  ~n~ de
vezes. O valor  retornado será o valor da  última expressão executada,
na última iteração. Caso nenhuma iteração ocorra, será retornado ~nil~.

O macro ~repeat~ pode ser escrito da seguinte forma:

#+begin_example
(defmac repeat (n . body)
  (let ((it (gensym))
        (res (gensym)))
    `(let ((,it   ,n)
           (,res nil))
       (while (> ,it 0)
         (set ,res (do ,@body))
         (set ,it (1- ,it)))
       ,res)))
#+end_example

Uma expressão como a seguinte:

#+begin_example
(repeat 5 (print "Test"))
#+end_example

Expande-se para uma expressão similar a esta:

#+begin_example
(let ((:G189   5)
      (:G188 nil))
  (while (> :G189 0)
    (set :G188 (do (print "Test")))
    (set :G189 (1- :G189)))
  :G188)
#+end_example

Sendo assim,  ~repeat~ pode ser visto  como um uso de  ~while~ que explora
uma variável que  sofre modificação, e outra que  armazena o resultado
parcial da  expressão a  cada iteração.

Os  símbolos  ~:G189~   e  ~:G188~  mostrados  no   exemplo  são  símbolos
arbitrários  automaticamente  gerados,  e  serão  diferentes  em  cada
uso de  ~repeat~. Sua geração é  efeito colateral da medida  tomada para
que ~repeat~  não se torne  um macro /anafórico/,  isto é, que  não nomeie
variáveis  que possam  ser  normalmente  utilizadas pelo  programador,
evitando o risco de erros semânticos.

#+begin_example
> (repeat 4 (print "Hello"))
; Hello
; Hello
; Hello
; Hello
;
nil

> (let ((x 5))
    (repeat 4
      (print "x = {}" x)
      (set x (1- x))))
; x = 5
; x = 4
; x = 3
; x = 2
;
x
#+end_example

*** ~(with-open-stream (sym dir file) . body)~

Abre um  stream ligado ao símbolo  ~sym~, de direção ~dir~  para o caminho
~file~,  garantindo  que o  stream  seja  fechado  após a  execução  das
expressões em ~body~.

Uma possível implementação para ~with-open-stream~ poderia ser:

#+begin_example
(defmac with-open-stream ((sym dir file) . body)
  `(let ((,sym (open-stream ,dir ,file)))
     (unwind-protect (do ,@body)
       (close-stream ,sym))))
#+end_example

Sendo assim, uma expressão como esta:

#+begin_example
(with-open-stream (s 'in "teste.txt")
  (read-char s))
#+end_example

Expande-se para a seguinte expressão:

#+begin_example
(let ((s (open-stream 'in "teste.txt")))
  (unwind-protect
      (do (read-char s))
    (close-stream s)))
#+end_example

Caso  o  stream  não  possa  ser  aberto,  o  erro  na  abertura  será
retornado.

Caso  ocorra   algum  erro  na   execução  das  expressões   em  ~body~,
~with-open-stream~  ainda garante  que o  stream seja  fechado. O  valor
retornado será o valor de interpretação da última expressão em ~body~.

O fechamento do stream está sujeito às regras de uso da forma especial
~unwind-protect~.

Supondo um  arquivo-texto ~teste.txt~  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final...

#+begin_example
Teste
#+end_example

...os exemplos a seguir utilizam-se de tal arquivo.

#+begin_example
> (with-open-stream (stream 'in "/home/alchemist/teste.txt")
    (read-char stream))
#\T

> (with-open-stream (stream 'out "/home/alchemist/teste.txt")
    (read-char stream))
(lit error "{} is not an input stream" #<stream (out) {...}>)
#+end_example

*** TODO ~(case x . clauses)~ :noexport:
