A-especificacao.html

<div id="outline-container-orgda5580b" class="outline-4">
<h4 id="orgda5580b"><span class="section-number-4">11.10.8.</span> <code>(when pred . body)</code></h4>
<div class="outline-text-4" id="text-11-10-8">
<p>
Realiza  a  interpretação sequencial  das  expressões  de <code>body</code>,  se  e
somente   se  a   interpretação   de  <code>pred</code>   resultar   em  um   valor
verdadeiro. Nesse caso,  retorna o valor da última  expressão de <code>body</code>;
caso contrário, retorna <code>nil</code>.
</p>

<p>
O macro <code>when</code>  pode ser implementado a partir da  forma especial <code>if</code>, da
seguinte forma:
</p>

<pre class="example" id="orgde1151f">
(defmac when (pred . body)
  `(if ,pred (do ,@body) nil))
</pre>

<p>
Assim, uma expressão como esta:
</p>

<pre class="example" id="org4c31e3a">
(when t
  (print "Hello")
  (+ 2 3))
</pre>

<p>
Acaba por tornar-se esta expressão:
</p>

<pre class="example" id="org1898ed0">
(if t
    (do (print "Hello")
        (+ 2 3))
    nil)
</pre>

<p>
O macro <code>when</code> executa, portanto, controle  de fluxo, assim como a forma
especial <code>if</code> e o macro <code>cond</code>,  todavia lida apenas com a consequência de
um resultado  verdadeiro para o  predicado, e é  capaz de lidar  com a
execução de várias expressões sem depender da forma especial <code>do</code>.
</p>

<pre class="example" id="orgbdb3d78">
&gt; (when (nilp 'a)
    'is-nil)
nil

&gt; (when (nilp nil)
    'is-nil)
is-nil
</pre>
</div>
</div>

<div id="outline-container-org1a0e476" class="outline-4">
<h4 id="org1a0e476"><span class="section-number-4">11.10.9.</span> <code>(unless pred . body)</code></h4>
<div class="outline-text-4" id="text-11-10-9">
<p>
Realiza  a  interpretação sequencial  das  expressões  de <code>body</code>,  se  e
somente  se a  interpretação  de  <code>pred</code> resultar  em  <code>nil</code>. Nesse  caso,
retorna o  valor a última  expressão de <code>body</code>; caso  contrário, retorna
<code>nil</code>.
</p>

<p>
O macro  <code>unless</code> pode ser  implementado através da utilização  da forma
especial <code>if</code>:
</p>

<pre class="example" id="orge57aacd">
(defmac unless (pred . body)
  `(if (not ,pred) (do ,body) nil))
</pre>

<p>
Assim, uma expressão como esta:
</p>

<pre class="example" id="orge760a56">
(unless nil
  (print "Hello")
  (+ 2 3))
</pre>

<p>
Acaba por tornar-se esta expressão:
</p>

<pre class="example" id="org2ed9aff">
(if (not nil)
    (do (print "Hello")
        (+ 2 3))
    nil)
</pre>

<p>
O macro <code>unless</code> age, portanto, como  uma versão <i>negativa</i> de <code>when</code>, sendo
também responsável por controle de fluxo.
</p>

<pre class="example" id="org7813728">
&gt; (unless (nilp 'a)
    'ok)
ok

&gt; (unless (nilp nil)
    'ok)
nil
</pre>
</div>
</div>

<div id="outline-container-org670696f" class="outline-4">
<h4 id="org670696f"><span class="section-number-4">11.10.10.</span> <code>(until pred . body)</code></h4>
<div class="outline-text-4" id="text-11-10-10">
<p>
Executa  sequencialmente o  conjunto  de expressões  contidas em  <code>body</code>
enquanto o  predicado <code>pred</code>  retornar <code>nil</code>. A  execução da  sequência de
expressões será realizada até que  a condição seja satisfeita.
</p>

<p>
O  valor retornado  será o  valor  da última  expressão executada,  na
última iteração. Caso nenhuma  iteração tenha ocorrido, será retornado
<code>nil</code>.
</p>

<p>
O macro <code>until</code> pode ser implementado da seguinte forma:
</p>

<pre class="example" id="org3830c74">
(defmac until (pred . body)
  `(while (not ,pred) ,@body))
</pre>

<p>
Assim, uma forma como esta:
</p>

<pre class="example" id="org8040e35">
(until (&gt;= x 5)
  (set x (1+ x)))
</pre>

<p>
Será expandida para:
</p>

<pre class="example" id="org87d123a">
(while (not (&gt;= x 5)
  (set x (1+ x)))
</pre>

<p>
Como pode-se  observar, o  macro <code>until</code>  é a  forma <i>negativa</i>  de <code>while</code>,
assim como ocorre com <code>unless</code> e <code>when</code>.
</p>

<pre class="example" id="org0064259">
&gt; (let ((x 0))
    (until (&gt;= x 5)
      (print "x = {}" x)
      (set x (1+ x))))
; x = 0
; x = 1
; x = 2
; x = 3
; x = 4
;
x

&gt; (let ((lst '(1 2 3 a 5)))
    (until (nilp lst)
      (let (((num . rest) lst))
        (print "2 = {}? {}"
               num
               (= 2 num))
        (set lst rest))))
; 2 = 1? nil
; 2 = 2? t
; 2 = 3? nil
;
(lit error "{} is not a number" a)

&gt; (let ((lst '(1 2 3 NaN 5)))
    (until (&gt;= (car lst) 5)
      (let (((num . rest) lst))
        (print "{}" num)
        (set lst rest))))
; 1
; 2
; 3
;
(lit error "{} is not a number" NaN)
</pre>
</div>
</div>

<div id="outline-container-orgdeb3349" class="outline-4">
<h4 id="orgdeb3349"><span class="section-number-4">11.10.11.</span> <code>(repeat n . body)</code></h4>
<div class="outline-text-4" id="text-11-10-11">
<p>
Executa  sequencialmente as  expressões de  <code>body</code>, por  um número  <code>n</code> de
vezes. O valor  retornado será o valor da  última expressão executada,
na última iteração. Caso nenhuma iteração ocorra, será retornado <code>nil</code>.
</p>

<p>
O macro <code>repeat</code> pode ser escrito da seguinte forma:
</p>

<pre class="example" id="org8c71446">
(defmac repeat (n . body)
  (let ((it (gensym))
        (res (gensym)))
    `(let ((,it   ,n)
           (,res nil))
       (while (&gt; ,it 0)
         (set ,res (do ,@body))
         (set ,it (1- ,it)))
       ,res)))
</pre>

<p>
Uma expressão como a seguinte:
</p>

<pre class="example" id="org97e1dd8">
(repeat 5 (print "Test"))
</pre>

<p>
Expande-se para uma expressão similar a esta:
</p>

<pre class="example" id="orga06e534">
(let ((:G189   5)
      (:G188 nil))
  (while (&gt; :G189 0)
    (set :G188 (do (print "Test")))
    (set :G189 (1- :G189)))
  :G188)
</pre>

<p>
Sendo assim,  <code>repeat</code> pode ser visto  como um uso de  <code>while</code> que explora
uma variável que  sofre modificação, e outra que  armazena o resultado
parcial da  expressão a  cada iteração.
</p>

<p>
Os  símbolos  <code>:G189</code>   e  <code>:G188</code>  mostrados  no   exemplo  são  símbolos
arbitrários  automaticamente  gerados,  e  serão  diferentes  em  cada
uso de  <code>repeat</code>. Sua geração é  efeito colateral da medida  tomada para
que <code>repeat</code>  não se torne  um macro <i>anafórico</i>,  isto é, que  não nomeie
variáveis  que possam  ser  normalmente  utilizadas pelo  programador,
evitando o risco de erros semânticos.
</p>

<pre class="example" id="org05cc52c">
&gt; (repeat 4 (print "Hello"))
; Hello
; Hello
; Hello
; Hello
;
nil

&gt; (let ((x 5))
    (repeat 4
      (print "x = {}" x)
      (set x (1- x))))
; x = 5
; x = 4
; x = 3
; x = 2
;
x
</pre>
</div>
</div>

<div id="outline-container-orgd94da1b" class="outline-4">
<h4 id="orgd94da1b"><span class="section-number-4">11.10.12.</span> <code>(with-open-stream (sym dir file) . body)</code></h4>
<div class="outline-text-4" id="text-11-10-12">
<p>
Abre um  stream ligado ao símbolo  <code>sym</code>, de direção <code>dir</code>  para o caminho
<code>file</code>,  garantindo  que o  stream  seja  fechado  após a  execução  das
expressões em <code>body</code>.
</p>

<p>
Uma possível implementação para <code>with-open-stream</code> poderia ser:
</p>

<pre class="example" id="org2bcc4cd">
(defmac with-open-stream ((sym dir file) . body)
  `(let ((,sym (open-stream ,dir ,file)))
     (unwind-protect (do ,@body)
       (close-stream ,sym))))
</pre>

<p>
Sendo assim, uma expressão como esta:
</p>

<pre class="example" id="org4f6c4ca">
(with-open-stream (s 'in "teste.txt")
  (read-char s))
</pre>

<p>
Expande-se para a seguinte expressão:
</p>

<pre class="example" id="org11861fb">
(let ((s (open-stream 'in "teste.txt")))
  (unwind-protect
      (do (read-char s))
    (close-stream s)))
</pre>

<p>
Caso  o  stream  não  possa  ser  aberto,  o  erro  na  abertura  será
retornado.
</p>

<p>
Caso  ocorra   algum  erro  na   execução  das  expressões   em  <code>body</code>,
<code>with-open-stream</code>  ainda garante  que o  stream seja  fechado. O  valor
retornado será o valor de interpretação da última expressão em <code>body</code>.
</p>

<p>
O fechamento do stream está sujeito às regras de uso da forma especial
<code>unwind-protect</code>.
</p>

<p>
Supondo um  arquivo-texto <code>teste.txt</code>  contendo exatamente  os seguintes
caracteres, sem espaço em branco ao final&#x2026;
</p>

<pre class="example" id="org31a183d">
Teste
</pre>

<p>
&#x2026;os exemplos a seguir utilizam-se de tal arquivo.
</p>

<pre class="example" id="org6632602">
&gt; (with-open-stream (stream 'in "/home/alchemist/teste.txt")
    (read-char stream))
#\T

&gt; (with-open-stream (stream 'out "/home/alchemist/teste.txt")
    (read-char stream))
(lit error "{} is not an input stream" #&lt;stream (out) {...}&gt;)
</pre>
</div>
</div>
