A-especificacao.org
*** TODO Variações de ~car~ e ~cdr~

# Desincentivar uso de sintaxe concreta!

- ~first~: Igual a ~(car x)~.
- ~rest~: Igual a ~(cdr x)~.
- ~caar~ (~first-of-first~): Igual a ~(car (car x))~.
- ~cadr~ (~second~): Igual a ~(car (cdr x))~.
- ~cdar~ (~rest-of-first~): Igual a ~(cdr (car x))~.
- ~cddr~ (~rest-of-rest~): Igual a ~(cdr (cdr x))~.
- ~third~: Igual a ~(car (cddr x))~.
- ~fourth~: Igual a ~(cadr (cddr x))~.

** TODO Miscelânea

*** ~(map f (x . xs))~

Mapeia uma  função ~f~ sobre uma  lista, retornando, ao final,  uma nova
lista,  composta do  resultado da  aplicação de  ~f~ sobre  cada um  dos
elementos da lista, em ordem.

Uma possível implementação para ~map~ seria:

#+begin_example
(defn map (f (x . xs))
  (unless (nilp x)
    (cons (f x)
          (map f xs))))
#+end_example

~map~ desestrutura o segundo argumento -- uma lista -- em seus elementos
/car/ e  /cdr/ (~x~  e ~xs~,  respectivamente). Assim, caso  ~x~ não  seja nulo,
aplica-se ~f~  em ~x~ e coleta-se  o resultado, repetindo-se a  função ~map~
recursivamente para ~xs~, até que a lista se esgote.

Caso a lista passada como segundo argumento seja uma lista pontuada, o
último /cdr/ será ignorado.

#+begin_example
> (map (fn (x) (* x x))
       '(1 2 3 4 5))
(1 4 9 16 25)

> (map (fn (x) (* x x))
       '(1 2 3 4 . 5))
(1 4 9 16)
#+end_example

*** ~(mapc f (x . xs))~

Mapeia uma função ~f~ sobre uma lista, retornando ~nil~ ao final.

Uma possível implementação para ~mapc~ seria:

#+begin_example
(defn mapc (f (x . xs))
  (unless (nilp x)
    (f x)
    (mapc f xs)))
#+end_example

~mapc~  opera de  forma muito  similar a  ~map~, todavia  sem a  coleta de
resultados da  aplicação de  ~f~ em  ~x~. Em  outras palavras,  ~mapc~ opera
melhor principalmente  quando seu  uso envolve /efeitos  colaterais/, ou
seja, quando ~f~  não está atrelado à ideia de  apenas retornar um valor
para cada parâmetro a ele passado.

Um exemplo  clássico do  uso de  /efeitos colaterais/  é a  *impressão em
tela*.  Pode-se usar  ~mapc~  para,  por exemplo,  imprimir  cada um  dos
elementos de uma lista, em sequência.

Caso a lista passada como segundo argumento seja uma lista pontuada, o
último /cdr/ será ignorado.

#+begin_example
> (mapc (fn (x) (* x x))
        '(1 2 3 4 5))
nil

> (do (mapc (fn (x) (display x))
            '(1 2 3 4 5))
      (terpri))
; 12345
;
nil
#+end_example

*** ~(assp proc (x . xs))~

Varre uma  /lista associativa/, aplicando ~proc~  à chave de cada  uma das
associações,  sequencialmente.  Caso  uma  aplicação  tenha  um  valor
não-nulo, toda aquela associação será retornada como resposta.

Uma possível implementação para ~assp~ seria:

#+begin_example
(defn assp (proc (x . xs))
  (unless (nilp x)
    (let (((key . rest) x))
      (or (and (proc key) x)
          (assp proc xs)))))
#+end_example

Caso nenhuma associação retorne um  valor não-nulo durante a aplicação
de ~proc~ em sua chave, retorna ~nil~.

#+begin_example
> (assp (fn (x) (eq 'b x))
        '((a . 1) (b . 2) (c . 3)))
(b . 2)

> (assp (eq 'b) '((a . 1) (b . 2) (c . 3)))
(b . 2)

> (assp (eq 'z) '((a . 1) (b . 2) (c . 3)))
nil
#+end_example

*** ~(assoc sym alist)~

Varre uma lista associativa, procurando por ~sym~ nas chaves de cada uma
das associações,  sequencialmente. Quando  ~sym~ corresponde à  chave de
uma associação, toda aquela associação será retornada como resposta.

Para  comparar  ~sym~ com  cada  uma  das  chaves, ~assoc~  utiliza-se  da
função ~equal~, que pode ser  temporariamente alterada através do uso de
uma variável dinâmica.

A função ~assoc~  poderia ser implementada com base na  função ~assp~:

#+begin_example
(defn assoc (sym alist)
  (assp (equal sym) alist))
#+end_example

Caso nenhuma associação possua ~sym~ como sua chave, retorna-se ~nil~.

#+begin_example
> (assoc 'b '((a . 1) (b . 2) (c . 3)))
(b . 2)

> (assoc 'a '((a . 1) (b . 2) (a . 3)))
(a . 1)

> (letfn ((equal (x y)
            (= x y)))
    (assoc 2 '((1 . a) (2 . b) (3 . c))))
(2 . b)

> (assoc 'z '((a . 1) (b . 2) (a . 3)))
nil
#+end_example

*** ~(member elt lst)~

Varre  uma  lista  de  elementos,   procurando  por  ~elt~.  Quando  ~elt~
corresponde  ao primeiro  elemento de  uma sublista,  aquela sublista,
incluindo ~elt~ como primeiro elemento, será retornada.

Para  comparar ~elt~  com cada  um dos  elementos, ~member~ utiliza-se  da
função ~equal~, que pode ser  temporariamente alterada através do uso de
uma variável dinâmica.

A função ~member~ poderia ser implementada da seguinte forma:

#+begin_example
(defn member (elt lst)
  (unless (nilp lst)
    (let (((x . rest) lst))
      (or (and (equal elt x)
               lst)
          (member elt rest)))))
#+end_example

Caso  o elemento  ~elt~ não  se  encontre em  ~lst~, será retornado ~nil~.

#+begin_example
> (member 'a '(x y z a b c))
(a b c)

> (member 'x '(x y z a b c))
(x y z a b c)

> (member 'c '(x y z a b c))
(c)

> (letfn ((equal (x y)
            (= x y)))
    (member 1 '(5 6 7 1 2 3)))
(1 2 3)

> (member 'n '(x y z a b c))
nil
#+end_example

* TODO Aplicação
** Aplicação de clausuras

# Escopo
# 1. Tenta achar a variável no  escopo local (léxico capturado + novos
#    bindings);
# 2. Tenta achar a variável no escopo de invocação (escopo dinâmico);
# 3. Tenta achar a variável no escopo global.

# Aplicação parcial
# - (a b c) -> Pode haver aplicação parcial
# - (a b c . rest) -> AP para a e b, possivelmente c
# - args -> Sem AP
# TODO:  Nos casos  de AP  opcional, o  axioma `&`  deve ser  usado na
# invocação da função.

# Desestruturação
# Desestruturação  não é  como  a aplicação  parcial,  portanto, se  o
# argumento não for  desestruturável (ex. célula cons  ou nil), haverá
# erro. Igualmente,  caso falte argumentos para  desestruturação exata
# (sem lista pontuada no padrão), também será emitido um erro.
# - (a (x .  xs)) -> Desestrutura o segundo argumento,  se ele for uma
#                    lista; caso contrário, retorna erro.
# - (a (b  c) d)  -> Desestrutura  o segundo argumento,  se ele  for uma
#                    lista, tomando apenas dois elementos. Em caso de
#                    quantidade excedente de elementos,  retorna erro.

# Propostas:
# (a (eq 'b) c) -> TALVEZ: Match exato?

** Aplicação de primitivas
** Aplicação de macros

* TODO Interpretação

# Lembrar de retropropagar erros!

