A-especificacao.html

<div id="outline-container-org34d9724" class="outline-4">
<h4 id="org34d9724"><span class="section-number-4">11.10.13.</span> <span class="todo TODO">TODO</span> Variações de <code>car</code> e <code>cdr</code></h4>
<div class="outline-text-4" id="text-11-10-13">
<ul class="org-ul">
<li><code>first</code>: Igual a <code>(car x)</code>.</li>
<li><code>rest</code>: Igual a <code>(cdr x)</code>.</li>
<li><code>caar</code> (<code>first-of-first</code>): Igual a <code>(car (car x))</code>.</li>
<li><code>cadr</code> (<code>second</code>): Igual a <code>(car (cdr x))</code>.</li>
<li><code>cdar</code> (<code>rest-of-first</code>): Igual a <code>(cdr (car x))</code>.</li>
<li><code>cddr</code> (<code>rest-of-rest</code>): Igual a <code>(cdr (cdr x))</code>.</li>
<li><code>third</code>: Igual a <code>(car (cddr x))</code>.</li>
<li><code>fourth</code>: Igual a <code>(cadr (cddr x))</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf055758" class="outline-3">
<h3 id="orgf055758"><span class="section-number-3">11.11.</span> <span class="todo TODO">TODO</span> Miscelânea</h3>
<div class="outline-text-3" id="text-11-11">
</div>
<div id="outline-container-orga8c1eee" class="outline-4">
<h4 id="orga8c1eee"><span class="section-number-4">11.11.1.</span> <code>(map f (x . xs))</code></h4>
<div class="outline-text-4" id="text-11-11-1">
<p>
Mapeia uma  função <code>f</code> sobre uma  lista, retornando, ao final,  uma nova
lista,  composta do  resultado da  aplicação de  <code>f</code> sobre  cada um  dos
elementos da lista, em ordem.
</p>

<p>
Uma possível implementação para <code>map</code> seria:
</p>

<pre class="example" id="org175c49e">
(defn map (f (x . xs))
  (unless (nilp x)
    (cons (f x)
          (map f xs))))
</pre>

<p>
<code>map</code> desestrutura o segundo argumento &#x2013; uma lista &#x2013; em seus elementos
<i>car</i> e  <i>cdr</i> (<code>x</code>  e <code>xs</code>,  respectivamente). Assim, caso  <code>x</code> não  seja nulo,
aplica-se <code>f</code>  em <code>x</code> e coleta-se  o resultado, repetindo-se a  função <code>map</code>
recursivamente para <code>xs</code>, até que a lista se esgote.
</p>

<p>
Caso a lista passada como segundo argumento seja uma lista pontuada, o
último <i>cdr</i> será ignorado.
</p>

<pre class="example" id="orgc12fc6c">
&gt; (map (fn (x) (* x x))
       '(1 2 3 4 5))
(1 4 9 16 25)

&gt; (map (fn (x) (* x x))
       '(1 2 3 4 . 5))
(1 4 9 16)
</pre>
</div>
</div>

<div id="outline-container-org234110e" class="outline-4">
<h4 id="org234110e"><span class="section-number-4">11.11.2.</span> <code>(mapc f (x . xs))</code></h4>
<div class="outline-text-4" id="text-11-11-2">
<p>
Mapeia uma função <code>f</code> sobre uma lista, retornando <code>nil</code> ao final.
</p>

<p>
Uma possível implementação para <code>mapc</code> seria:
</p>

<pre class="example" id="org30047ef">
(defn mapc (f (x . xs))
  (unless (nilp x)
    (f x)
    (mapc f xs)))
</pre>

<p>
<code>mapc</code>  opera de  forma muito  similar a  <code>map</code>, todavia  sem a  coleta de
resultados da  aplicação de  <code>f</code> em  <code>x</code>. Em  outras palavras,  <code>mapc</code> opera
melhor principalmente  quando seu  uso envolve <i>efeitos  colaterais</i>, ou
seja, quando <code>f</code>  não está atrelado à ideia de  apenas retornar um valor
para cada parâmetro a ele passado.
</p>

<p>
Um exemplo  clássico do  uso de  <i>efeitos colaterais</i>  é a  <b>impressão em
tela</b>.  Pode-se usar  <code>mapc</code>  para,  por exemplo,  imprimir  cada um  dos
elementos de uma lista, em sequência.
</p>

<p>
Caso a lista passada como segundo argumento seja uma lista pontuada, o
último <i>cdr</i> será ignorado.
</p>

<pre class="example" id="org25453e1">
&gt; (mapc (fn (x) (* x x))
        '(1 2 3 4 5))
nil

&gt; (do (mapc (fn (x) (display x))
            '(1 2 3 4 5))
      (terpri))
; 12345
;
nil
</pre>
</div>
</div>

<div id="outline-container-orgfedb551" class="outline-4">
<h4 id="orgfedb551"><span class="section-number-4">11.11.3.</span> <code>(assp proc (x . xs))</code></h4>
<div class="outline-text-4" id="text-11-11-3">
<p>
Varre uma  <i>lista associativa</i>, aplicando <code>proc</code>  à chave de cada  uma das
associações,  sequencialmente.  Caso  uma  aplicação  tenha  um  valor
não-nulo, toda aquela associação será retornada como resposta.
</p>

<p>
Uma possível implementação para <code>assp</code> seria:
</p>

<pre class="example" id="org99fd7c4">
(defn assp (proc (x . xs))
  (unless (nilp x)
    (let (((key . rest) x))
      (or (and (proc key) x)
          (assp proc xs)))))
</pre>

<p>
Caso nenhuma associação retorne um  valor não-nulo durante a aplicação
de <code>proc</code> em sua chave, retorna <code>nil</code>.
</p>

<pre class="example" id="orgac26031">
&gt; (assp (fn (x) (eq 'b x))
        '((a . 1) (b . 2) (c . 3)))
(b . 2)

&gt; (assp (eq 'b) '((a . 1) (b . 2) (c . 3)))
(b . 2)

&gt; (assp (eq 'z) '((a . 1) (b . 2) (c . 3)))
nil
</pre>
</div>
</div>

<div id="outline-container-org1cfcc3d" class="outline-4">
<h4 id="org1cfcc3d"><span class="section-number-4">11.11.4.</span> <code>(assoc sym alist)</code></h4>
<div class="outline-text-4" id="text-11-11-4">
<p>
Varre uma lista associativa, procurando por <code>sym</code> nas chaves de cada uma
das associações,  sequencialmente. Quando  <code>sym</code> corresponde à  chave de
uma associação, toda aquela associação será retornada como resposta.
</p>

<p>
Para  comparar  <code>sym</code> com  cada  uma  das  chaves, <code>assoc</code>  utiliza-se  da
função <code>equal</code>, que pode ser  temporariamente alterada através do uso de
uma variável dinâmica.
</p>

<p>
A função <code>assoc</code>  poderia ser implementada com base na  função <code>assp</code>:
</p>

<pre class="example" id="org5d71dfc">
(defn assoc (sym alist)
  (assp (equal sym) alist))
</pre>

<p>
Caso nenhuma associação possua <code>sym</code> como sua chave, retorna-se <code>nil</code>.
</p>

<pre class="example" id="orge79533b">
&gt; (assoc 'b '((a . 1) (b . 2) (c . 3)))
(b . 2)

&gt; (assoc 'a '((a . 1) (b . 2) (a . 3)))
(a . 1)

&gt; (letfn ((equal (x y)
            (= x y)))
    (assoc 2 '((1 . a) (2 . b) (3 . c))))
(2 . b)

&gt; (assoc 'z '((a . 1) (b . 2) (a . 3)))
nil
</pre>
</div>
</div>

<div id="outline-container-orgeeb099a" class="outline-4">
<h4 id="orgeeb099a"><span class="section-number-4">11.11.5.</span> <code>(member elt lst)</code></h4>
<div class="outline-text-4" id="text-11-11-5">
<p>
Varre  uma  lista  de  elementos,   procurando  por  <code>elt</code>.  Quando  <code>elt</code>
corresponde  ao primeiro  elemento de  uma sublista,  aquela sublista,
incluindo <code>elt</code> como primeiro elemento, será retornada.
</p>

<p>
Para  comparar <code>elt</code>  com cada  um dos  elementos, <code>member</code> utiliza-se  da
função <code>equal</code>, que pode ser  temporariamente alterada através do uso de
uma variável dinâmica.
</p>

<p>
A função <code>member</code> poderia ser implementada da seguinte forma:
</p>

<pre class="example" id="orgd7eeed9">
(defn member (elt lst)
  (unless (nilp lst)
    (let (((x . rest) lst))
      (or (and (equal elt x)
               lst)
          (member elt rest)))))
</pre>

<p>
Caso  o elemento  <code>elt</code> não  se  encontre em  <code>lst</code>, será retornado <code>nil</code>.
</p>

<pre class="example" id="org2a8688b">
&gt; (member 'a '(x y z a b c))
(a b c)

&gt; (member 'x '(x y z a b c))
(x y z a b c)

&gt; (member 'c '(x y z a b c))
(c)

&gt; (letfn ((equal (x y)
            (= x y)))
    (member 1 '(5 6 7 1 2 3)))
(1 2 3)

&gt; (member 'n '(x y z a b c))
nil
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga8fef64" class="outline-2">
<h2 id="orga8fef64"><span class="section-number-2">12.</span> <span class="todo TODO">TODO</span> Aplicação</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org2c88f13" class="outline-3">
<h3 id="org2c88f13"><span class="section-number-3">12.1.</span> Aplicação de clausuras</h3>
<div class="outline-text-3" id="text-12-1">
</div>
</div>

<div id="outline-container-orgcfb87d1" class="outline-3">
<h3 id="orgcfb87d1"><span class="section-number-3">12.2.</span> Aplicação de primitivas</h3>
</div>
<div id="outline-container-orga8ca59a" class="outline-3">
<h3 id="orga8ca59a"><span class="section-number-3">12.3.</span> Aplicação de macros</h3>
</div>
</div>

<div id="outline-container-org12ee3f1" class="outline-2">
<h2 id="org12ee3f1"><span class="section-number-2">13.</span> <span class="todo TODO">TODO</span> Interpretação</h2>
<div class="outline-text-2" id="text-13">
</div>
</div>
