A-especificacao.org
* Footnotes

[fn:5] A título de comparação, ~unwind-protect~  é similar a blocos /try-finally/
na linguagem Object Pascal, e ao bloco /finally/ em Java.

[fn:4] Para mais informações sobre campos ordenados, veja a Wikipedia:
https://en.wikipedia.org/wiki/Ordered_field.

[fn:3] Para  maiores informações  a respeito  deste algoritmo,  veja o
tópico,  como   foi  brilhantemente   explicado,  por   Bruce  Dawson:
https://randomascii.wordpress.com/2012/02/25/comparing-floating-point-numbers-2012-edition/.

[fn:2] Caso  seja importante comparar  pela igualdade de  dois números
~float~, Majestic Lisp provê a função  ~float=~, que se baseia em /unidades
de menor precisão/.

[fn:1] Tradução livre do Inglês, /literate program/. 

[fn:8] https://en.wikipedia.org/wiki/CAR_and_CDR 

[fn:6] Mais informações em http://www.paulgraham.com/bel.html. 
