A-especificacao.html
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Tradução livre do Inglês, <i>literate program</i>. 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Caso  seja importante comparar  pela igualdade de  dois números
<code>float</code>, Majestic Lisp provê a função  <code>float=</code>, que se baseia em <i>unidades
de menor precisão</i>.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/CAR_and_CDR">https://en.wikipedia.org/wiki/CAR_and_CDR</a> 
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Para  maiores informações  a respeito  deste algoritmo,  veja o
tópico,  como   foi  brilhantemente   explicado,  por   Bruce  Dawson:
<a href="https://randomascii.wordpress.com/2012/02/25/comparing-floating-point-numbers-2012-edition/">https://randomascii.wordpress.com/2012/02/25/comparing-floating-point-numbers-2012-edition/</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Para mais informações sobre campos ordenados, veja a Wikipedia:
<a href="https://en.wikipedia.org/wiki/Ordered_field">https://en.wikipedia.org/wiki/Ordered_field</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A título de comparação, <code>unwind-protect</code>  é similar a blocos <i>try-finally</i>
na linguagem Object Pascal, e ao bloco <i>finally</i> em Java.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira Lucas S. Vieira</p>
<p class="date">Created: 2022-10-24 seg 00:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
